[
    {
        "id": 1,
        "url": "https://sigarra.up.pt/faup/pt/cur_geral.cur_view?pv_curso_id=45",
        "name": "Mestrado Integrado em Arquitetura ",
        "description": "Herdeiro de uma longa tradição para a qual contribuíram figuras como Álvaro Siza e Eduardo Souto de Moura (vencedores do prestigiado prémio Pritzker em 1992 e 2011, respetivamente), o curso de arquitetura da “Escola do Porto” proporciona-te uma formação generalista orientada para o exercício da profissão, e amplamente reconhecida internacionalmente.",
        "outings": "Gabinetes de arquitetura e urbanismo, colaborando no desenvolvimento do projeto em todas as suas fases e em áreas como a reabilitação, projeto urbano, sustentabilidade, entre outras. As habilitações permitem igualmente a prática da docência e investigação em instituições de ensino superior, bem como a integração em autarquiase serviços centrais do Estado, a colaboração em empresas de construção, fiscalização e gestão de obra ou serviços de consultadoria.",
        "typeOfCourse": "Mestrado Integrado",
        "duration": "10 Semestres / 300 ECTS"
    },
    {
        "id": 2,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=1315",
        "name": "Licenciatura em Artes Plásticas ",
        "description": "A Licenciatura em Artes Plásticas da FBAUP tem como objetivo a formação de profissionais polivalentes através de uma sólida preparação teórica e prática, nos territórios da criação, investigação e expressão plástica.Depois de um primeiro ano comum, a Licenciatura desenvolve-se por três ramos de especialização: Escultura, Multimédia e Pintura. No final, o curso confere acesso a cursos de pós-graduação e mestrado nacionais e internacionais nos domínios da prática artística, estudos de artes visuais, curadoria e educação artística. Ao longo da licenciatura, os estudantes beneficiam também de programas de mobilidade internacional que oferecem oportunidades adicionais de formação e enriquecimento pessoal.",
        "outings": "Atividade de produção artística nos domínios da escultura, multimédia e pintura, atividade no mercado artístico e editorial, atividade nas áreas do teatro, da televisão e similares, ensino artístico e formação tecnológica, direção, gestão e coordenação de equipas, estudos de índole tecnológica ou artística, desenvolvimento de projetos para o espaço público e privado, colaboração com organizações culturais, públicas e privadas.",
        "typeOfCourse": "Licenciatura",
        "duration": "8 Semestres / 240 ECTS"
    },
    {
        "id": 3,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=26741",
        "name": "Licenciatura em Desenho ",
        "description": "Com um programa intensivo, este curso explora o desenho na relação entre o campo artístico e outras aplicações profissionais em diversos setores: narrativa gráfica, ilustração científica e médica, desenho para a animação, reportagem gráfica, desenho digital aplicado, mediação cultural e educativa.",
        "outings": "",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres"
    },
    {
        "id": 4,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=1314",
        "name": "Licenciatura em Design de Comunicação ",
        "description": "A Licenciatura em Design de Comunicação da FBAUP tem como objetivo a formação de profissionais de excelência nos diversos campos do design de comunicação contemporâneo, desenvolvendo-se através de duas componentes complementares: a prática, fortemente associada às realidades culturais e de mercado, e a conceptual e investigativa, que permite aos futuros designers construir os seus espaços de autoria, desenvolvimento e crítica. A Licenciatura em Design de Comunicação confere ainda acesso a cursos de pós-graduação e mestrado nacionais e internacionais em áreas do design, multimédia, ilustração, artes e estudos de cultura visual. Os estudantes beneficiam também de programas de mobilidade internacional que oferecem oportunidades adicionais de formação e enriquecimento pessoal.",
        "outings": "Exercício da profissão liberal, liderança e integração em equipas multidisciplinares de design de comunicação, multimédia e media digitais, consultoria de design, curadoria de exposições ou eventos ligados ao design e à cultura visual, prática pedagógica nas áreas do design e cultura visual.",
        "typeOfCourse": "Licenciatura",
        "duration": "8 Semestres / 240 ECTS"
    },
    {
        "id": 5,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=1011",
        "name": "Licenciatura em Arquitetura Paisagista ",
        "description": "Sabias que os arquitetos paisagistas planeiam, projetam e gerem espaços exteriores onde as pessoas vivem, trabalham e se divertem, harmonizando valores estéticos, funcionais e ambientais? Ao optares por este curso, terás assim a possibilidade de combinar ciência e arte numa formação orientada para o estudo e intervenção em domínios que vão desde a escala do ordenamento do território e da conservação e gestão de grandes e complexas paisagens, até ao projeto de qualificação do espaço público e de parques e jardins de diversas tipologias.",
        "outings": "Os licenciados em Arquitetura Paisagista estão aptos a integrar gabinetes de arquitetura paisagista, arquitetura, urbanismo e engenharia, autarquias e serviços centrais do Estado, instituições detentoras ou gestoras de paisagens, empresas de construção e manutenção de espaços verdes. O cariz profissionalizante do curso potencia ainda a possibilidade de criação dos seus próprios ateliês de estudos e projetos ou de empresas de construção e manutenção.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 6,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=29881",
        "name": "Licenciatura em Bioinformática ",
        "description": "A Bioinformática é uma disciplina na interface das revoluções em curso na Biologia e Ciência de Computadores. Tem como objetivo analisar e compreender dados biológicos e biomédicos, em particular ao nível celular e molecular. Envolve o desenvolvimento e a aplicação de algoritmos e ferramentas computacionais, nomeadamente de inteligência artificial e machine learning, para organizar, analisar e extrair informações relevantes de grandes conjuntos de dados biológicos, contribuindo para avanços em áreas como a genómica e outras ómicas, genética, biologia de sistemas, patologia, ecologia, evolução, epidemiologia, entre outras.",
        "outings": "- Atividades Científico-Tecnológicas em Laboratórios de Instituições de Saúde (p.ex. centros hospitalares e institutos de saúde pública)- Atividades Científico-Tecnológicas de I&D ou de transferência de tecnologia em empresas (p.ex. desenvolvimento de software, farmacêuticas, centros de diagnóstico)- Atividades de Consultoria e Análise de Dados Biomédicos- Investigação Científica em Universidades ou Centros de Investigação",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 7,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=884",
        "name": "Licenciatura em Biologia ",
        "description": "A licenciatura em Biologia permite-te obter uma ampla formação teórica e prática (labo­ratorial e de campo) em domínios tão variados como a Biodiversidade, Biologia Humana, Ecologia, Evolução, Fisiologia, Genética e Microbiologia, abor­dados nos aspetos clássicos e modernos decorrentes da Biologia Celular e Molecular, Bioquímica e Biotec­nologia.",
        "outings": "- Ambiente e Gestão de Recursos Biológicos,- Saúde e Análises Forenses, - Indústrias Alimentar, Farmacêutica e Biotecnológicas,- Produção Animal e Vegetal, - Divulgação em Ciência, - Investigação e Ensino",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 8,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=863",
        "name": "Licenciatura em Bioquímica ",
        "description": "Na Licenciatura em Bioquímica da FCUP encontrarás uma sólida base de conhecimentos fundamentais na área da Bioquímica. Esses conhecimentos traduzem-se por sua vez em competências científicas e tecnológicas aplicáveis em domínios como a Investigação em Laboratórios de Univer­sidades, Centros de Investigação ou empresas, em ciência básica ou aplicada, a compreensão ao nível molecular da arquitetura, divisão e diferen­ciação das células¸ ou a manipu­lação de moléculas e células para produção de substâncias com atividade biológica (ex: novos fármacos).",
        "outings": "O Licenciado em Bioquímica estará apto a desempenhar funções técnicas em indústrias e serviços em diversas áreas científicas, incluindo não só a Bioquímica, mas também a Biofísica, a Biologia Molecular e Celular, a Fisiologia e a Microbiologia. O plano curricular permite ainda a aquisição de competências em áreas científicas facultadas em regime de opção como a Imunologia, a Química Alimentar e a Ecologia, entre outras.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 9,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=885",
        "name": "Licenciatura em Ciência de Computadores ",
        "description": "Se és um/a apaixonado/a pelos computadores, neste curso irás adquirir as competências necessárias para desempenhar funções nos domínios da consultoria em tecnologias da informação, desenho, implementação, desenvolvimento e gestão de sistemas de informação, instalação e administração de sistemas em rede, gestão e desenvolvimento de bases de dados, programação para sistemas móveis/web e multimédia, ensino de tecnologias de informação, e investigação.",
        "outings": "Um licenciado em sistemas computacionais pode exercer funções na Indústria de tecnologias de informação, departamentos e/ou serviços de informática, companhias de telecomunicações fixas e móveis, empresas de desenvolvimento de software, ensino médio e superior, e laboratórios de investigação.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 10,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=887",
        "name": "Licenciatura em Ciências e Tecnologia do Ambiente ",
        "description": "A defesa do ambiente é uma das tuas causas? Então este é o curso certo para ti! Na Licenciatura em Ciências e Tecnologia do Ambiente, encontrarás a formação científica e tecnológica necessária para desempenhares funções em domínios como: avaliação e monitorização da qualidade do ambiente / controlo da poluição, desenvolvimento e gestão de Unidades de Tratamento de Águas Residuais, gestão e conservação de recursos naturais e de resíduos sólidos, dinamização de atividades de Educação Ambiental, investigação.",
        "outings": "Empresas de serviços na área do Ambiente. Indústrias. Administração central e local. Entidades que promovam ações de educação ambiental. Áreas naturais com estatuto de conservação e proteção. Empresas de consultoria, de fiscalização e monitorização ambiental. Centros de Investigação. Docência Universitária.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 11,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=20141",
        "name": "Licenciatura em Engenharia Agronómica ",
        "description": "O 1º ciclo em Engenharia Agronómica tem como objetivo dotar o estudante de uma sólida formação ancorada nas ciências de base da Agronomia, com um percurso centrado na Produção Agrária ou um percurso alternativo centrado na Tecnologia e Ciência Alimentar, de modo a criar e consolidar competências indispensáveis a uma futura profissionalização qualificada nas áreas da produção primária e secundária, respetivamente.",
        "outings": "- Engenheiro agrónomo em empresas de produção primária vegetal ou animal ou de consultoria, assim como serviços ou entidades de relação da agricultura com o ambiente, indústria e desenvolvimento rural,- 2º ciclo, nomeadamente Mestrados em Engenharia Agronómica e em Engenharia de Viticultura e EnologiaFormação Complementar em Tecnologia e Ciência Alimentar- Funções em empresas dos setores da transformação, distribuição e comercialização de produtos alimentares e de serviços de apoio à indústria alimentar- 2º ciclo, nomeadamente Mestrados em Ciências do Consumo e Nutrição, Tecnologia e Ciência Alimentar, Vinho, Turismo e Inovação",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 12,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=24261",
        "name": "Licenciatura em Engenharia e Biotecnologia Florestal ",
        "description": "Resultado de uma aposta inovadora de formação interuniversitária, oferecida em parceria pela Universidade de Trás-os-Montes e Alto Douro e pela Universidade do Porto, a licenciatura em Engenharia e Biotecnologia Florestal (sediada na UTAD) combina o conhecimento do setor florestal com novas ferramentas na fronteira do desenvolvimento tecnológico, como as biotecnologias, a observação remota da Terra ou a inteligência artificial. Pretende-se desta forma formar técnicos qualificados para potenciar a Floresta como fonte de rendimento e de valorização social, no quadro dos desafios do desenvolvimento sustentável.",
        "outings": "Atividades Técnicas, de Investigação e de Consultoria, em entidades públicas ou privadas:- Associações de produtores e/ou proprietários florestais- Empresas de gestão e planeamento de recursos naturais- Gabinetes de projeto e de consultoria- Indústrias biotecnológicas e florestais- Instituições de ensino superior, de investigação científica e desenvolvimento tecnológico- Serviços centrais e regionais da administração pública, autarquias e comunidades intermunicipais",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 13,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=23141",
        "name": "Licenciatura em Engenharia Física ",
        "description": "Totalmente partilhada entre a Faculdade de Ciências (FCUP) e a Faculdade de Engenharia (FEUP), a Licenciatura em Engenharia Física é altamente multidisciplinar e baseia-se numa forte formação científica em Física e Matemática, complementada com uma avançada formação tecnológica em Engenharia. Esta sinergia contribui para maximizar a abrangência da oferta educativa, permitindo formar profissionais habilitados a praticar atos de Engenharia, baseados nos conhecimentos adquiridos nas áreas de especialização, nomeadamente em Materiais Avançados, Micro e Nano Dispositivos, Nanotecnologia, Spintrónica, Ótica, Optoelectrónica, Lasers, Comunicação e Instrumentação, em aspetos fundamentais e aplicados, orientados para a Engenharia.",
        "outings": "- Investigação e desenvolvimento industrial- Empresas de serviços, consultadoria e gestão tecnológica- Laboratórios de controlo de qualidade e certificação- Orientação para domínios como os da Metrologia, Tecnologias de Saúde e Biologia, Sistemas de Informação e Comunicação, Tecnologias de Criogenia e Alto Vácuo, Materiais Funcionais e Micro/Nano Dispositivos em Eletrónica, Optoelectrónica e Comunicações, Sensorização, Lasers e Instrumentação",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 46,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=456",
        "name": "Licenciatura em Línguas Aplicadas ",
        "description": "Dividida em dois perfis distintos (Tradução e Línguas Aplicadas às Relações Empresariais), a licenciatura em Línguas Aplicadas ajuda-te a desenvolver a competência linguístico-comunicativa, tanto na língua materna como nas línguas estrangeiras, e a adquirir e aplicar conhecimentos e competências essenciais para o exercício profissional da Tradução e de áreas afins. Ao longo do curso, vais ainda adquirir conceitos indispensáveis para a compreensão e análise de fenómenos linguísticos e culturais.",
        "outings": "Profissões nas áreas de: Tradução, Gestão, Mediação Cultural, Serviços, Relações Públicas e Indústrias Culturais.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 14,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=19941",
        "name": "Licenciatura em Engenharia Geoespacial ",
        "description": "A Licenciatura em Engenharia Geoespacial da FCUP proporciona-te uma sólida formação nas ciências fundamentais e na informática com áreas tecnológicas específicas tais como a deteção remota, o posicionamento por satélite e os sistemas de informação geográfica (SIG). Nas unidades curriculares da especialidade, vais ainda contactar com as mais recentes tecnologias de aquisição de informação georreferenciada, utilizando plataformas espaciais, aéreas e terrestres e marinhas",
        "outings": "No setor privado, na administração pública, em instituições europeias ou na investigação científica:- Posicionamento e navegação por satélite- Processamento e análise de dados de deteção remota- Tratamento, agregação e disponibilização de informação em ambiente web- Exploração, manipulação e análise de informação geoespacial- Aquisição de informação geoespacial com recurso a veículos terrestres, marinhos e aéreos não tripulados (VANTs)- Desenvolvimento, implementação e disponibilização de aplicações SIG",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 15,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=888",
        "name": "Licenciatura em Física ",
        "description": "A licenciatura em Física desafia-te a descobrir as leis que determinam o funcionamento do mundo! Para isso, combina reflexão e intuição, matemática avançada, computação e envolvência experimental, que te ajudarão a compreender (e dar a compreender) os diferentes fenómenos naturais e a utilizar os sistemas e processos tecnológicos que suportam essas leis. Abre-te ainda as portas para uma formação pós-graduada em áreas como a Astronomia, Engenharia Física, Física Médica, entre muitas outras.",
        "outings": "Um Físico poderá exercer funções de investigador, professor, técnico e consultor em áreas variadas, desde a indústria ao ambiente empresarial, incluindo a Banca e os Seguros. Pode ainda ocupar cargos técnicos de nível intermédio (Laboratórios do Estado, Escolas, Controlo de Qualidade, Serviços/Departamentos de Física-Médica em Hospitais e Clínicas, Empresas de Equipamento Médico, Serviços Financeiros, Seguradoras, Indústrias, Tecnologia de Informação).",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 16,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=889",
        "name": "Licenciatura em Geologia ",
        "description": "A Licenciatura em Geologia, dado o seu caráter multidisciplinar, garante uma formaçãoampla e diversificada nas mais variadas temáticas dentro desta área científica.O curso fornece competências de base para uma pós-graduação, assim como para o exercício de cargostécnicos em diferentes setores de atividade: prospeção, exploração e gestão de recursos minerais metálicos e não metálicos, hidrogeológicos e energéticos, apoio técnico em empresas de construção de estradas e barragens e em projetos de fundação de estruturas, orientação técnica de explorações mineiras, quer na fase de prospeção, quer na fase de exploração e tratamento, identificação de riscos de catástrofes naturais, avaliação de impactos ambientais e apoio técnico na respetiva mitigação.",
        "outings": "- Empresas privadas nacionais e estrangeiras que operam nas áreas acima identificadas- Empresas Públicas, Câmaras Municipais, Instituições de Ensino Superior e de Investigação Científica e Técnica. - - Mercado principal de trabalho: Portugal, PALOP e países emergentes.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 17,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=23521",
        "name": "Licenciatura em Inteligência Artificial e Ciência de Dados ",
        "description": "A Licenciatura em Inteligência Artificial e Ciência de Dados (LIACD) é um curso inovador que tem como objetivo formar profissionais altamente qualificados na área de Inteligência Artificial e Ciência de Dados. Oferece uma forte formação em Ciência de Computadores / Engenharia Informática e sólidos conhecimentos em Matemática.Ao longo do curso, são trabalhadas competências em programação, algoritmia, estatística, métodos numéricos, otimização, aprendizagem computacional, processamento de imagem e de língua natural, robótica e sistemas Inteligentes, segurança e privacidade.",
        "outings": "- Cientista de Dados- Especialista em Machine Learning- Analista de Dados- Especialista em Big Data- Especialista em Inteligência Artificial e Sistemas Inteligentes- Programador especializado em IA e CD- Outras funções genéricas da área da Ciência de Computadores",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 18,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=864",
        "name": "Licenciatura em Matemática ",
        "description": "Números e fórmulas são a tua \"praia\"? Neste curso encontrarás uma sólida e ampla formação básica, que te garantirá os conhecimentos fundamentais nas áreas principais da Matemática e o contacto com as suas aplicações. Como \"bónus\", podes personalizar parte do percurso académico de acordo com as tuas orientações vocacionais e expectativas profissionais, usufruindo da multidisciplinaridade do conhecimento na FCUP em ciências exatas e naturais, ciência de computadores e aplicações à tecnologia.",
        "outings": "Diversos setores da indústria, serviços, tecnologia, atividades financeiras ligadas à banca e seguros, telecomunicações e transportes, exercendo funções em áreas variadas como modelação matemática, análise estatística, análise de dados e desenvolvimento de algoritmos e de software informático. O curso pode ainda abrir portas à frequência de ciclos de pós graduação (mestrados e/ou doutoramentos) em Matemática fundamental ou aplicada, e áreas afins, como Ciências, Engenharia, Economia, Gestão e Informática, entre outras.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 19,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=26281",
        "name": "Licenciatura em Matemática Aplicada ",
        "description": "A importância da Matemática no progresso científico-tecnológico das civilizações tem sido reconhecida desde sempre e continua a ganhar protagonismo na atualidade, marcada pela necessidade de abordagens quantitativas estruturadas, lógicas e inovadoras. O objetivo principal da Licenciatura em Matemática Aplicada é capacitar os estudantes para exercerem o papel transformador da Matemática na sociedade atual. Partindo de uma formação matemática consistente, serão capazes de modelar, simular e/ou apoiar argumentos ou decisões na resolução de problemas da ciência, da indústria ou dos serviços. O ingresso destes licenciados no mercado de trabalho virá dar resposta ao crescente interesse de variadas entidades empregadoras por formações em Matemática Aplicada, motivado pela complexidade dos desafios atuais e pela necessidade de inovação.",
        "outings": "- Consultadoria Financeira e Serviços Actuariais, como Estudos de Mercado, Investimentos, Pricing, Risk Management e Seguros - Indústria, nomeadamente Aeroespacial, Biotecnologia, Distribuição, E-commerce, Energia, Engenharia, Farmacêutica, Tecnologias de Informação, Telecomunicações eTransportes- Instituições Públicas, como ARS, CIVISA, INE, INFARMED, INSA e IPMA- Institutos de Investigação, por exemplo nas áreas das Ciências da Saúde, Ciências Naturais, Engenharia e Matemática",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 20,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=865",
        "name": "Licenciatura em Química ",
        "description": "Desperta o Einstein ou a Marie Curie que há em ti! No curso de Química, damos-te as ferramentas de que necessitas para aplicar em contextos tão diversos como: desenvolvimento de produto e produção industrial, integração em equipas de projeto e/ou de I&D nas áreas de química, engenharia química, ciência e engenharia de materiais, ciências farmacêuticas, biotecnologia, ciências alimentares, controlo de qualidade e ambiental, saúde ou energia, comercialização, demonstração e apoio técnico de equipamento industrial. E porque não seguires uma carreira de docência nos ensinos básico, secundário ou superior?",
        "outings": "Tecido empresarial e industrial, Laboratórios de apoio à indústria, Laboratórios do estado, Laboratórios de controlo de qualidade, Empresas de comercialização de produtos e equipamentos, Escolas e universidades. Áreas de atuação: Indústria e sector alimentares, Investigação científica e desenvolvimento tecnológico, Investigação policial e criminal, indústria têxtil e calçado, setor comercial e apoio técnico em equipamentos, ciência e engenharia de novos materiais, sustentabilidade ambiental, indústria petroquímica e energia, biotecnologia, consultoria, gestão industrial e empresarial, ensino (mediante estudos complementares).",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 21,
        "url": "https://sigarra.up.pt/fcnaup/pt/cur_geral.cur_view?pv_curso_id=833",
        "name": "Licenciatura em Ciências da Nutrição ",
        "description": "A Licenciatura em Ciências da Nutrição é um dos primeiros e, ainda hoje, um dos únicos cursos em Portugal orientados para a formação de futuros Nutricionistas. Na FCNAUP, encontrarás uma formação abrangente, com forte teor prático, que engloba o estudo e a investigação em matérias relacionadas com os alimentos e nutrimentos, mas também nos domínios da fisiologia e anatomia humana, biologia celular e molecular, química orgânica, imunologia, genética, saúde pública, entre outros.O estágio, sendo uma componente central da formação, realiza-se em contexto profissional durante o último semestre da licenciatura.",
        "outings": "Um nutricionista pode exercer a sua profissão nas áreas da saúde pública, nutrição clínica, alimentação coletiva, desporto, indústria agroalimentar, investigação e ensino, podendo exercer, entre outros, em hospitais, centros de saúde, empresas, centros desportivos, farmácias, autarquias, instituições de ensino, tanto no setor público como privado.",
        "typeOfCourse": "Licenciatura",
        "duration": "8 Semestres / 240 ECTS"
    },
    {
        "id": 22,
        "url": "https://sigarra.up.pt/fadeup/pt/cur_geral.cur_view?pv_curso_id=858",
        "name": "Licenciatura em Ciências do Desporto ",
        "description": "Sabias que o curso de Ciências de Desporto da FADEUP está entre os melhores do mundo segundo alguns dos mais conceituados ranking internacionais? E não é por acaso. Ao longo da licenciatura, irás \"descobrir\" o Desporto na pluralidade das suas formas e perspetivas, com atividades direcionadas para a excelência desportiva, saúde, recreação, reabilitação, performance e transcendência da condição humana. Os ramos de especialização incluem: Treino Desportivo (andebol, atletismo, basquetebol, futebol, ginástica, natação, pólo aquático e voleibol), Desporto e Populações Especiais, Exercício e Saúde, e Gestão Desportiva.",
        "outings": "Acesso ao 2º ciclo em Ensino de Educação Física nos Ensinos Básico e Secundário para a lecionação das disciplinas de Educação Física e outras, no sistema educativo público e privado, Treino desportivo, Exercício e Saúde - Atividade física, lazer, recreação, bem-estar das populações em geral e aconselhamento de estilos de vida ativos e saudáveis, Intervenção em populações com necessidades educativas especiais numa perspetiva de atividade física, recreação ou desporto adaptado, Gestão Desportiva (Gestor, Diretor, Consultor, Administrador, Assessor, Auditor, Empresário, Técnico Superior do Desporto) em diversas instituições.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 23,
        "url": "https://sigarra.up.pt/fdup/pt/cur_geral.cur_view?pv_curso_id=574",
        "name": "Licenciatura em Criminologia ",
        "description": "Neste curso pioneiro em Portugal, damos-te a oportunidade de estudar a fundo o fenómeno criminal. Articulando conhecimentos de diferentes áreas científicas - Direito, Ciências do Comportamento, Estatística, Ciências Forense, entre outras - e respetivos métodos, o curso de Criminologia dá-te as ferramentas para desempenhares atividades ligadas à análise criminológica, planeamento de políticas criminais, conceção e execução de programas de prevenção, intervenção comunitária, mediação, consultadoria em diversas áreas, conceção de políticas sociais e penais, investigação científica e ensino.",
        "outings": "Forças policiais, sistema prisional, serviços de reinserção social e execução de medidas e penas, centros educativos para menores delinquentes, centros de acolhimento para crianças e jovens e de assistência a vítimas, programas de prevenção em diferentes contextos (institucional, escolas, projetos comunitários) dirigidos à promoção de comportamentos pró-sociais de crianças e jovens, projetos de prevenção e tratamento da toxicodependência, de prevenção na área da criminalidade e da segurança, de investigação científica e ensino da criminologia.",
        "typeOfCourse": "Licenciatura",
        "duration": "8 Semestres / 240 ECTS"
    },
    {
        "id": 24,
        "url": "https://sigarra.up.pt/fdup/pt/cur_geral.cur_view?pv_curso_id=593",
        "name": "Licenciatura em Direito ",
        "description": "Direcionado para a formação de licenciados aptos para a atividade jurídica, o curso de Direito está estruturado de forma a proporcionar-te os conhecimentos essenciais sobre as diferentes áreas do ordenamento jurídico: ciências privatísticas, ciências políticas, ciências históricas, ciências económicas, ciências criminais, ciências administrativas e direito da União Europeia. Terás ainda disciplinas opcionais que te permitem adequar a tua formação à variedade exigida pela vida profissional.",
        "outings": "Advocacia, Magistratura Judicial, Magistratura do Ministério Público, Diplomacia, Notariado, Registos, Polícia Judiciária, Solicitadoria, Consultadoria Jurídica a empresas, Juízes de paz e mediadores.",
        "typeOfCourse": "Licenciatura",
        "duration": "8 Semestres / 240 ECTS"
    },
    {
        "id": 25,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1052",
        "name": "Licenciatura em Economia ",
        "description": "A Licenciatura em Economia é um curso de banda larga que fornece formação em economia, mas também na área da gestão, a que se juntam diversas áreas instrumentais, como são os casos dos métodos quantitativos, do direito e da contabilidade.Para o estudante que no final da Licenciatura pretenda ingressar no mercado de trabalho, a formação obtida garante-lhe as ferramentas básicas para o efeito. Para o estudante que pretende prosseguir estudos, a Licenciatura em Economia da FEP fornece uma sólida formação que lhe permite aceder, com garantia de sucesso, a qualquer Mestrado nas áreas da economia ou da gestão, seja na FEP, seja em qualquer outra reputada universidade, no país ou no exterior.",
        "outings": "",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 61,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=1338",
        "name": "Mestrado em Design da Imagem ",
        "description": "O Mestrado em Design da Imagem da FBAUP é um curso pluridisciplinar de ensino e de investigação nas áreas de design de cidadania, novos media, ilustração, fotografia, cinema e cultura visual. A partir de aulas teóricas e práticas, os estudantes desenvolvem projetos de investigação aplicada focados em princípios de valorização social, cultural e histórica.",
        "outings": "Design de Comunicação, Design e Cidadania, Fotografia, Cinema, Novos Media, Ilustração, Investigação Científica, Docência.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 26,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1046",
        "name": "Licenciatura em Gestão ",
        "description": "A Licenciatura em Gestão tem como principal objetivo proporcionar a aquisição de conhecimentos e o desenvolvimento de competências transversais, que permitam aos estudantes uma entrada qualificada no mercado de trabalho, desempenhando funções de gestão em diversas organizações, em variadas áreas como a financeira, comercial e marketing, operações, e de recursos humanos. Para além de uma sólida formação nos vários domínios das ciências empresariais e da economia, o curso beneficia do contributo de outras disciplinas das ciências sociais, do direito, da matemática e da gestão da informação. Integra ainda unidades curriculares orientadas para o desenvolvimento de competências pessoais e sociais (soft skills). São estes os conhecimentos que consideramos indispensáveis para a tomada de decisão em ambientes culturais, sociais e ambientais muito diversos, em contexto internacional e em constante mudança.A Licenciatura em Gestão permite, ainda, a obtenção de um duplo grau (de licenciado) com a Universidade de São Paulo, Brasil, uma das Universidades mais prestigiadas da América Latina.",
        "outings": "",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 27,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22801",
        "name": "Licenciatura em Bioengenharia ",
        "description": "O curso de Bioengenharia da U.Porto prepara-te para a resolução multidisciplinar de problemas de biomedicina e de biotecnologia industrial, sob as perspetivas da engenharia de processos e engenharia molecular. Após um tronco comum de três anos, poderás enveredar por um de três ramos ou especializações: Engenharia Biomédica, Biológica e Biotecnologia Molecular.",
        "outings": "Ramo Engenharia Biomédica - instrumentação biomédica, processamento e análise de sinais e imagens biomédicas, dispositivos médicos (próteses externas e internas), engenharia de tecidos (nomeadamente para medicina regenerativa) telemedicina, bioinformática, robótica médica (cirurgia minimamente invasiva), e biónica.Ramo Engenharia Biológica - indústrias de processos químico-biológicos (farmacêutica, alimentar, cosméticos, aromas) e de valorização de materiais naturais (madeira, couro, materiais e produtos de origem marinha), ambiente e saúde ambiental (tratamento de resíduos contaminados, qualidade ambiental em unidades hospitalares e empresas da área da saúde).Ramo Biotecnologia Molecular- sectores onde é prioritário a conceção e desenvolvimento de novos produtos com base em biologia molecular, particularmente fármacos e sistemas de diagnóstico.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 28,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22802",
        "name": "Licenciatura em Engenharia Civil ",
        "description": "Reunindo uma formação de base sólida e forte conteúdo científico, com um forte ênfase na interação entre teoria e prática, o curso de Engenharia Civil prepara-te para lidares com uma ampla gama de temas complexos e para iniciares uma carreira profissional em organizações públicas e privadas, ou na investigação científica.",
        "outings": "As saídas profissionais principais para os licenciados em Engenharia Civil consistem no projecto, execução, fiscalização, coordenação e controlo de:obras públicas, nomeadamente edifícios, vias de comunicação rodoviária e ferroviária, pontes e viadutos, aproveitamentos hidráulicos e obras de saneamento básico,obras privadas, sobretudo edifícios de habitação, edifícios industriais e infra-estruturas.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 29,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22902",
        "name": "Licenciatura em Engenharia de Materiais ",
        "description": "Na Licenciatura em Engenharia de Materiais, encontrarás uma sólida formação em Ciências dos Materiais, Caracterização, Tecnologia e Processamento, Projeto, Gestão e Inovação em Materiais, que te permitirá contribuir – em contexto de Indústria, Serviços ou na Investigação – para o avanço tecnológico em áreas tão diversas como a indústria automóvel, aeroespacial, petroquímica, biomédica ou eletrónica.",
        "outings": "Os diplomados em Engenharia de Materiais têm encontrado colocação adequada às suas qualificações na Indústria, nos Serviços e na Investigação. As principais saídas profissionais abrangem um conjunto largo de empresas com necessidade de especialistas em metais, polímeros, cerâmicos e compósitos, processamento de metais, fundição, tratamentos térmicos, corrosão e aplicação de revestimentos, projeto de componentes, inspeção, ensaios e certificação de sistemas, gestão ambiental e tratamento de resíduos, gestão de operações e melhoria contínua.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 30,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=738",
        "name": "Licenciatura em Engenharia de Minas e Geo-Ambiente ",
        "description": "A L.EMG é o primeiro ciclo de estudos (licenciatura) em engenharia de minas da FEUP. Tem como objetivo a preparação básica, científica e técnica, necessária para engenheiros de minas com um perfil de conceção, capazes não só de operar mas também conceber um sistema mineiro com toda a sua complexidade.",
        "outings": "Na área da indústria extrativa: Exploração e tratamento de minérios metálicos, industriais, combustíveis, rochas ornamentais e materiais inertes. Campos de atividade: indústria extrativa em minas, pedreiras, cimenteiras e indústria da água, construção civil, envolvendo movimentação de terras, túneis e barragens. Serviços: laboratórios de investigação aplicada, fiscalização e licenciamento, gabinetes de projeto e de planeamento. Na área do ambiente: Estudos de impacto e diagnóstico ambiental, tecnologias ambientais relativas ao tratamento de resíduos sólidos e de intervenção em locais contaminados, especialmente água subterrânea e solos. Campos de atividade: Empresas vocacionadas para intervenções na área Geo-ambiente, gabinetes de projeto, serviços de ordenamento territorial.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 31,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22803",
        "name": "Licenciatura em Engenharia do Ambiente ",
        "description": "Vamos combater a poluição!? Neste curso, ficarás a conhecer a forma como os poluentes são gerados, medidos e controlados, com a ajuda de aulas laboratoriais e incentivos à discussão e crítica. Tudo isto assente numa visão integrada, holística e multidisciplinar aos problemas ambientais, que te permitirá desenvolver a capacidade de prevenir e de identificar efeitos ambientais perversos, de os solucionar tecnologicamente e de integrar as soluções num desenvolvimento industrial e social que se deseja sustentável. Os Engenheiros do Ambiente desempenham funções em indústrias, empresas de diferentes especialidades ou dedicadas ao ambiente, assim como nos serviços e agências municipais, em áreas tais como: Avaliação ambiental, Gestão ambiental, Ecologia industrial, Gestão de recursos hídricos, Projeto e gestão de estações de abastecimento e tratamento de águas/águas residuais, Projeto e gestão de sistemas de tratamento de resíduos sólidos, Reabilitação de solos e aquíferos, Gestão de ecossistemas, Alterações climáticas e qualidade do ar, Acústica e vibrações, Planeamento e ordenamento do território, Utilização e implicações ambientais das diferentes fontes de energia, Saúde ambiental e segurança no trabalho.",
        "outings": "Os Engenheiros do Ambiente desempenham funções em indústrias, empresas de diferentes especialidades ou dedicadas ao ambiente, assim como nos serviços e agências municipais, em áreas tais como: Avaliação ambiental, Gestão ambiental, Ecologia industrial, Gestão de recursos hídricos, Projeto e gestão de estações de abastecimento e tratamento de águas/águas residuais, Projeto e gestão de sistemas de tratamento de resíduos sólidos, Reabilitação de solos e aquíferos, Gestão de ecossistemas, Alterações climáticas e qualidade do ar, Acústica e vibrações, Planeamento e ordenamento do território, Utilização e implicações ambientais das diferentes fontes de energia, Saúde ambiental e segurança no trabalho.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 45,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=453",
        "name": "Licenciatura em História da Arte ",
        "description": "Para lá de uma visão privilegiada sobre a evolução das várias formas artísticas em diferentes contextos histórico-culturais, a licenciatura em História da Arte permite-te desenvolver competências ao nível da investigação, bem como uma consciência crítica e construtiva sobre o papel social e cultural da Arte.",
        "outings": "Um diplomado em História da Arte está habilitado a exercer funções de investigador, autor, consultor, programador, coordenador (estudos de desenvolvimento potenciando espólios artísticos e bens patrimoniais imóveis), e formador (cursos, conferências e outras atividades educativas) em gabinetes, museus, galerias, centros culturais, fundações, institutos, empresas e outras entidades, públicas ou privadas.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 32,
        "url": "https://paginas.fe.up.pt/~estudar/cursos/licenciatura-engenharia-gestao-industrial/",
        "name": "Licenciatura em Engenharia e Gestão Industrial ",
        "description": "O objetivo do curso é educar profissionais que combinem o domínio de técnicas de gestão com uma sólida formação em engenharia. O curso envolve uma formação em matemática e física, à qual se alia um conhecimento integrado de questões tecnológicas nas áreas de Conceção e Fabrico, Fluídos e Energia e Automação Industrial. Os estudantes adquirem conhecimentos abrangentes do funcionamento das empresas e da economia. Os graduados devem apoiar a tomada de decisões nas organizações, sendo agentes ativos de mudança e inovação. Os estudantes são incentivados a desenvolver diversas competências sociais, tais como a capacidade de comunicação, a responsabilidade social e o trabalho em grupo.",
        "outings": "O ciclo de estudos pretende alicerçar conhecimentos que possam ter seguimento em formações posteriores em Engenharia e Gestão Industrial, com vista a potenciar carreiras profissionais na indústria ou nos serviços. Os graduados podem exercer funções de gestão em várias áreas funcionais de empresas, incluindo gestão de operações, sistemas de informação e análise financeira. Aqueles que demonstrem apetência para o empreendedorismo, inovação e liderança poderão iniciar seus próprios negócios.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 33,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22823",
        "name": "Licenciatura em Engenharia Eletrotécnica e de Computadores ",
        "description": "A Licenciatura em Engenharia Eletrotécnica e de Computadores (EEC) da FEUP garante-te uma formação sólida em Matemática (Álgebra, Análise Matemática, Métodos Numéricos, Probabilidades e Estatística), Física (Mecânica e Ondas, Termodinâmica e Estrutura da Matéria, Eletromagnetismo), Engenharia Eletrotécnica e de Computadores: Análise de Circuitos, Sinais e Sistemas (contínuos e discretos), Teoria do Controlo, Sistemas Digitais e Arquitetura de Computadores, Programação, Instrumentação e Medição, e Sistemas Elétricos de Energia.No final do curso, estarás apto a analisar sistemas elétricos e eletrónicos de alguma complexidade, a explicar quantitativamente os seus princípios de funcionamento e a avaliar o respetivo desempenho. Pelo caminho, vai também poder desenvolver a capacidade de expressão, de trabalho em equipa e de liderança, e adquirir sensibilidade a questões éticas e ambientais.",
        "outings": "A formação de base ampla oferecida pela LEEC é complementada por uma formação específica actualizada em áreas de grande relevância para o desenvolvimento do país. Os seus Licenciados encontram múltiplas oportunidades profissionais nos sectores da indústria e dos serviços tradicionalmente ligados à Engenharia Electrotécnica e de Computadores (Energia, Telecomunicações, Sistemas de Informação, Electrónica, Controlo e Instrumentação) e, de uma maneira geral, em todas as actividades que fazem uso das tecnologias da informação em tarefas de planeamento, exploração, manutenção e gestão.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 34,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22841",
        "name": "Licenciatura em Engenharia Informática e Computação ",
        "description": "Se procuras uma formação avançada e reconhecida pelo mercado de trabalho nos domínios da arquitetura de sistemas informáticos e das tecnologias de informação e comunicação, este é o curso certo para ti! Assente numa sólida formação de base nas diversas áreas da informática, a Licenciatura em Engenharia Informática e Computação abre-te as portas a uma especialização em áreas tão diversas como: Engenharia de Software e Sistemas de Informação, Redes e Tecnologias de Informação, Sistemas Inteligentes e Multimédia.",
        "outings": "Integração em equipas de desenvolvimento de aplicações para variadas plataformas (Web, dispositivos móveis, etc.) e domínios de aplicação (saúde, transportes, comércio eletrónico, indústria, banca e seguros, entretenimento, governo eletrónico, etc.),integração em equipas de gestão de operações de TIC (atuando ao nível da administração de sistemas, administração de redes de computadores, administração de dados, cibersegurança, etc.),ingresso num curso de mestrado (mestrado de continuidade ou mestrados mais especializados) para aprofundamento e especialização de conhecimentos numa área de interesse individual.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 35,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22882",
        "name": "Licenciatura em Engenharia Mecânica ",
        "description": "Na Licenciatura em Engenharia Mecânica, damos-te a oportunidade de aplicares as competências técnicas e os conhecimentos obtidos na resolução, de forma integrada, de um elevado número de problemas da humanidade, como a melhoria das condições de vida e a sustentabilidade do planeta. Como? Através de uma formação integrada, multidisciplinar, e que te oferece cinco campos de especialização: Automação, Gestão da Produção, Energia Térmica, Projeto e Construção Mecânica, e Produção, Conceção e Fabrico. Construção de equipamentos mecânicos e térmicos (veículos automóveis e ferroviários, máquinas-ferramenta, estruturas metálicas, caldeiras, permutadores de calor…), Produção de energia (energia térmica, energia eólica, novas energias, climatização, qualidade do ar interior…), Planeamento e de gestão da produção (logística, transportes, manutenção industrial, gestão de recursos humanos, gestão da qualidade…), Automação industrial (automatização de linhas de produção, robótica, sistemas de controlo…), Desenvolvimento e aplicação de novos materiais (materiais cerâmicos, compósitos, poliméricos, bio-materiais…), Projeto e desenvolvimento de novos produtos (design integrado, ergonomia, sustentabilidade, …),",
        "outings": "",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 36,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22903",
        "name": "Licenciatura em Engenharia Química ",
        "description": "O curso de Engenharia Química proporciona uma forte formação de base em Matemática, Química, Física, Ciências Biológicas e Ciências da Engenharia Química. Assente numa cultura prática de engenharia em simultâneo coma a atividade de projeto, o curso oferece-te ainda a possibilidade de especialização em três ramos distintos: Processos & Produto, Energia e Ambiente, e Biotecnologia.",
        "outings": "As saídas profissionais dos Licenciados em Engenharia Química pela FEUP incluem um largo leque de oportunidades em atividades industriais ou em serviços, seja no setor privado, seja no público. Para além disso, ficam dotados de competências para ingressarem num 2º ciclo em Engenharia Química ou em áreas afins.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 37,
        "url": "https://sigarra.up.pt/ffup/pt/WEB_BASE.GERA_PAGINA?p_pagina=122205",
        "name": "Mestrado Integrado em Ciências Farmacêuticas ",
        "description": "Aquele que é um dos mais antigos cursos de Ciências Farmacêuticas do país assenta numa formação de banda larga, pensada com o objetivo de formar profissionais altamente qualificados, capazes de exercerem as diversas atividades associadas à profissão farmacêutica. Segue a nossa receita!",
        "outings": "Análises Clínicas, Análises Químicas e Biológicas, Distribuição de Medicamentos, Farmácia Comunitária, Farmácia Hospitalar, Indústria Farmacêutica, e Investigação.",
        "typeOfCourse": "Mestrado Integrado",
        "duration": "10 Semestres / 300 ECTS"
    },
    {
        "id": 38,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=339",
        "name": "Licenciatura em Arqueologia ",
        "description": "A licenciatura em Arqueologia da FLUP oferece-te uma \"paisagem\" privilegiada sobre as grandes áreas da Arqueologia, desde a Arqueologia Pré-Histórica à Arqueologia Moderna e Contemporânea. O objetivo do curso passa por formar arqueólogos capazes de lidar com informação complexa e contraditória, aptos a integrar equipas de investigação e dotados de consciência crítica sobre o papel e o lugar do Homem no mundo .",
        "outings": "O diplomado em Arqueologia pode desempenhar tarefas nos domínios do Património Arqueológico e Cultural, nomeadamente em organismos da administração central e desconcentrada, em organismos autárquicos (gabinetes de arqueologia, divisões de património, etc.), em museus (nacionais, municipais ou outros) e instituições públicas ou privadas com coleções, gabinetes de arquitetura, gabinetes de gestão patrimonial, empresas de Arqueologia e outras empresas ligadas ao Património. Pode, ainda, exercer atividade na área de investigação ou como Profissional Liberal.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 39,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=454",
        "name": "Licenciatura em Ciência da Informação ",
        "description": "Na licenciatura em Ciência da Informação da U.Porto, encontrarás uma formação ajustada à nova realidade da Sociedade da Informação, em que os profissionais dos arquivos e das bibliotecas, os administradores de dados e sistemas de informação e, em geral, os gestores de informação nas organizações desenvolvem a sua atividade. No final do curso, espera-se que estejas habilitado a utilizar adequadamente as tecnologias como meio indissociável dos processos de produção, tratamento e difusão da informação e compreender e aplicar técnicas de avaliação de fontes e recursos de informação e técnicas de gestão de sistemas e serviços de informação.",
        "outings": "Administrador de dados, Analista de informação, Arquivista, Auditor de informação, Bibliotecário, Cientista da informação, Consultor em informação, Documentalista, Gestor de informação ou gestor de conteúdos, nomeadamente na Internet, Gestor de recursos de informação, Gestor de sistemas de informação em organismos públicos ou privados.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 40,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=455",
        "name": "Licenciatura em Ciências da Comunicação ",
        "description": "Assente num plano de estudos que combina os conhecimentos de teoria da comunicação com uma forte componente prática em modernos estúdios de televisão e rádio e laboratórios multimédia online, o curso de Ciências da Comunicação da U.Porto garante-te a formação adequada para o exercício de diferentes profissões dentro do universo da Comunicação. Para ajudar, no fim dos dois primeiros anos da licenciatura, poderás optar por um dos seguintes ramos de especialização: Jornalismo, Assessoria ou Multimédia.",
        "outings": "Jornalismo (escrito, radiofónico, televisivo e online) e Comunicação, Assessoria da Comunicação (relações públicas, assessoria de imprensa e de imagem, comunicação empresarial), Comunicação Multimédia (conceção e produção de conteúdos multimédia).",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 41,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=460",
        "name": "Licenciatura em Ciências da Linguagem ",
        "description": "Tendo como objeto de estudo a linguagem verbal humana e as línguas naturais, a licenciatura em Ciências da Linguagem assenta numa abordagem teórico-prática que te permitirá estudar, de forma aprofundada, as propriedades da gramática das línguas naturais (com especial incidência na Língua Portuguesa), mas também as formas de aquisição de língua materna e de línguas não maternas, ou o modo de processamento da linguagem oral e escrita. O curso apresenta dois percursos de formação: Linguística e Português Língua Não Materna.",
        "outings": "Variante de Linguística: investigação pluridisciplinar, linguística computacional, linguística clínica, lexicografia e terminologia (produção de dicionários), edição de textos, consultoria linguística, assessorias, dinamização cultural e ensino do português-língua materna.Variante de Português Língua Não Materna: investigação, cursos de pós-graduação profissionalizantes, ensino do português-língua não materna, produção de materiais didáticos do português língua não materna, assessoria, consultoria linguística, dinamização cultural.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 42,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=340",
        "name": "Licenciatura em Filosofia ",
        "description": "Na licenciatura em Filosofia, propomos-te uma \"viagem\" recheada de conhecimento, reflexão crítica e argumentação, na companhia das obras e autores mais representativos dos 2.500 anos de História da Filosofia. Pelo meio, irás desenvolver competências que podes aplicar na análise de conceitos e argumentos e no questionamento da ação humana e das ciências, vais explorar os domínios centrais da Filosofia (metafísica, epistemologia, lógica, ética, filosofia política e estética), bem como outros mais específicos, tais como a fenomenologia, a filosofia da religião, ou a bioética.",
        "outings": "Docência, investigação científica, fundamental e aplicada, atividade editorial e no campo das artes, atividade política e diplomática, comunicação social, dinamização cultural.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 43,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=341",
        "name": "Licenciatura em Geografia ",
        "description": "Situada nas áreas de confluência entre as Ciências da Terra e do Ambiente e as Ciências Sociais, a licenciatura em Geografia confere uma sólida formação de base em torno dos conceitos transversais de ambiente, recursos naturais, território, ordenamento e sociedade. Com uma forte componente prática, o curso utiliza como instrumentos base de trabalho as tecnologias de informação e a cartografia.",
        "outings": "Organizações e serviços públicos e privados ligados ao Planeamento, Ordenamento e Gestão do Território, Cartografia e Sistemas de Informação Geográfica, Turismo, Investigação em Geografia Física e Geografia Humana, Ensino (básico, secundário e superior).",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 44,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=342",
        "name": "Licenciatura em História ",
        "description": "Na licenciatura em História da FLUP, encontrarás uma formação sólida na área científica da História, a qual te permitirá: compreender a forma como as pessoas existiam, interagiam e pensavam nos diferentes contextos históricos, interpretar e usar de uma forma crítica textos e outras fontes de informação, apreciar a complexidade e diversidade de situações, acontecimentos e mentalidades do passado, e conhecer os problemas inerentes ao registo histórico em si mesmo. Tudo isto apoiado em conhecimentos, instrumentos e técnicas orientados para a intervenção profissionalizada nos universos cultural e social.",
        "outings": "Ensino, Investigação científica, Turismo, Gestão de programas culturais, Relações Públicas e Comunicação social, Atividade editorial, Atividade de consultadoria, Produção de conteúdos, Câmaras e Fundações, Arquivos e Bibliotecas, Museus, Gabinetes de estudo.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 47,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=458",
        "name": "Licenciatura em Línguas e Relações Internacionais ",
        "description": "Diferenciada pelo seu carácter transversal, a licenciatura em Línguas e Relações Internacionais oferece-te uma sólida formação em duas línguas estrangeiras, bem como conhecimentos aprofundados nos domínios da sociologia, do direito, da economia e da história, numa perspetiva internacional. Pelo meio, vais poder conhecer e explorar os conceitos, teorias, estruturas, métodos e a natureza das relações internacionais nos seus contextos histórico-políticos e socioeconómicos.",
        "outings": "Profissões que exijam um bom conhecimento da área das Relações Internacionais, nomeadamente em instituições europeias, embaixadas e consulados, empresas com relações internacionais e órgãos de comunicação social. Esta formação poderá viabilizar o futuro acesso à carreira diplomática e à carreira de investigação na área.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 48,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=457",
        "name": "Licenciatura em Línguas, Literaturas e Culturas ",
        "description": "Estudar de forma aprofundada o Alemão, o Espanhol, o Francês, o Inglês ou o Latim e o Grego, desvendar a cultura clássica, ou descobrir a literatura dos países africanos de expressão portuguesa... Tudo isso é possível neste curso orientado para o ensino alargado das línguas, culturas e literaturas, bem como de unidades curriculares que problematizam os fenómenos linguístico e literário, permitindo uma aplicação prática no ensino das línguas e nas relações interculturais.",
        "outings": "Profissões que exijam um bom domínio da língua portuguesa e de línguas estrangeiras, designadamente em instituições europeias, embaixadas e consulados, empresas com relações internacionais, órgãos de comunicação social, turismo, indústria editorial, gestão de recursos humanos e animação cultural. A formação em Ensino permitirá a lecionação de Português e Línguas Estrangeiras nos ensinos básico e secundário.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 49,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=25501",
        "name": "Licenciatura em Literatura e Estudos Interartes ",
        "description": "",
        "outings": "",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 50,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=452",
        "name": "Licenciatura em Sociologia ",
        "description": "O Curso de Sociologia dá-te a possibilidade de adquirires: competências nos domínios estruturadores do pensamento sociológico, competências metodológicas orientadas para a análise dos processos sociais, e competências de intervenção social cientificamente sustentadas. Espera-se ainda que fiques a conhecer a produção sociológica nacional e internacional, e desenvolvas uma cultura de cidadania crítica e reflexiva, juntamente com posturas profissionais assentes em princípios éticos.",
        "outings": "Organizações sociais e empresariais: Integração em equipas de sondagens, elaboração de estudos de mercado, de publicidade e marketing, coordenação e implementação de estudos sobre clima social, satisfação laboral, comunicação interna, avaliação de projetos de intervenção social, formação, desenvolvimento de processos de melhoria contínua, gestão de recursos humanos, mediação de conflitos.Autarquias e instâncias do desenvolvimento regional e local: coordenação e implementação de medidas de intervenção social, urbanística, ambiental e escolar, gestão e requalificação do património cultural, formação e animação cultural.Organizações públicas e privadas: conceção e implementação de políticas sociais, promoção de estratégias de inclusão de grupos sociais desfavorecidos, colaboração na administração organizacional escolar, hospitalar ou de outra instituição, conceção e implementação de medidas de política de saúde, de emprego, de educação e formação, de habitação, de cultura e turismo.Centros de investigação: análise de bibliografia e produção de textos científicos, desenvolvimento de trabalho de campo, produção tratamento e análise de informação.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 51,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1201",
        "name": "Mestrado Integrado em Medicina ",
        "description": "O Mestrado Integrado em Medicina da FMUP oferece uma formação prática intensa, abrangente e adaptada às necessidades dos futuros médicos, privilegiando o contacto precoce com unidades de saúde e doentes.Com acesos privilegiado a um conjunto alargado de unidades curriculares opcionais, os estudantes têm ainda a oportunidade de diferenciar e personalizar a sua formação e de participar, desde muito cedo no seu percurso académico, em atividades diversas, designadamente de investigação biomédica.No final do ciclo de estudos, o estudante deverá ter adquirido sólida formação científica e ter desenvolvido todas as competências indispensáveis ao exercício idóneo e responsável da Medicina.",
        "outings": "Carreira Médica, Investigação Médica, Consultadoria na indústria farmacêutica, Ensino médico.",
        "typeOfCourse": "Mestrado Integrado",
        "duration": "12 Semestres / 360 ECTS"
    },
    {
        "id": 52,
        "url": "https://sigarra.up.pt/fmdup/pt/cur_geral.cur_view?pv_curso_id=1220",
        "name": "Mestrado Integrado em Medicina Dentária ",
        "description": "Sustentado numa formação sólida, integrada e global do âmbito das ciências biológicas e médicas, o Mestrado Integrado em Medicina Dentária permite-te desenvolver todas as competências necessárias para a prática clínica como Médico Dentista ao mais alto nível. Concebido para ir de encontro às características do atual mercado do trabalho, o curso privilegia uma preparação científica abrangente, o desenvolvimento de competências transversais e a capacidade para conceptualizar projetos e integrar equipas. De modo a acompanhar a evolução contante do conhecimento cientifico e as necessidades da comunidade em matéria de saúde oral, a formação aposta no ensino pós-graduado, disponibilizando com regularidade cursos de Pós-Graduação, Mestrado e Educação Contínua.",
        "outings": "Exercício da profissão de Médico Dentista em regime público ou privado, Docência, Investigação.",
        "typeOfCourse": "Mestrado Integrado",
        "duration": "10 Semestres / 300 ECTS"
    },
    {
        "id": 53,
        "url": "https://sigarra.up.pt/fpceup/pt/cur_geral.cur_view?pv_curso_id=818",
        "name": "Licenciatura em Ciências da Educação ",
        "description": "A Licenciatura em Ciências da Educação (LCED) proporciona uma formação de \"banda larga\", que permitirá adquirir conhecimento científico para compreender os processos educativos e desenvolver competências de intervenção profissional em múltiplas áreas e em contextos de educação e formação para públicos de diferentes idades. O curso está estruturado em torno de quatro componentes, articuladas entre si: i) formação teórica pluridisciplinar em Educação, ii) formação em metodologias de investigação e intervenção, iii) formação teórico-prática promotora de competências comunicativo-relacionais, reflexivas e críticas, seminário de iniciação à mediação e à formação.",
        "outings": "Técnica/o de educação em Agências de Desenvolvimento Local, Associações culturais, recreativas, desportivas, Autarquias (Câmaras Municipais, Juntas de Freguesia), ONG, Casas de Juventude, Centros de Educação e Formação de Adultos, Departamentos de formação em empresas, Centros de Dia, Centros Sociais e Comunitários, Comissões de Proteção de Crianças e Jovens (CPCJ), Departamentos/Equipas de Educação para a Saúde, Escolas e Agrupamentos do Ensino Básico e Secundário e TEIP, Lares de Infância e Juventude, Serviços Educativos e Culturais para a infância, juventude e 3.ª idade (Museus, Bibliotecas Municipais, Parques/Quintas/espaços verdes).",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 54,
        "url": "https://sigarra.up.pt/fpceup/pt/cur_geral.cur_view?pv_curso_id=22381",
        "name": "Licenciatura em Psicologia ",
        "description": "A Licenciatura em Psicologia (LPSI) permite realizar uma formação inicial em Psicologia, através da aprendizagem de conteúdos e competências fundamentais, em conformidade com o EuroPsy/Certificado Europeu de Psicologia. Ao longo do curso, os/as estudantes adquirem conhecimentos básicos que contribuem para uma melhor compreensão da complexidade biopsicossocial do comportamento humano e das áreas de atuação da Psicologia (Clínica, Saúde, Educação, Organizações, Social, Trabalho, Justiça,...), ao mesmo tempo que desenvolvem uma compreensão crítica das teorias, dos métodos e das dimensões ética e deontológica da Psicologia.",
        "outings": "A Licenciatura em Psicologia é direcionada para os/as candidatos/as que pretendam adquirir conhecimentos e competências para:- Aceder a um 2.º Ciclo em Psicologia (Mestrado) e, por essa via, reunir as condições académicas para o exercício profissional da Psicologia,- Prosseguir para um 3º Ciclo (Doutoramento),- Aceder a um 2.º Ciclo em outras áreas científicas e profissionais.Este curso pode ainda constituir um complemento de formação para profissionais provenientes de outras áreas científicas.",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 55,
        "url": "https://sigarra.up.pt/icbas/pt/cur_geral.cur_view?pv_curso_id=1288",
        "name": "Licenciatura em Ciências do Meio Aquático ",
        "description": "Estruturada para a formação de investigadores, docentes e quadros superiores de instituições e de empresas com sólidos conhecimentos teóricos e práticos em Biologia Geral e Aquática, a licenciatura em Ciências o Meio Aquático do ICBAS destina-se a estudantes vocacionados para a biologia marinha, ecologia aquática, biotecnologia marinha, oceanografia, proteção da biodiversidade, aquacultura e pescas, gestão sustentável de recursos aquáticos e tecnologia alimentar. Se é o teu caso, mergulha neste curso!",
        "outings": "Investigação científica, aquários e parques biológicos, divulgação científica e educação ambiental, ensino (superior, profissional e secundário), indústria alimentar, aquacultura e pescas, gestão ambiental e qualidade da água (ETARs, laboratórios de análise, etc.).",
        "typeOfCourse": "Licenciatura",
        "duration": "6 Semestres / 180 ECTS"
    },
    {
        "id": 56,
        "url": "https://sigarra.up.pt/icbas/pt/cur_geral.cur_view?pv_curso_id=1289",
        "name": "Mestrado Integrado em Medicina ",
        "description": "\"O Médico que só sabe de Medicina, nem de Medicina sabe\". A frase pertence a Abel Salazar - professor histórico da U.Porto - e tem a sua expressão máxima no Mestrado Integrado em Medicina do ICBAS, assente num projeto pedagógico e institucional diferente da formação tradicional da Medicina.Privilegiando o contacto clínico precoce dos estudantes, o curso assume uma abordagem inovadora, assente no equilíbrio entre ciências exatas, biológicas, sociais e médicas, lecionadas por equipas multidisciplinares. De modo a formar médicos com uma preparação o mais abrangente possível, o ICBAS conta com a colaboração do \"vizinho\" Centro Hospitalar Universitário de Santo António (CHUP) e de outras instituições de saúde locais.",
        "outings": "O Mestrado Integrado em Medicina do ICBAS oferece o leque de saídas profissionais da área médica, como sejam a prática de Medicina, a investigação em Ciências Médicas e Biomédicas e a Indústria.",
        "typeOfCourse": "Mestrado Integrado",
        "duration": "12 Semestres / 360 ECTS"
    },
    {
        "id": 57,
        "url": "https://sigarra.up.pt/icbas/pt/cur_geral.cur_view?pv_curso_id=1290",
        "name": "Mestrado Integrado em Medicina Veterinária ",
        "description": "Assente numa sólida formação cientifica nos diferentes domínios ligados direta ou indiretamente ao bem-estar animal, o curso de Medicina Veterinária proporciona-te o treino, ao mais alto nível, em clínica e produção animal, com especial ênfase nos animais de companhia, cavalos, bovinos e pequenos ruminantes. Parte da formação é lecionada no Centro Clínico de Vairão (Vila do Conde), que inclui o Centro Clínico de Equinos de Vairão (CCEV) e o Centro de Reprodução Animal de Vairão. A componente direcionada aos animais de companhia é lecionada no Hospital Veterinário da Universidade do Porto.",
        "outings": "Medicina e Cirurgia de animais de companhia, de produção e de equinos, Controlo das doenças dos animais e Zoonoses, Saúde Pública, Qualidade e Segurança Alimentar, Gestão e desenvolvimento dos sistemas de produção animal, Bem-estar animal e proteção ambiental e Investigação Científica em todas as áreas das Ciências Biológicas.",
        "typeOfCourse": "Mestrado Integrado",
        "duration": "11 Semestres / 330 ECTS"
    },
    {
        "id": 58,
        "url": "https://sigarra.up.pt/faup/pt/cur_geral.cur_view?pv_curso_id=27961",
        "name": "Mestrado em Inovação Digital para Práticas de Projeto ",
        "description": "O Mestrado Profissionalizante em Inovação Digital para Práticas de Projeto (MDI) é um programa único no contexto nacional que promove a formação especializada de mestrado num ano, sem necessidade de interromper a vida profissional.Neste ciclo de estudos, descobrirá como desenvolver atividades de projecto de forma inovadora, com impacto nos objetivos fundamentais de transição digital e sustentável do sector profissional da arquitetura (AEC) e do design.O programa está estruturado para garantir um equilíbrio entre competências teóricas e operativas para fazer a verdadeira diferença no presente e futuro da profissão.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "2 Semestres"
    },
    {
        "id": 59,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=1317",
        "name": "Mestrado em Arte e Design para o Espaço Público ",
        "description": "Destinado a estudantes com formação nas áreas das Artes Plásticas, Design, Paisagismo, Arquitetura, entre outras outros, o Mestrado em Arte e Design para o Espaço Público da FBAUP apresenta-se como um curso inovador porque atua precisamente no inter-cruzamento de várias experiências e formações, permitindo uma transversalidade de conhecimento e das suas práticas, singular no contexto português e mesmo internacional. O curso promove reflexão e prática profissional focadas na intervenção no espaço público, considerando as suas diversas vertentes - sociais, políticas, urbanas e mesmo virtuais.",
        "outings": "Análise e consultoria urbana, Direção artística, curadoria e/ou programação cultural no contexto da cidade e do espaço público, Desenvolvimento de atividades, autónomas ou em colaboração interdisciplinar, no âmbito das práticas artísticas espaciais e/ou relacionais em espaço público, Desenvolvimento de processos de participação/envolvimento público no âmbito das políticas urbanas e culturais, Atividades editoriais e de investigação em arte e design para o espaço público.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 60,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=12881",
        "name": "Mestrado em Artes Plásticas ",
        "description": "O Mestrado em Artes Plásticas da FBAUP dirige-se a estudantes de diversas origens, nacionalidades, culturas e formações que desejem desenvolver as suas competências e aprofundar os seus estudos nos domínios do Desenho, Escultura, Intermédia e Pintura, cruzando dinâmicas e ferramentas que sustentem desenvolvimentos teórico-práticos e projetos individuais.O programa de estudos estrutura-se num regime de trabalho em estúdio coordenado por docentes da FBAUP com a colaboração de professores, artistas e investigadores convidados.",
        "outings": "Atividade artística independente, Atividade de investigação em Artes Plásticas, Colaboração em equipas multidisciplinares empresariais e industriais, Participação em equipas multidisciplinares em instituições e organizações culturais, Dinamização e produção cultural de âmbito local, nacional ou internacional, Colaboração diversa com museus, galerias, teatros, e outros espaços culturais.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 62,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=1318",
        "name": "Mestrado em Design Gráfico e Projetos Editoriais ",
        "description": "O Mestrado em Design Gráfico e Projetos Editoriais da FBAUP habilita os estudantes a desenvolver as suas capacidades narrativas, um melhor pensamento estratégico em busca da resolução de problemas e soluções conceptuais, materiais e discursivas inovadoras, na área da edição e do design gráfico. Com uma estrutura curricular assente em quatro vertentes interdependentes (Design Editorial, Tipografia, Infografia e Ilustração), o curso distingue-se pela forte aproximação ao mundo empresarial, através da criação de laboratórios de I&D que proporcionam aos estudantes a oportunidade de ligar estudos académicos e prática profissional.",
        "outings": "Design gráfico, Design de comunicação, Direção de arte, Edição, Produção de conteúdos, Ilustração e visualização de dados.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 63,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=2021",
        "name": "Mestrado em Design Industrial e de Produto ",
        "description": "O Mestrado em Design Industrial e de Produto da FBAUP visa desenvolver conhecimentos e competências na área, designadamente no referente a setores transversais do tecido produtivo. Nesse sentido, procura-se que os estudantes adquirem competências para trabalhar de forma autónoma e para colaborar em equipas de trabalho multidisciplinares.",
        "outings": "Atividades em empresas industriais, Atividades em ateliers de design, Atividades em empresas de consultoria, Atividade por conta própria, Ensino, Investigação.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 64,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=1339",
        "name": "Mestrado em Estudos de Arte ",
        "description": "O Mestrado em Estudos de Arte (MEA) oferece um ambiente criativo e estimulante para estudantes oriundos de diversos campos académicos e profissionais que pretendam expandir de forma crítica e criativa o âmbito da sua atividade no mundo da arte, especializando-se em Teoria e Crítica da Arte ou Estudos Museológicos e Curadoriais. O MEA proporciona uma sólida base teórica e crítica para aqueles que pretendam desenvolver projetos de investigação e uma diversidade de competências necessárias à construção de uma carreira profissional independente como curador ou programador cultural, ou integrando a equipa de uma instituição.",
        "outings": "Atividade editorial na área das artes, mediação cultural, gestão de coleções, organização de exposições e outros eventos culturais, colaboração com museus, coleções e galerias de arte em áreas como curadoria, investigação, educação, produção, comunicação.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 65,
        "url": "https://sigarra.up.pt/fbaup/pt/cur_geral.cur_view?pv_curso_id=27781",
        "name": "Mestrado em Ilustração, Edição e Impressão ",
        "description": "",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 66,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=19141",
        "name": "Mestrado em Aplicações em Biotecnologia e Biologia Sintética ",
        "description": "O M:ABBS centra-se em promover a compreensão das várias dimensões relevantes em biotecnologia e biologia sintética e suas diversas áreas de aplicação científica e tecnológica, com vista a fazer face aos atuais desafios societais e a promover uma maior sustentabilidade. Assim, este ciclo de estudos confere conhecimento prático e teórico no âmbito da aplicação de conceitos fundamentais da química e da biologia para explicar e descrever processos fundamentais em biotecnologia e biologia sintética, visando integrar os conhecimentos adquiridos numa perspetiva global das aplicações da química e da biologia nos mais diversos quadrantes de intervenção da biotecnologia. Visa-se, também: conferir aptidões laboratoriais básicas em biotecnologia e biologia sintética, promover a comunicação e colaboração eficiente em equipa, preparar para a elaboração e apresentação de comunicações científico-tecnológicas adaptadas às especificidades de cada audiência, treinar as capacidades de organização de tarefas de acordo com um plano de trabalho e de recolha e análise crítica da informação científico-tecnológica, consciencializar para os aspetos éticos subjacentes ao trabalho em biotecnologia e biologia sintética e para a necessidade de atualização e formação ao longo da vida.",
        "outings": "Indústria alimentar (biotecnologia alimentar),Engenharia ambiental (biotecnologia ambiental),Recursos marinhos (biotecnologia azul),Engenharia agro-florestal (biotecnologia vegetal e de sementes),Indústria (bio)farmacêutica e engenharia biomédica (química medicinal, regulação génica, biologia sintética, biotecnologia de plantas medicinais, bionanotecnologia),Investigação científica e desenvolvimento nas áreas da biotecnologia e biologia sintética,Consultadoria, gestão industrial e empresarial.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 67,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=1027",
        "name": "Mestrado em Arquitetura Paisagista ",
        "description": "Destinado a licenciados em arquitetura paisagista ou em áreas afins, o Mestrado em Arquitetura Paisagista (MAP) da FCUP propõe uma abordagem vocacionada para a intervenção em espaço urbano e rural, em paisagens culturais e naturais, e em paisagens degradadas. O objetivo principal do curso é formar profissionais com competências em projeto de arquitetura paisagista, ordenamento do território, planeamento e gestão da paisagem.",
        "outings": "Projeto de arquitetura paisagista (Gabinetes privados, administração central e local, organizações não governamentais), Gestão de projeto, Recuperação de património natural e cultural, Ordenamento do território (Gabinetes privados, administração central e local, organizações não governamentais), Construção de espaços exteriores, Fiscalização de obras,Gestão e manutenção de espaços exteriores,Gestão da paisagem, Conservação da natureza, Comunicação e representação digital, Investigação científica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 68,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=871",
        "name": "Mestrado em Astronomia e Astrofísica ",
        "description": "O Mestrado em Astronomia e Astrofísica da FCUP visa complementar e aprofundar a formação de estudantes licenciados em Astronomia, Física, Matemática e áreas afins, melhorando a sua preparação tendo em vista o início de uma carreira de investigação em Astronomia e Astrofísica. Ao longo do curso são exploradas as mais avançadas técnicas e métodos utilizados na área, muitos deles transversais e relevantes também para uma carreira não académica. Este Mestrado abre igualmente portas para excelentes oportunidades alavancadas pela presença de Portugal no ESO e na ESA.",
        "outings": "Investigação, Comunicação e divulgação de ciência, Ensino, Trabalho científico e/ou técnico em institutos e/ou empresas.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 76,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=876",
        "name": "Mestrado em Ciência de Computadores ",
        "description": "O Mestrado em Ciência de Computadores visa a formação avançada e de qualidade de profissionais e investigadores em diferentes especialidades da área científica de Ciência de Computadores.Neste curso são aprofundadas competências profissionais em Ciência de Computadores / Informática através das componentes teórica, prática e de investigação, para seguir de imediato uma carreira numa empresa, ou para prosseguir investigação científica. Para tal, é privilegiado o contacto com as empresas e com vários centros de investigação de excelência (INESC TEC, IT-Instituto de Telecomunicações, LIACC e CMUP).",
        "outings": "Programação avançada, Análise de sistemas, Gestão de bases de dados, Data mining, Gestão de projetos informáticos, Administração de sistemas, Investigação",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 69,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=19701",
        "name": "Mestrado em Avaliação e Remediação de Solos ",
        "description": "O Mestrado em Avaliação e Remediação de Solos, oferecido pela Faculdade de Ciências, em parceria com a Faculdade de Engenharia, visa a formação de profissionais com conhecimentos e competências para efetuarem avaliações da qualidade dos solos, e ainda para proporem estratégias de remediação ajustadas ao tipo de degradação e ao uso futuro de cada área. O curso permite desenvolver competências transversais essenciais nos domínios da Geologia, Hidrologia, Modelação, Ecologia, Ecotoxicologia, Microbiologia, Avaliação de Risco, Remediação de Solos e Sistemas Geográficos de Informação.",
        "outings": "Gestão de agroecossistemas e de áreas florestais, Avaliação de risco de áreas contaminadas, Reabilitação de áreas contaminadas, Avaliação de Risco de Produtos Fitofarmacêuticos, Desenvolvimento e implementação de projetos de desenvolvimento rural e economia circular, Planeamento urbano, conservação da natureza e dos recursos naturais.Empresas, instituições públicas e outras organizações ambientais, Consultoria ambiental,Atividades de I&D nas áreas científicas de avaliação e remediação de solos, Elaborar e gerir projetos e criar novas ideias de negócio focadas na avaliação/remediação de solos (agrícolas, residenciais, industriais, florestal), incluindo a avaliação e a proteção das massas de água, dos ecossistemas e da saúde humana.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 70,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=872",
        "name": "Mestrado em Biodiversidade, Genética e Evolução ",
        "description": "O Mestrado em Biodiversidade, Genética e Evolução da FCUP visa a formação avançada de licenciados em Biologia, Ciências Agrárias e Veterinárias, ou licenciaturas afins, que pretendam adquirir uma pós-graduação no domínio da Biodiversidade e Biologia Evolutiva, ou que desejem aprofundar ou aplicar estes conhecimentos. O objetivo passa por proporcionar uma formação aprofundada na utilização de novos métodos analíticos e no uso de tecnologias recentes, nomeadamente no domínio dos sistemas de informação geográfica e da utilização de técnicas de genética molecular e populacional.",
        "outings": "Desempenho de funções em áreas ligadas à Biodiversidade, seja em empresas seja na administração pública, Investigador nas áreas da Biodiversidade",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 71,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=16821",
        "name": "Mestrado em Bioinformática e Biologia Computacional ",
        "description": "O Mestrado em Bioinformática e Biologia Computacional da FCUP visa a formação de profissionais com aptidões para a inovação e criação de conhecimento científico, nas suas vertentes fundamental e aplicada, na emergente área de interface entre a informática e a biologia. A estrutura curricular do curso está organizada de forma a que os estudantes adquiram conhecimentos e competências transversais à matemática, computação, bioquímica e biologia, estas duas numa perspetiva informática.",
        "outings": "Ómicas: Genómica, Transcriptomica, Epigenómica, Ciência de Dados, Desenho e descoberta de drogas/medicamentos, Biologia Evolutiva, Desenvolvimento de algoritmos e bases de dados biológicas, Metagenómica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 72,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=1015",
        "name": "Mestrado em Biologia Celular e Molecular ",
        "description": "O Mestrado em Biologia Celular e Molecular da FMUP promove a excelência da formação avançada em áreas emergentes e interdisciplinares de Biologia Celular e Molecular, através de trabalho de investigação/estágio. Assente numa formação sólida e no conhecimento atual em áreas modernas de Biologia Celular e Molecular, o curso prepara fortes candidatos a doutoramento, mas também sensibiliza os estudantes para as possíveis oportunidades profissionais que um mestrado interdisciplinar oferece fora do mundo académico.",
        "outings": "Biotecnologia, Saúde pública (hospitais, centros de diagnóstico e laboratórios de análise), Diagnóstico Molecular na saúde e na cadeia alimentar, Investigação em diversas áreas com enfâse na Biologia/Genética Molecular",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 73,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=874",
        "name": "Mestrado em Biologia e Gestão da Qualidade da Água ",
        "description": "O Mestrado em Biologia e Gestão da Qualidade da Água da FCUP visa a aquisição de competências para a resolução de problemas relacionados com os aspetos biológicos da água e dos seus usos. Ao longo do curso, dá-se especial importância à utilização da biologia na avaliação da qualidade da água, focando-se os aspetos ligados aos principais problemas de saúde pública relacionados com a água, bem como a legislação portuguesa e comunitária neste domínio, tendo em vista a utilização múltipla dos recursos hídricos (proteção ambiental, consumo humano, recreio, pescas, agricultura). .",
        "outings": "Laboratórios de análises de águas, serviços e empresas ligadas ao planeamento e gestão dos recursos hídricos, autarquias, serviços municipalizados, entidades ligadas à saúde e ao ambiente, empresas de tratamento de águas e de águas residuais e laboratórios de investigação.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 74,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=8761",
        "name": "Mestrado em Biologia Funcional e Biotecnologia de Plantas ",
        "description": "O Mestrado em Biologia Funcional e Biotecnologia de Plantas é um programa de formação avançada focado essencialmente na biologia molecular e celular das plantas, com uma forte componente de I&D+i em áreas que vão da agroalimentar à medicina, passando pelo ambiente e farmacêutica. Este curso privilegia a aquisição de competências em ferramentas moleculares que permitem o desenvolvimento de aplicações biotecnológicas inovadoras, bem como o contacto dos estudantes com o tecido empresarial nesse setor, estimulando o empreendedorismo de base tecnológica e a transferência de conhecimento para a sociedade.",
        "outings": "Investigação na área da Biologia de Plantas (Investigador ou técnico de laboratório)Técnico Superior laboratorial em empresas na área agrícola, farmacêutica, entre outrasQuadros superiores ou empreendedores na área da biotecnologia de Plantas",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 75,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=875",
        "name": "Mestrado em Bioquímica ",
        "description": "Resultado da colaboração entre a Faculdade de Ciências (FCUP) e o ICBAS, o Mestrado em Bioquímica destina-se, especialmente, a todos os detentores de uma Licenciatura em Bioquímica, ou em áreas afins, que pretendam enveredar por atividades de investigação fundamental ou aplicada ou por funções técnicas altamente diferenciada nos setores relacionados com a Bioquímica, em especial os das ciências da vida e da saúde e os da biotecnologia.",
        "outings": "Investigação e Desenvolvimento (I&D) em Bioquímica, Laboratórios de Análises Clínicas, Bioquímicas, Química Forense",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 122,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=20701",
        "name": "Mestrado em Economia da Empresa e da Estratégia ",
        "description": "O Mestrado em Economia da Empresa e da Estratégia da FEP combina diferentes perspetivas teóricas com instrumentos analíticos avançados, dotando os estudantes de fundamentos e ferramentas que lhes permitirão caraterizar claramente uma indústria e a sua evolução e repensar e liderar estrategicamente uma organização em ambientes desafiantes e em constante mudança.",
        "outings": "Definição de estratégias empresariaisLiderança estratégica empresarialEmpreendedorismoInovação",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 77,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=17263",
        "name": "Mestrado em Ciência de Dados (Data Science) ",
        "description": "Fortemente diferenciado face à oferta existente nesta área em Portugal, o Mestrado em Ciência de Dados da FCUP visa a preparação de profissionais altamente qualificados, em particular na análise de grandes volumes de dados. Para além dos sólidos conhecimentos nas áreas da análise estatística e da ciência de computadores, o curso transmite também conhecimento prático e aplicado em Ciência de Dados, através de aulas de laboratório, trabalhos práticos e projetos em colaboração com empresas que têm problemas reais que exigem métodos de Ciência de Dados.",
        "outings": "Data Scientist em Empresa ou Laboratório de Investigação, Especialista em Machine Learning,Analista de Dados, Especialista em Inteligência Artificial - vertente Data Science.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 78,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=22701",
        "name": "Mestrado em Ciência e Tecnologia de Nanomateriais ",
        "description": "O Mestrado em Ciência e Tecnologia de Nanomateriais da FCUP garante uma formação avançada e inovadora numa área atual e de grande impacto científico-tecnológico, posicionando-se na interface entre a química, a física e a ciência de dados, e preparando os seus estudantes para dar resposta aos desafios societais atuais nas áreas da energia, ambiente, saúde, alterações climáticas, materiais avançados e sustentabilidade. A possibilidade de realização de uma dissertação em laboratórios de investigação, ou um estágio em empresas e centros tecnológicos, facilitará a integração dos graduados no mundo científico, industrial ou empresarial.",
        "outings": "Empresas e centros tecnológicos ligados aos Nanomateriais e Nanotecnologia: Atividades profissionais nas áreas da energia, saúde e nanomedicina, ambiente, nanotecnologia, e nanomateriais avançados (técnicos, funcionais e inteligentes) aplicados à indústria têxtil, proteção e bem-estar, construção e arquitetura, setor automóvel e aeronáutica, sensores e biosensores, catálise e indústria agroalimentar, entre outras, Empreendedorismo.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 79,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=877",
        "name": "Mestrado em Ciências do Consumo e Nutrição ",
        "description": "Resultado da colaboração entre a FCUP e a FCNAUP, o Mestrado em Ciências do Consumo e Nutrição destina-se a licenciados em Ciências Exatas, Ciências da Saúde, Ciências da Vida ou Tecnologia com interesse e responsabilidade na área do consumo alimentar e nutrição. O objetivo passa por preparar profissionais para serem competentes, versáteis e capazes, tanto de analisar problemas ambientais correntes como de tomar decisões criteriosas e encontrar soluções ecológicas economicamente aceitáveis.",
        "outings": "Retalho moderno (grande distribuição), Indústria alimentar, Produção animal e vegetal, Organismos da Administração Pública envolvidos nas questões do consumo alimentar (ASAE, DGConsumidor, etc.), ONG's envolvidas nas questões do consumo alimentar (DECO, Centros de dia, etc.), Media especializados, Investigação e docência.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 80,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=866",
        "name": "Mestrado em Ciências e Tecnologia do Ambiente ",
        "description": "O Mestrado em Ciências e Tecnologia do Ambiente da FCUP visa a preparação de profissionais competentes, versáteis e capazes, tanto de analisar problemas ambientais correntes como de tomar decisões criteriosas e encontrar soluções ecológicas economicamente aceitáveis. Os seus domínios de intervenação incluem: Sistemas de gestão de efluentes e resíduos, educação ambiental, ecoeficiência, implementação de sistemas de gestão de qualidade ambiental, higiene e segurança ambiental e ocupacional, gestão de impacte ambiental, proteção e prevenção ambiental, gestão e exploração de recursos naturais, gestão e conservação da natureza, avaliação e controlo de qualidade, previsão, profilaxia e remediação de acidentes naturais, caracterização e intervenção em áreas de desertificação ativa, recuperação de zonas submetidas a exploração a céu aberto.",
        "outings": "Ccargos técnicos de nível médio ou superior tanto no setor público como no privado e em regime de autoemprego, Empresas de consultadoria ambiental e de serviços, Autoridades locais, Agencias governamentais, Laboratórios do Estado, Indústria, Ensino",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 81,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=16781",
        "name": "Mestrado em Deteção Remota ",
        "description": "O Mestrado em Deteção Remota (DR) é o único curso em Portugal que oferece formação avançada sobre técnicas de observação da Terra, tratamento e uso de dados geoespaciais adquiridos a partir de sensores colocados em plataformas espaciais ou aéreas. Para além dos fundamentos da DR, técnicas de aquisição, processamento e análise de dados, o curso ministra um vasto leque de opções visando a aquisição de competências específicas em aplicações ao estudo do oceano, agricultura e florestas, zonas costeiras, alterações climáticas, entre outras",
        "outings": "Instituições públicas ou empresas privadas de cariz tecnológico, incluindo agências espaciais (ESA. EUMETSAT, etc.), para atividades ligadas à produção ou exploração de dados de DR ou SIG, serviços de localização, cartografia temática, entre outras que envolvam utilização de informação georreferenciada, Criação de empresas de base tecnológica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 82,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=10821",
        "name": "Mestrado em Ecologia e Ambiente ",
        "description": "O Mestrado em Ecologia e Ambiente da FCUP destina-se a licenciados com formação nas áreas de Biologia, Geologia, Ciências do Ambiente, Arquitetura Paisagística, Agronomia ou outras áreas afins. Ao longo do curso, os estudantes adquirem as competências e conhecimentos necessários à compreensão integrante dos aspetos biológicos inerentes aos domínios aplicados de Ecologia e Biodiversidade, Ecologia da Paisagem e Ordenamento do Território, Educação Ambiental e Turismo da Natureza, Tecnologia Aplicada à Gestão Ambiental e da Caracterização, Monitorização e Recuperação Ambientais, à luz das melhores práticas atuais.",
        "outings": "Empresas e instituições públicas do sector do ambiente, nas áreas do ordenamento e planeamento do território, avaliação de impacto ambiental, gestão de recursos naturais, conservação da natureza e desenvolvimento sustentável.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 83,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=923",
        "name": "Mestrado em Engenharia Agronómica ",
        "description": "O Mestrado em Engenharia Agronómica confere formação e capacitação de graduados com sólida formação científica e técnica para planear, conceber e gerir atividades agrícolas e agroindustriais, assegurando a obtenção de bens e serviços de forma sustentada, diversificada e segura para o Homem e o ambiente.",
        "outings": "Gestão técnica de explorações agrícolas, agrocomerciais e agroindustriais, Técnicos dos Serviços da Administração Central, Regional ou Local, Empresas de prestação de serviços e consultadoria técnica aos sectores agrocomercial, agroambiental e agroprodutivo, Elaboração, implementação e avaliação de projetos da área agronómica, Instituições e empresas de controlo e fiscalização da qualidade e segurança alimentar, Empresas de manutenção e gestão de espaços verdes, Carreira de investigação científica e tecnológica, Instituições de ensino e formação profissional.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 84,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=23181",
        "name": "Mestrado em Engenharia de Redes e Sistemas Informáticos ",
        "description": "O Mestrado em Engenharia de Redes e Sistemas Informáticos da FCUP visa a formação avançada de profissionais particularmente qualificados para a análise, o planeamento, a instalação e a administração de sistemas complexos e distribuídos de armazenamento, processamento e comunicação de dados, habilitados para desempenhar funções de grande responsabilidade e liderança em contextos complexos, multidisciplinares e com foco na inovação, ou para prosseguir para doutoramento.",
        "outings": "Planeamento, implementação e administração de redes e sistemas informáticos, Conceção e desenvolvimento de sistemas e aplicações, Gestão de projectos informáticos e de rede, Consultadoria e auditoria em informática e redes de comunicação, Investigação e desenvolvimento tecnológico.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 85,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=13521",
        "name": "Mestrado em Engenharia de Viticultura e Enologia ",
        "description": "O Mestrado em Engenharia de Viticultura e Enologia, criado em colaboração com o Instituto Superior de Agronomia - Universidade de Lisboa e o INIAV, garante uma formação avançada de excelência na área da Vinha e do Vinho. O curso visa dotar os diplomados com competências que lhes permitam ocupar posições de liderança no setor vitivinícola nacional e transnacional. Para tal, aposta numa forte ligação às empresas, quer através de um estágio de vindima (unidade curricular obrigatória) numa empresa vitivinícola onde o estudante contacta com a realidade prática da empresa, queratravés de visitas de estudo e da realização de trabalhos de investigação nas vinhas e adegas das empresas parceiras",
        "outings": "Setor privado: Criação de empresas tendo a vinha e o vinho como objetivo da produção, Técnico superior na área da vinha e da enologia, Consultadoria especializada na área vitivinícola, Administração pública: Cargos em organismos públicos responsáveis pelo planeamento, gestão e promoção dos produtos vitivinícolas a nível local, nacional e internacional, Investigação e ensino: Participação e liderança de equipas de investigação multidisciplinares nas áreas da viticultura e da enologia, em organismos de investigação públicos ou privados.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 86,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=23161",
        "name": "Mestrado em Engenharia Física ",
        "description": "O Mestrado em Física da FCUP tem como objetivo proporcionar conhecimentos avançados e atuais de Física clássica e moderna, que sustentem a construção de modelos explicativos e a compreensão de uma vasta gama de fenómenos. Combinando competências em Matemática e métodos computacionais (ferramentas fundamentais de formulação e de análise quantitativa de problemas e modelos) com uma formação em experimentação, análise de dados, instrumentação variada, técnicas de medida e projeto e conceção de experiências. o curso habilita os estudantes para o exercício de cargos técnicos de nível superior e de investigação e desenvolvimento, em organizações governamentais, no setor privado ou em regime de autoemprego.",
        "outings": "Cargos técnicos de nível superior e de investigação e desenvolvimento, Laboratórios de Estado, universidades, institutos de investigação, escolas, controlo de qualidade, hospitais, Setor de serviços financeiros, bancos e seguradoras, consultoras, indústria, empresas de tecnologias de informação, Prosseguimento de estudos de doutoramento em Física, Engenharia Física, outras áreas de Engenharia, ou em áreas de formação pluridisciplinar (Biofísica, Ambiente, Gestão de Recursos, etc).",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 87,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=869",
        "name": "Mestrado em Engenharia Geoespacial ",
        "description": "O Mestrado em Engenharia Geográfica da FCUP oferece uma formação académica e prática adequada à compreensão dos problemas ligados à aquisição e tratamento de informação geográfica nos seus diversos aspetos: produção de cartografia topográfica, condução e supervisão de trabalhos de posicionamento geodésico, tratamento de imagens de satélite e fotografia aérea, implementação e gestão de um sistema de informação geográfica. A formação visa dar um conhecimento profundo das diferentes disciplinas da Engenharia Geográfica e um espírito crítico que permitam formar Engenheiros com capacidades para, mais do que serem simples operadores, poderem decidir e conduzir, de forma autónoma, trabalhos nesta área.",
        "outings": "Construção civil e obras públicas, Planeamento e ordenamento do território, Defesa nacional, Proteção civil, Administração pública e empresas do Estado, Empresas tecnológicas nos setores da informação georreferenciada e de infraestruturas, espaço, gestão de território e ambiente, comunicações, transportes e logística, Consultoria, Investigação científica e desenvolvimento.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 88,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=892",
        "name": "Mestrado em Engenharia Matemática ",
        "description": "O Mestrado em Engenharia Matemática da FCUP destina-se a licenciados de diferentes perfis, mas com formação matemática consolidada, que pretendam melhorar a sua comunicação em ciência e ser bem sucedidos no mercado de trabalho, onde demonstrem autonomia e habilidade na aquisição de conhecimentos. Assente numa sólida base científica, a par do desenvolvimento de competências em modelação e previsão, estatística, e uso de aplicações computacionais, o curso visa a formação de profissionais aptos a modelar e resolver problemas em diversos contextos, em particular no âmbito de uma carreira de investigação, com a abrangência e flexibilidade que só uma boa formação matemática permite.",
        "outings": "Serviços (Banca, Finanças, Seguros), Consultadoria, Indústria, Transportes e Comunicações, Serviços Públicos e Empresas de Serviços, Saúde, Investigação científica",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 89,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=1023",
        "name": "Mestrado em Ensino de Biologia e de Geologia no 3.º Ciclo do Ensino Básico e no Ensino Secundário ",
        "description": "O Mestrado em Ensino de Biologia e de Geologia no 3.º Ciclo do Ensino Básico e no Ensino Secundário da FCUP visa a aquisição de competências científicas e pedagógicas necessárias ao exercício da função docente no domínio das Ciências Naturais no 3.º Ciclo do Ensino Básico e da Biologia e Geologia no Ensino Secundário. O curso assegura uma formação organizada por elementos de natureza geral e específica centrados no desenvolvimento dos conhecimentos e competências próprios de uma formação profissional de qualidade, capaz de responder aos novos desafios da educação.",
        "outings": "Docência de Ciências Naturais no 3.º Ciclo do Ensino Básico e de Biologia e Geologia no Ensino Secundário, em estabelecimentos públicos e privados, Atividade editorial, incluindo multimédia educativo, Gabinetes/área educativa de museus, centros de ciência, câmaras municipais e outras instituições, Investigação em educação científica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 90,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=1022",
        "name": "Mestrado em Ensino de Física e de Química no 3.º Ciclo do Ensino Básico e no Ensino Secundário ",
        "description": "O Mestrado em Ensino de Física e de Química no 3.º Ciclo do Ensino Básico e no Ensino Secundário da FCUP visa a aquisição de competências científicas e pedagógicas necessárias ao exercício da função docente no Ensino da Física e da Química no 3.º Ciclo do Ensino Básico e no Ensino Secundário. O curso assegura uma formação organizada por elementos de natureza geral e específica centrados no desenvolvimento dos conhecimentos e competências próprios de uma formação profissional de qualidade, capaz de responder aos novos desafios da educação.",
        "outings": "Docência de Física e da Química no 3.º Ciclo do Ensino Básico e no Ensino Secundário, em estabelecimentos públicos e privados, Atividade editorial, incluindo multimédia educativo, Gabinetes/área educativa de museus, centros de ciência, câmaras municipais e outras instituições, Investigação em educação científica,",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 91,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=926",
        "name": "Mestrado em Ensino de Matemática no 3.º Ciclo do Ensino Básico e no Secundário ",
        "description": "O Mestrado em Ensino da Matemática é um ciclo de estudos profissionalizante que confere habilitação profissional para a docência das disciplinas de Matemática no 3.º ciclo do Ensino Básico e no Ensino Secundário. O curso visa a aquisição de competências científicas e pedagógicas necessárias ao exercício, com qualidade, da função docente, nos ciclos de ensino referidos, articulando o processo de ensino-aprendizagem com as atuais exigências de qualificação do corpo docente decorrentes das transformações da sociedade, da investigação em educação matemática e da evolução científica e tecnológica.",
        "outings": "Docência das disciplinas de Matemática no 3.º ciclo do Ensino Básico e no Ensino Secundário, em estabelecimentos públicos e privados, Atividade editorial, incluindo multimédia, Gabinetes/área educativa de museus, centros de ciência, câmaras municipais e outras instituições, Investigação em Educação Matemática.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 92,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=19681",
        "name": "Mestrado em Ensino e Divulgação das Ciências ",
        "description": "O Mestrado em Ensino e Divulgação das Ciências da FCUP oferece um complemento de formação em temas centrais e atuais da ciência. O curso visa o fortalecimento da educação em Ciências, numa perspetiva de aprendizagem ao longo da vida, mas também o desenvolvimento de capacidades que permitirão ao estudante refletir analítica e criticamente sobre a divulgação da Ciência a públicos muito variados e por meios diversos, numa perspetiva de promoção da cultura científica.",
        "outings": "Ensino das Ciências em meio escolar (Ensino Básico e Secundário) e/ou Académico (Ensino Superior), Divulgação das Ciências em contextos como Museus e Centros de Ciência, Universidades, Gabinetes de Comunicação de Unidades de I&D",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 93,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=23821",
        "name": "Mestrado em Estatística Computacional e Análise de Dados ",
        "description": "Informação a disponibilizar brevemente",
        "outings": "Providenciando a aquisição e desenvolvimento de competências num domínio reconhecido como fundamental e atrativo no panorama técnico-científico da sociedade atual, o mestrado potencia o emprego em todas as áreas onde haja necessidade de tratamento de dados.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 94,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=893",
        "name": "Mestrado em Física ",
        "description": "O Mestrado em Física da FCUP oferece uma formação avançada em Física, nas suas componentes clássica e moderna, sustentando a construção de modelos explicativos e a compreensão de uma vasta gama de fenómenos, através da aquisição de competências em Matemática e Métodos computacionais. Durante o curso, os estudantes podem optar por um perfil experimental (com formação em experimentação e análise de dados, instrumentação variada e técnicas de medida) ou por um perfil teórico (com formação complementar em Física teórica clássica e quântica).",
        "outings": "Cargos técnicos de nível superior e de investigação e desenvolvimento, Laboratórios de Estado, universidades, institutos de investigação, escolas, controlo de qualidade, hospitais, Setor de serviços financeiros, bancos e seguradoras, consultoras, indústria, empresas de tecnologias de informação, Prosseguimento de estudos de doutoramento em Física, Engenharia Física, outras áreas de Engenharia, ou em áreas de formação pluridisciplinar (Biofísica, Ambiente, Gestão de Recursos, etc).",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 95,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=894",
        "name": "Mestrado em Física Médica ",
        "description": "O curso de Mestrado em Física Médica da FCUP proporciona formação avançada no campo da Física Médica, tendo por modelo as recomendações da European Federation of Organisations for Medical Physics.",
        "outings": "Física Médica",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 96,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=895",
        "name": "Mestrado em Genética Forense       Não estão abertas candidaturas.  ",
        "description": "O Mestrado em Genética Forense da FCUP oferece formação avançada em termos de conhecimentos científicos e aptidões laboratoriais e informáticas, a todos aqueles que pretendam obter um melhor entendimento do potencial e limites das análises periciais do âmbito da Genética Forense. O curso habilita os diplomados para a investigação e o exercício profissional nesta e noutras áreas que recorrem às crescentes aplicações da genética nos domínios da saúde, do controlo da autenticidade e segurança alimentares, da proteção e conservação da vida selvagem.",
        "outings": "Funções periciais em Genética Forense em institutos de Ciências Forenses, Polícia Científica, etc., Funções técnicas especializadas em laboratórios das áreas da saúde, do controlo da autenticidade e segurança alimentares, da proteção e conservação da vida selvagem,Investigação em Genética Populacional e sua aplicação forense.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 97,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=1019",
        "name": "Mestrado em Geologia ",
        "description": "Assente na combinação de conhecimentos multidisciplinares dos domínios fundamentais e aplicados da Geologia, o Mestrado em Geologia da FCUP visa a preparação de profissionais para atuação em qualquer parte do mundo, em projetos de investigação, ou em empresas. Para tal, o plano curricular do curso assegura a formação de profissionais (geólogos e investigadores), para atuação em áreas técnicas e científicas inovadoras, desde a (petro)génese à caraterização e prospeção geológica, assim como à gestão ambiental global, harmoniosa e sustentável das matérias-primas.",
        "outings": "Prospeção e avaliação de recursos minerais metálicos, Prospeção e avaliação de recursos minerais não metálicos, Geotecnia, Hidrogeologia.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 98,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=896",
        "name": "Mestrado em Geomateriais e Recursos Geológicos ",
        "description": "Oferecido pela FCUP, em parceria com a Universidade de Aveiro, o Mestrado em Geomateriais e Recursos Geológicos (MGRG) prepara os estudantes, nomeadamente licenciados em Ciências da Terra e áreas afins, para o exercício profissional em áreas relacionadas com o estudo dos recursos geológicos, a prospeção de recursos minerais, hídricos energéticos ou de rochas industriais, sua avaliação, suas aplicações industriais e controlo dos impactos ambientais causados por essa exploração.",
        "outings": "Empresas de prospeção de recursos minerais, hídricos e energéticos, Indústria extrativa de agregados e de transformação de rochas e minerais, Empresas mineiras, Empresas e consórcios de construção, Laboratórios e empresas de estudos técnicos e de consultoria, Ordenamento do território, Prevenção e previsão de catástrofes naturais, Gestão e conservação do ambiente, Desenvolvimento sustentável.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 99,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=878",
        "name": "Mestrado em Matemática ",
        "description": "O Mestrado em Matemática da FCUP visa a formação avançada em Matemática e a iniciação à investigação científica, permitindo ao estudante prosseguir os seus estudos e investigação numa área em que faça forte uso da Matemática, quer numa instituição nacional quer internacional, assim como explorar essa formação em atividades profissionais que requerem a utilização da Matemática.",
        "outings": "Lecionação e Investigação em Matemática ou área afim numa instituição de Ensino Superior após um doutoramento, Instituições estatais ou privadas que valorizem a capacidade para resolver problemas novos e complexo nos domínios da Engenharia, Medicina, Economia ou Finanças, Bancos, Corretores de Bolsa, Companhias Seguradoras, Instituições especializadas em fenómenos ambientais, populacionais ou meteorológicos, onde poderá atualizar os conhecimentos matemáticos ou fará investigação necessária para tirar partido das novas tecnologias e teoremas para resolver problemas colocados pela instituição, usando Modelos Matemáticos e Estatísticos Computacionais.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 100,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=17201",
        "name": "Mestrado em Métodos Avançados e Acreditação em Análise Química ",
        "description": "O Mestrado em Métodos Avançados e Acreditação em Análise Química (MA3Q) da FCUP prepara os estudantes para assumirem a liderança de laboratórios de ensaios químicos ou de laboratórios de investigação (de empresas ou do sistema público). Trata-se de um ciclo de estudos com uma sólida formação teórica, complementada por uma forte componente de atividades práticas laboratoriais nas áreas da Análise Química, da Instrumentação, das Ferramentas Quimiométricas, da Gestão da Qualidade do trabalho laboratorial e, também, na Acreditação de Laboratórios.",
        "outings": "Técnicas analíticas avançadas, Instrumentação analítica avançada, Quimiometria, Controlo de qualidade, Desenvolvimento e validação de métodos analíticos, Gestão da Qualidade em laboratórios de análise, Acreditação dos laboratórios de análise.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 101,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=958",
        "name": "Mestrado em Química ",
        "description": "O Mestrado em Química da FCUP é um mestrado de âmbito generalista, que visa uma formação científica avançada, moderna e versátil no campo da Química. Num contexto em que a Química ocupa uma posição central na resposta aos desafios societais atuais, em particular nos domínios da energia, saúde, ambiente, preservação dos recursos naturais e desenvolvimento de novos materiais funcionais, o curso procura responder a estes desafios na ótica da formação pedagógico-científica dos estudantes e da sua preparação para um percurso profissional de sucesso.",
        "outings": "Indústria, Laboratórios/institutos públicos, Investigação científica em contexto académico,I&D em contexto empresarial, centros tecnológicos e de interface.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 102,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=959",
        "name": "Mestrado em Recursos Biológicos Aquáticos ",
        "description": "O Mestrado em Recursos Biológicos Aquáticos da FCUP visa a formação de técnicos especializados, tendo em vista a adequada gestão, exploração e preservação do ecossistema aquático. Alicerçado em tópicos como a Aquacultura, a Biologia Aquática, a Biodiversidade de Organismos Aquáticos, a Ecologia Aquática, o curso está especialmente desenhado para biólogos e licenciados em áreas afins, que pretendam melhorar os seus conhecimentos e aptidões em vários aspetos relacionados com o ecossistema aquático, de modo a garantir a sua preservação e uma exploração sustentada dos recursos.",
        "outings": "Técnicos Superiores do Sector Público e Privado,Investigação científica, Consultoria, Docência.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 103,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=6041",
        "name": "Mestrado em Segurança Informática ",
        "description": "O Mestrado em Segurança Informática (MSI) da FCUP visa a formação avançada e de qualidade de profissionais e investigadores na área da cibersegurança. O curso procura conferir a formação de base e os conhecimentos técnicos de segurança informática aos licenciados que pretendam seguir uma carreira profissional de sucesso nesta área.",
        "outings": "Auditoria de segurança e pen testing, Segurança na engenharia de software, Segurança de sistemas e dados, Segurança de redes e infraestruturas,Gestão da segurança da informação, Operações de segurança, Docência, Investigação científica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 104,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=5881",
        "name": "Mestrado em Tecnologia e Ciência Alimentar ",
        "description": "Resultado da colaboração entre a FCUP e a Escola de Engenharia da Universidade do Minho, o Mestrado em Tecnologia e Ciência Alimentar assegura uma formação orientada à solução de problemas ligados às Indústrias Agroalimentares e à alimentação. A formação ministrada aos estudantes dá-lhes competências em distintas áreas desde o processamento e a qualidade dos alimentos, ao desenvolvimento de novos produtos, tendo em consideração os aspetos nutricionais e sensoriais, assim como a certificação do sistema de gestão da segurança alimentar.",
        "outings": "Indústrias alimentares, Investigação científica, Laboratórios de análises de produtos alimentares e outros, Empresas de consultoria, Empresas de distribuição alimentar, Empresas de comercialização de material científico e tecnológico.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 105,
        "url": "https://sigarra.up.pt/fcup/pt/cur_geral.cur_view?pv_curso_id=15261",
        "name": "Mestrado em Vinho, Turismo e Inovação - Enoturismo ",
        "description": "Resultado da colaboração pioneira entre a U.Porto (através da FCUP) a Universidade de Rovira i Virgili (Tarragona, Espanha) e a Universidade de Bordéus (França), o Mestrado Erasmus Mundus em Vinho, Turismo e Inovação (WINTOUR) oferece um programa integrado de estudo que aproveita o know-how em Turismo e Enologia das três instituiçoes parceiras, todas elas localizadas em áreas turísticas altamente atraentes e com uma longa tradição na produção de vinhos de qualidade. Mais concretamente, o curso visa preparar profissionais altamente adaptáveis e qualificados nas áreas da gestão do turismo e produção de vinho, e capazes de promover e gerir projecos ecoturísticos inovadores,",
        "outings": "Gestão de empresas de produção de vinho, Gestão de projetos ecoturísticos, Empreendedorismo",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 106,
        "url": "https://sigarra.up.pt/fcnaup/pt/cur_geral.cur_view?pv_curso_id=832",
        "name": "Mestrado em Alimentação Coletiva ",
        "description": "Destinado a a profissionais e diplomados nos domínios das Ciências da Nutrição, Ciências da Vida e Ciências Tecnológicas, o Mestrado em Alimentação Coletiva da FCNAUP tem como objetivo especializar e capacitar técnicos nas áreas da gestão, segurança e qualidade alimentar em serviços de alimentação. Ao longo do curso, são trabalhadas competências que permitem intervir na otimização de processos de produção de refeições, no controlo de qualidade e na criação de novas alternativas nutricionalmente desejáveis e seguras com uma boa relação custo/benefício.",
        "outings": "Os Mestres em Alimentação Coletiva estarão habilitados para desempenhar um papel diferenciador na abordagem da segurança e qualidade alimentar em serviços de alimentação, assim como na definição e implementação de uma oferta alimentar assente nos princípios básicos da saúde e sustentabilidade. As saídas profissionais incluem ainda a Investigação e Ensino e a Indústria Agroalimentar e Inovação.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 107,
        "url": "https://sigarra.up.pt/fcnaup/pt/cur_geral.cur_view?pv_curso_id=18681",
        "name": "Mestrado em Ciências Gastronómicas ",
        "description": "Resultado da colaboração entre a FCNAUP e a Escola Superior de Hotelaria e Turismo do Politécnico do Porto, o inovador Mestrado em Ciências Gastronómicas combina os domínios científicos das áreas das Ciências da Nutrição e Alimentação com os conceitos práticos das áreas da Restauração e da Gastronomia, para oferecer uma \"receita\" formativa assente na articulação entre os saberes científicos e a sua aplicação prática no mundo real. Ao longo do curso, são trabalhadas competências científicas em diferentes áreas, desde a nutrição às técnicas culinárias, a cultura, a sustentabilidade, a inovação, o marketing e o empreendedorismo.",
        "outings": "Restauração coletiva / Investigação e Ensino /Inovação e Indústria Agroalimentar",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 108,
        "url": "https://sigarra.up.pt/fcnaup/pt/cur_geral.cur_view?pv_curso_id=25661",
        "name": "Mestrado em Educação Alimentar ",
        "description": "O Mestrado em Educação Alimentar da FCNAUP destina-se a profissionais interessados em desenvolver competências específicas e transversais para atuar no âmbito da Educação Alimentar, nomeadamente no planeamento, implementação e avaliação de programas e projetos educativos e curriculares de educação nas áreas da nutrição e alimentação. O mestrando em Educação Alimentar terá ainda a possiblidade de adquirir competências científicas e técnicas que o capacitem para fazer investigação-ação neste domínio, preparando-o para uma atuação comunitária dinâmica interventiva e de base científica.",
        "outings": "Investigação/ação no domínio da Educação Alimentar.Este Mestrado possui acreditação CCPFC: Área de formação especializada Organização e Desenvolvimento Curricular, Especialização em Educação para a Saúde. O número de horas acreditadas para a progressão na carreira de professores do Ensino Básico e Secundário é de 300.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 109,
        "url": "https://sigarra.up.pt/fcnaup/pt/cur_geral.cur_view?pv_curso_id=834",
        "name": "Mestrado em Nutrição Clínica ",
        "description": "O Mestrado em Nutrição Clínica da FCNAUP destina-se a profissionais das áreas de Ciências da Saúde, que pretendam aprofundar conhecimentos teóricos e realizar investigação na área da nutrição clínica. O curso apresenta uma forte componente clínica, suportada em conceitos teóricos aprofundados, que permitem compreender e ter capacidade de resolução de novas situações, em contextos amplos e multidisciplinares, bem como a capacidade de comunicar as suas conclusões a especialistas e à comunidade em geral, de acordo com as suas responsabilidades éticas, deontológicas e sociais.",
        "outings": "Nutrição clínica / Investigação / Ensino na área da nutrição clínica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 110,
        "url": "https://sigarra.up.pt/fcnaup/pt/cur_geral.cur_view?pv_curso_id=21621",
        "name": "Mestrado em Nutrição Comunitária e Saúde Pública ",
        "description": "Fruto da colaboraçao entre três faculdades da U.Porto ( FCNAUP, FMUP e ICBAS), o Mestrado em Nutrição Comunitária e Saúde Pública oferece uma abordagem multidisciplinar e multicultural, pensada em termos de intervenção a nível de saúde, educação e mercado. O curso preparando profissionais, capazes de garantir empregabilidade no setor público e privado, que atuem a nível da alimentação e nutrição com base na evidência científica e com uma visão alargada à Saúde Pública.",
        "outings": "Monitorização e vigilância da população e dos grupos populacionais na área da saúde relacionada com a nutrição e alimentação, Desenvolvimento de políticas alimentares e nutricionais, Planeamento, implementação, comunicação, gestão, monitorização e avaliação de programas de intervenção comunitária em saúde, nomeadamente na área da alimentação e nutrição, Intervenção comunitária no âmbito da alimentação e nutrição, Segurança e qualidade alimentar.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 111,
        "url": "https://sigarra.up.pt/fcnaup/pt/cur_geral.cur_view?pv_curso_id=23101",
        "name": "Mestrado em Nutrição Pediátrica ",
        "description": "O Mestrado em Nutrição Pediátrica da FCNAUP tem como principal objetivo aprofundar e desenvolver competências avançadas e especializadas na área da Nutrição Pediátrica. Pretende-se dotar os estudantes de conhecimentos transversais a diferentes áreas de atuação profissional, facilitando a capacidade, o entendimento e o desempenho profissional para intervenção em áreas gerais e específicas da Nutrição Pediátrica, numa perspetiva preventiva e terapêutica, tanto a nível clínico como de investigação.",
        "outings": "A aquisição e desenvolvimento de competências no curso visa proporcionar melhor capacitação de atividades profissionais na idade pediátrica, em áreas como Nutrição Clínica, Nutrição Comunitária e Saúde Pública, Investigação e Ensino.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 112,
        "url": "https://sigarra.up.pt/fadeup/pt/cur_geral.cur_view?pv_curso_id=23201",
        "name": "Mestrado em Atividade Física, Exercício e Saúde ",
        "description": "O Mestrado em Atividade Física, Exercício e Saúde (2CAFES) tem como orientação a produção de conhecimento científico para a compreensão da influência da atividade física na capacidade funcional humana e das repercussões do exercício na saúde humana e nos diversos mecanismos associados ao desenvolvimento e/ou à prevenção de doenças crónicas em diferentes dimensões de análise (biológica, psicológica e social). O plano de estudos do curso contempla quatro ramos de especialidade: Atividades de Academia e na Natureza, Atividade Física Adaptada, Atividade Física para a Terceira Idade, ou Exercício em Contextos Clínicos.",
        "outings": "Ginásios, Clubes de Saúde, Unidades de Cuidados de Saúde Primários (USF, UCSP), Hospitais, Clínicas médicas, Centros de apoio à terceira idade, Organizações da Sociedade Civil, Instituições Privadas de Solidariedade Social (IPSS), Associações Desportivas, Empresas ou outras.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 123,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1038",
        "name": "Mestrado em Economia e Administração de Empresas ",
        "description": "O curso de Mestrado em Economia e Administração de Empresas da FEP oferece uma formação em banda larga em gestão, contemplando as suas várias áreas funcionais (contabilidade, finanças, marketing, recursos humanos, e operações e logística) e uma visão integrada e estratégica dos processos de gestão. Adicionalmente, o curso oferece formação complementar em economia, a nível micro e macro, de modo a informar e sustentar a tomada de decisão em gestão.",
        "outings": "Contabilidade, Finanças, Marketing, Recursos humanos, Operações e Logística, Micro e maceroeconomia",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 113,
        "url": "https://sigarra.up.pt/fadeup/pt/cur_geral.cur_view?pv_curso_id=853",
        "name": "Mestrado em Ensino de Educação Física nos Ensinos Básico e Secundário ",
        "description": "O Mestrado em Estudos em Ensino de Educação Física nos Ensinos Básico e Secundário da FADEUP confere habilitação profissional para a docência da Educação Física nos Ensinos Básico e Secundário. Este curso, promove a aquisição de competências científicas e pedagógicas necessárias ao exercício da docência da Educação Física, assegurando uma formação comprometida com as atuais exigências de qualificação de professores, decorrentes das transformações da sociedade, da evolução científica e tecnológica sendo capaz de responder aos novos desafios da educação.",
        "outings": "Professor de educação física nos ensinos básico e secundário.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 114,
        "url": "https://sigarra.up.pt/fadeup/pt/cur_geral.cur_view?pv_curso_id=851",
        "name": "Mestrado em Gestão Desportiva ",
        "description": "O Mestrado em Gestão Desportiva da FADEUP tem como objetivo transmitir conhecimentos e criar competências nos estudantes de forma a habilitá-los como gestores com capacidade de intervenção dentro do sistema desportivo nacional e internacional nas múltiplas organizações desportivas ou criando os seus próprios projetos e negócios.",
        "outings": "Comités Olímpicos e Paralímpicos, Confederações, Federações Desportivas, Clubes Desportivos e demais Organizações do Movimento Associativo, Universidades, Organizações não Governamentais (ONG), Entidades da Administração Pública Central, Regional ou Local, Empresas Públicas, Ginásios / Health Clubs, Empresas de Serviços Desportivos (de eventos, de lazer e turismo desportivo, de desportos de aventura e atividades radicais, entre outras), Empresas de produtos desportivos, Empresas de assessoria na área do desporto, Entidades da Comunicação Social.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 115,
        "url": "https://sigarra.up.pt/fadeup/pt/cur_geral.cur_view?pv_curso_id=16401",
        "name": "Mestrado em Psicologia do Desporto e Desenvolvimento Humano ",
        "description": "O Mestrado em Psicologia do Desporto e Desenvolvimento Humano visa dotar os estudantes de conhecimentos aprofundados no domínio da psicologia do desporto e desenvolvimento humano, com recurso à atividade de investigação e/ ou ao aprofundamento de competências de intervenção.",
        "outings": "Clubes desportivos, Federações e associações desportivas, Sociedades anónimas desportivas, Academias de formação de jogadores, Academias, health clubs e ginásios, Autarquias, Empresas municipais de serviços desportivos, Associações culturais e recreativas, Lares de idosos",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 116,
        "url": "https://sigarra.up.pt/fadeup/pt/cur_geral.cur_view?pv_curso_id=16121",
        "name": "Mestrado em Treino Desportivo ",
        "description": "O Mestrado em Treino Desportivo da FADEUP propõe uma formação aprofundada na área do treino desportivo. Delineado preferencialmente para treinadores já graduados (titulares de primeiro ciclo), o curso oferece aos estudantes a aquisição de conhecimentos e competências em matéria de treino desportivo, com o intuito de formar profissionais com um perfil de exceção, habilitados para o exercício profissional da atividade de Treinador de Desporto, coordenação de equipas técnicas pluridisciplinares e formação de treinadores. Os diplomados em Treino Despotivos são reconhecidos com o Grau de Treinador de Desporto, conferido pelo Instituto Português de Desporto e Juventude.",
        "outings": "Formação reconhecida pelo Instituto Português de Desporto e Juventude para o exercício profissional da atividade de Treinador de Desporto, Especialistas em corpos técnicos das federações desportivas, Coordenação de equipas técnicas.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 117,
        "url": "https://sigarra.up.pt/fdup/pt/cur_geral.cur_view?pv_curso_id=10121",
        "name": "Mestrado em Ciências Jurídico-Empresariais       Não estão abertas candidaturas.  ",
        "description": "",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres"
    },
    {
        "id": 118,
        "url": "https://sigarra.up.pt/fdup/pt/cur_geral.cur_view?pv_curso_id=581",
        "name": "Mestrado em Criminologia ",
        "description": "Com acreditação renovada em 2016, o Mestrado em Criminologia apresenta atualmente um novo plano de estudos. Este passa a prever a possibilidade de Unidades Curriculares opcionais no 2º semestre, de modo a que os estudantes melhor possam adequar o seu percurso académico.Conferente do grau de Mestre em Criminologia, este ciclo de estudos conduz à apresentação de uma dissertação científica em Criminologia. A mera conclusão com aproveitamento das unidades curriculares dos 1.º e 2.º semestres corresponde ao Curso de Especialização em Criminologia não conferente de grau...",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 119,
        "url": "https://sigarra.up.pt/fdup/pt/cur_geral.cur_view?pv_curso_id=588",
        "name": "Mestrado em Direito ",
        "description": "A criação do ciclo de estudos conducente ao grau de mestre em Direito da Faculdade de Direito da Universidade do Porto foi aprovada por deliberação do Senado da Universidade do Porto em 25 de outubro de 2006 (Deliberação nº. 699/2007, D.R. II Série nº 76 de 18 de abril de 2007), tendo sido registado com o nº R/B-Cr 331/2007. Foi posteriormente, aprovada uma alteração à estrutura curricular deste Ciclo de Estudos, por Despacho Reitoral de 9 de Fevereiro de 2012, publicada por Despacho n. 3023-2012, DR II Série, n.º 43, de 29 de Fevereiro e retificada por Declaração de retificação n.º 1579/2012. D.R. n.º 238, Série II de 2012-12-10. Foi posteriormente aprovada uma alteração à estrutura curricular, tendo sido publicada por Despacho em Diário da República e rectificada por  Declaração de retificação n.º 667/2016 em Diário da República, 2.ª série &#8212, N.º 119 &#8212, 23 de junho de 2016.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 120,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1079",
        "name": "Mestrado em Contabilidade e Controlo de Gestão ",
        "description": "O Mestrado em Contabilidade e Controlo de Gestão dirige-se a atuais e futuros profissionais em Contabilidade e Controlo de Gestão, oferecendo uma formação avançada nestas duas áreas nucleares, e também em outras áreas relevantes para o exercício da profissão, como Finanças e Fiscalidade.",
        "outings": "Contabilidade Financeira, Controlo de Gestão, Finanças e Fiscalidade",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 121,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1045",
        "name": "Mestrado em Economia ",
        "description": "O Mestrado em Economia da FEP oferece, em continuidade, formação em Ciências Económicas destinada, em particular, a estudantes recém-licenciados (ou com grau equivalente no estrangeiro) nas áreas de Economia, Finanças e Gestão. Tem como principal objetivo reforçar a formação de base em Economia através do aprofundamento da teoria económica e dos instrumentos de análise económica, complementando com uma especialização de nível intermédio em áreas de aplicação da Economia. Desta forma, permite preparar os estudantes para a prossecução de carreiras profissionais exigentes e para o acesso a programas de investigação científica / doutoramento. Os estudantes inscritos no Mestrado em Economia (english track) são elegíveis para integrar o programa QTEM. A FEP é o único parceiro académico português da QTEM, uma rede internacional que reúne algumas das mais prestigiadas escolas de Economia e Gestão e parceiros empresariais de topo do mundo.",
        "outings": "Com uma sólida formação teórica e prática, os diplomados do Mestrado em Economia estão habilitados a prosseguir carreiras profissionais ou académicas exigentes em instituições públicas ou privadas, nacionais ou internacionais, tais como: Instituições financeiras, Entidades reguladoras, Entidades auditoras e consultoras, Empresas não financeiras, Organismos da administração pública central ou local, Organismos económico-financeiros internacionais , Organizações não governamentais, Instituições de ensino e investigação, etc.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 124,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1037",
        "name": "Mestrado em Economia e Gestão da Inovação ",
        "description": "Destinado a profissionais que pretendam desenvolver/consolidar atividade no quadro da gestão dos processos de inovação nas empresas e organizações, o Mestrado em Economia e Gestão da Inovação da FEP habilita os estudantes para carreiras ligadas às diferentes vertentes da inovação. O curso visa contribuir, desta forma, para uma eficaz inserção dos estudantes no mercado de trabalho, bem como para potenciar a capacidade de inovação do tecido empresarial e organizacional.",
        "outings": "Associações empresariais, Entidades públicas, Instituições bancárias, Instituições de ciência e tecnologia, Associações ou agências de desenvolvimento",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 125,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1040",
        "name": "Mestrado em Economia e Gestão de Recursos Humanos ",
        "description": "Orientado para futuros profissionais na área da gestão de recursos humanos ou para quem já tem experiência profissional na área, o Mestrado em Economia e Gestão de Recursos Humanos da FEP oferece uma formação analítica sólida, complementada com o desenvolvimento das competências necessárias para uma carreira profissional centrada na gestão de pessoas e no desenvolvimento de políticas dirigidas ao mercado de trabalho.",
        "outings": "Direção de recursos humanos, Estudos do mercado de trabalho, Consultoria em recursos humanos",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 126,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1036",
        "name": "Mestrado em Economia e Gestão do Ambiente ",
        "description": "O Mestrado em Economia e Gestão do Ambiente (MEGA) da FEP é um programa que procura dar resposta à necessidade de formação avançada nas áreas do Ambiente e Energia, sentida por organizações de diverso tipo, em virtude dos crescentes desafios com que se confrontam. Os seminários com profissionais de renome, as visitas de estudo a organizações e estágios curriculares são uma imagem de marca do curso, direcionado para a qualificação de profissionais competentes, agentes de mudança, capazes de fazer a diferença na tomada de decisões estratégicas das organizações.",
        "outings": "Empresas onde as questões ambientais e energéticas são particularmente relevantes.), Empresas com gabinetes de gestão ambiental e/ ou integradas no mercado de CO2, Bancos, Seguradoras e Empresas de Auditoria e Consultoria, Organizações com competência ao nível da exploração e gestão dos recursos naturais, nomeadamente recursos hídricos, pescas, florestas, agricultura, turismo, energia e resíduos.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 127,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1050",
        "name": "Mestrado em Economia e Gestão Internacional ",
        "description": "O Mestrado em Economia e Gestão Internacional (MEGI) da FEP é um curso especializado e profissionalizante. Com um enfoque vincadamente internacional, destina-se a formar profissionais para carreiras que impliquem um conhecimento sólido do funcionamento da economia global e da gestão empresarial num contexto internacional em mudança permanente.",
        "outings": "Gestão estratégica internacional, Marketing internacional, Comércio nternacional, Investimento internacional",
        "typeOfCourse": "Mestrado",
        "duration": "120 ECTS"
    },
    {
        "id": 128,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1084",
        "name": "Mestrado em Finanças ",
        "description": "O Master in Finance é um programa de cariz internacional, totalmente ministrado em inglês, com conteúdos reconhecidos pelo Instituto CFA (Chartered Financial Analyst). O curso oferece uma formação avançada na área de Finanças, com um foco particular nas Finanças Corporativas e nos Mercados Financeiros e adotando uma perspetiva prática cuidadosamente acompanhada de um elevado rigor científico.",
        "outings": "Bancos de investimento, Bancos comerciais,Fintech, Companhias de seguros, Empresas produtoras, na área da gestão financeira",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 129,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1082",
        "name": "Mestrado em Finanças e Fiscalidade ",
        "description": "O Mestrado em Contabilidade e Controlo de Gestão da FEP visa formar profissionais que supram as necessidades das organizações na área da Contabilidade e do Controlo de Gestão. Entre as competências desenvolvidas ao longo do curso incluem-se o domínio da produção e interpretação da informação contabilística e de gestão, o conhecimento aprofundado da vertente financeira e fiscal da organização, e a capacidade para desenhar e gerir sistemas de informação empresarial e sistemas de informação contabilística em particular.",
        "outings": "Contabilidade Financeira, Controlo de Gestão,Finanças e Fiscalidade",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 130,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1081",
        "name": "Mestrado em Gestão ",
        "description": "O Mestrado em Gestão da FEP pretende proporcionar uma formação sólida nas áreas-chave da Gestão, permitindo o aprofundamento de conhecimentos em uma ou mais áreas de especialização. Num contexto de desenvolvimento das competências sociais dos seus estudantes, duas ideias-chavebalizam a formação ministrada: a empregabilidade ea internacionalização.",
        "outings": "Finanças, Estratégia, Marketing, Vendas, Operações, Recursos Humanos, Consultoria, Auditoria",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 131,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1083",
        "name": "Mestrado em Gestão Comercial ",
        "description": "O Mestrado em Gestão Comercial da FEP visa dotar os participantes das competências técnicas e comportamentais indispensáveis ao exercício de funções de relevo na área da Gestão Comercial. O curso está desenhado para quem pretenda promover a sua valorização profissional, e também para quem necessite de uma formação científica de base para seguir ou evoluir numa carreira na área comercial.",
        "outings": "Distribuição retalhista e grossista, Automóvel, Banca, Indústria, Prestação de serviços (saúde, farmacêutica, informática, tecnologias/ comunicação, consultoria, engenharia...).",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 132,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=30761",
        "name": "Mestrado em Gestão de Operações de Retalho ",
        "description": "O ciclo de estudos conducente ao grau de Mestre em Gestão de Operações de Retalho é composto por duas componentes: a) uma componente modular, constituída pelo conjunto organizado de Unidades Curriculares (UC) obrigatórias, a que correspondem 30 ECTS (1.º Semestre). Globalmente, esse conjunto de UC visam o desenvolvimento e aprofundamento articulado de conhecimentos teóricos e competências práticas especificas do domínio da Gestão das Operações de Retalho, b) um trabalho de projeto, original e especialmente realizado para este fim, a que corresponde 30 ECTS do total dos 60 créditos ECTS e cuja defesa em provas públicas permitirá a obtenção do grau de Mestre em Gestão de Operações de Retalho.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "2 Semestres"
    },
    {
        "id": 133,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1071",
        "name": "Mestrado em Gestão de Serviços ",
        "description": "O Mestrado em Gestão de Serviços (MGS) da FEP visa o aprofundamento de conhecimentos e o desenvolvimento de competências que possibilitem a utilização de conceitos e modelos especializados na Gestão de Serviços. Os conhecimentos ministrados no curso permitirão a tomada dedecisões e o exercício de múltiplas funções de nívelintermédio e superior em organizações de serviços.",
        "outings": "Banca, Seguros, Saúde, Telecomunicações, Ensino, Comércio, Consultoria, Auditoria, Turismo",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 134,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1041",
        "name": "Mestrado em Gestão e Economia de Serviços de Saúde ",
        "description": "O Mestrado em Gestão e Economia de Serviços de Saúde (MGESS) da FEP visa dotar os participantes de formação técnica e científica, multidisciplinar e abrangente, que os habilite a exercer funções de direção e chefia de serviços desaúde. O curso tem especial interesse para Médicos, Farmacêuticos, Enfermeiros, Técnicos Superiores de Saúde, entre outros profissionais de nível superior que pretendam adquirir conhecimentos ou exercer funções de gestão e direção de serviços de saúde.",
        "outings": "Gestão e direção de Serviços de Saúde, incluindo a administração hospitalar, direção de clínicas ou farmácias e serviços na área médica ou enfermagem",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 135,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1078",
        "name": "Mestrado em Marketing ",
        "description": "O Mestrado em Marketing da FEP proporciona uma formação profissionalizante e especializadaem Marketing. Para além de oferecer um aprofundamento dos conhecimentos, o curso desenvolve competências que permitem uma efetiva aplicação práticade ferramentas de gestão no exercício de funções na área do Marketing.",
        "outings": "Marketing, Comunicação, Vendas, Estratégia,Marketing Digital",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 136,
        "url": "https://sigarra.up.pt/fep/pt/cur_geral.cur_view?pv_curso_id=1080",
        "name": "Mestrado em Modelação, Análise de Dados e Sistemas de Apoio à Decisão ",
        "description": "O Mestrado em Modelação, Análise de Dados e Sistemas de Apoio à Decisão da FEP destina-se a decisores que pretendam acrescentar valor às suas capacidades estratégicas, tirando partido dos sistemas de informação de apoio à decisão e da análise de dados, assim como a especialistas em sistemas de informação ou estatística que pretendam participar no desenvolvimento de ambientes computacionais de apoio à decisão. Ao longo do curso, os participantes adquirem as competências indispensáveis ao exercício de funções de relevo nas áreas de análise de dados e extração de conhecimento de bases dados.",
        "outings": "Gestão de projetos, Business Intelligence, Gestão de Crédito , Data Analysis, Gestão e programação de websites, Empresas que desenvolvem aplicações de apoio à decisão, Docência, Investigação",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 137,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22821",
        "name": "Mestrado em Bioengenharia ",
        "description": "Resultado da colaboração entre a FEUP e o ICBAS, o Mestrado em Bioengenharia da U.Porto garante uma formação especializada, no sentido de abordar de uma forma multidisciplinar problemas complexos de biomedicina e de biotecnologia industrial, sob as perspetivas da engenharia dos dispositivos, de processos e da engenharia molecular. Pretende-se que os graduados sejam capazes de conceber, projetar, implementar ou manter sistemas e serviços em domínios específicos da Bioengenharia, bem como realizar projetos de investigação científica de alto nível de carácter fundamental e/ou aplicado.",
        "outings": "Especialização em Engenharia Biomédica - instrumentação biomédica, processamento e análise de sinais e imagens biomédicas, dispositivos médicos (próteses externas e internas), engenharia de tecidos (nomeadamente para medicina regenerativa) telemedicina, bioinformática, robótica médica (cirurgia minimamente invasiva), e biónica.Especialização em Engenharia Biológica - indústrias de processos químico-biológicos (farmacêutica, alimentar, cosméticos, aromas) e de valorização de materiais naturais (madeira, couro, materiais e produtos de origem marinha), ambiente e saúde ambiental (tratamento de resíduos contaminados, qualidade ambiental em unidades hospitalares e empresas da área da saúde).Especialização em Bioengenharia Molecular- sectores onde é prioritário a conceção e desenvolvimento de novos produtos com base em biologia molecular, particularmente fármacos e sistemas de diagnóstico.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 138,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=737",
        "name": "Mestrado em Ciência da Informação ",
        "description": "O Mestrado em Ciência da Informação (MCI) proporciona uma formação avançada em Ciência da Informação dirigida a quem deseja prosseguir uma carreira profissional ou de investigação nesta área. Este mestrado é da responsabilidade conjunta da Faculdade de Engenharia e da Faculdade de Letras da Universidade do Porto.",
        "outings": "Os mestres em CI são gestores de informação. Estão preparados para posições nos serviços de informação existentes (nas bibliotecas, arquivos e serviços de documentação), para integrar equipas que desenvolvem sistemas de informação, conceber novos serviços de informação (desmaterialização, gestão de documentos, fluxos de trabalho de processos, sistemas de colaboração, redes sociais) e, em última análise, tornarem-se Chief Information Officer (CIO) em organizações privadas e públicas.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 139,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=617",
        "name": "Mestrado em Engenharia Biomédica ",
        "description": "O Mestrado em Engenharia Biomédica (MEB) da FEUP cobre um vasto leque de domínios da Engenharia Biomédica, e destina-se a satisfazer a procura de formação especializada, em termos científicos e técnicos, de licenciados em Engenharia, Matemática, Física, Química, e cursos afins, interessados numa atividade destacada em instituições e em empresas do setor da Saúde.",
        "outings": "Investigação e desenvolvimento em laboratórios, particulares ou do Estado, Desenvolvimento de próteses e órgãos artificiais, Conceção de sistemas de monitorização de dados fisiológicas ou de diagnóstico, Conceção de implantes eletrónicos e atuadores de apoio à realização de terapias, Desenvolvimento de aplicações de software para a prestação e gestão de cuidados de saúde, Ensino e formação de recursos humanos no domínio da tecnologia aplicada à saúde, Elaboração, avaliação, verificação da adequação e cumprimento de normas da tecnologia biomédica, Planeamento, organização, e verificação de instalações dedicadas à prática de atos médicos, Assessoria na elaboração de requisitos e procedimentos para a aquisição e verificação de bens e serviços de tecnologia biomédica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 140,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22822",
        "name": "Mestrado em Engenharia Civil ",
        "description": "O Mestrado em Engenharia Civil da FEUP pretende formar Engenheiros capazes de conceber, projetar e gerir sistemas, estruturas e obras de Engenharia Civil, aplicando metodologias de análise, materiais, equipamentos e processos atualizados e adequados, com respeito pela Ética, Ambiente e pelos superiores interesses da Comunidade. Para isso, oferece uma formação complementar à Licenciatura, mais abrangente com desenvolvimento aprofundado dos seus aspetos formativos essenciais, e especializações nas principais áreas científicas e técnicas de Engenharia Civil.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 169,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=480",
        "name": "Mestrado em Ciências da Comunicação ",
        "description": "Partilhado pelas Faculdades de Letras, Engenharia, Belas-Artes e Economia, o Mestrado em Ciências da Comunicação: Jornalismo, Assessoria, Multimédia combina uma formação na área das humanidades e das ciências sociais com as áreas das novas tecnologias da informação e da comunicação, da estética, da economia e da gestão. O curso tem uma forte componente teórica e de aprofundamento de conhecimento na área, envolvendo os estudantes na investigação na área transversal das ciências da comunicação.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 141,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22864",
        "name": "Mestrado em Engenharia de Materiais ",
        "description": "O Mestrado em Engenharia de Materiais (M.EMAT) da FEUP visa formar graduados capazes de desenvolver carreiras profissionais em qualquer área da Engenharia de Materiais. Com duas especializações (uma de carácter mais generalista em Materiais e outra em Metalurgia), o M.EMAT oferece uma formação avançada em Ciência e Tecnologia de Materiais, com incidência em: Projeto de Produto, Tecnologias de Processamento e Técnicas de Caracterização. Esta formação é complementada com formação em Gestão e Competências Transversais, fator de elevada importância no mundo empresarial.",
        "outings": "Os diplomados em Engenharia de Materiais podem exercer atividade profissional na Indústria, nos Serviços e na Investigação, estando aptos para desenvolver carreiras profissionais em qualquer área da Engenharia de Materiais. As principais saídas profissionais abrangem um amplo conjunto de empresas com necessidade de especialistas em metais, polímeros, cerâmicos, compósitos e biomateriais, produção e processamento de metais, fundição, tratamentos térmicos, corrosão e aplicação de revestimentos, projeto de componentes, inspeção, ensaios e certificação de sistemas, gestão ambiental e tratamento de resíduos, gestão da produção e melhoria contínua. O Engenheiro de Materiais, com uma sólida formação em Ciências e Engenharia dos Materiais, está preparado para assumir funções em áreas fundamentais da Engenharia, tais como Produção, Projeto, Planeamento, Logística, Comercial, Ambiente, Qualidade, Gestão, Melhoria Contínua e I&D&I.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 142,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=739",
        "name": "Mestrado em Engenharia de Minas e Geo-Ambiente ",
        "description": "O Mestrado em Engenharia de Minas e Geo-Ambiente da FEUP tem como principal objetivo formar quadros superiores em Engenharia de Minas, profissionalmente competentes e habilitados para compreenderem, conceberem, projetarem e implementarem soluções técnicas otimizadas nas áreas da Prospeção, Exploração e Tratamento de recursos naturais, assim como na área do Geo-Ambiente, numa perspetiva de preservação, recuperação e sustentabilidade ambiental, entendidos como pilares fundamentais da coesão e bem-estar social.",
        "outings": "Unidades industriais de exploração e/ou transformação de recursos naturais, tais como minas metálicas e não-metálicas, a céu aberto e subterrâneas, pedreiras de rochas industriais e ornamentais, Explorações de águas minero-industriais, minerais naturais e de nascente,Empresas/gabinetes de consultoria e investigação nas áreas da geologia, prospeção geofísica e reconhecimento de maciços, Projetos e trabalhos de escavação subterrânea e a céu aberto, associados à construção e às obras públicas, tais como poços, túneis, galerias e outras infraestruturas para armazenamento subterrâneo,Organismos do Estado, de gestão e fiscalização de obras públicas, de atividade extrativa e de transformação de recursos, Empresas de consultoria em Engenharia de Minas, Geo-Ambiente e, Geotecnia, Investigação, supervisão e desenvolvimento em laboratórios, particulares ou do Estado, tais como de controlo de qualidade destinados ao apoio à indústria extrativa e de construção, Serviços autárquicos nas áreas do ambiente, do apoio ao ordenamento do território, e da recuperação e reabilitação ambiental,Empresas fornecedoras de serviços à indústria extrativa e de gestão do meio ambiente,Sectores da investigação, do ensino e da formação profissional.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 143,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=717",
        "name": "Mestrado em Engenharia de Segurança e Higiene Ocupacionais ",
        "description": "O Mestrado em Engenharia de Segurança e Higiene Ocupacionais (MESHO) da FEUP visa a formação de quadros superiores, detentores das competências e capacidades necessárias para desenvolver, coordenar e controlar as atividades de prevenção e proteção contra riscos profissionais, nos diversossetores da atividade económica. Estruturado em dois ramos - tecnologia e segurança e emergência -, o curso visa ainda contribuir para o desenvolvimento de investigação numa área técnica e cientifica multidisciplinar e,simultaneamente, socialmente sensível.",
        "outings": "Título profissional: Tecnico Superior de Segurança e Saúde do Trabalho, nível 7, conferido pela ACT.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 144,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=727",
        "name": "Mestrado em Engenharia de Serviços e Gestão ",
        "description": "O Mestrado em Engenharia de Serviços e Gestão (MESG) da FEUP destina-se a licenciados nas áreas de Engenharia, Ciências de Engenharia, Economia ou Gestão, que pretendam desenvolver a sua carreira na área do desenvolvimento, desenho e gestão de serviços em qualquer sector de atividade, incluindo o próprio setor industrial.",
        "outings": "Concepção e implementação de serviços apoiados na tecnologia, fomentando a inovação nas organizações, Apoio às empresas de TI no aproveitamento da sua tecnologia para criar soluções de serviços valiosos, especialmente na interface entre TI e serviço, Apoio a empresas manufactureiras na adição de componentes de serviços valiosos às suas ofertas, a fim de criar soluções mais completas para os seus clientes, Modelação e conceção de processos de negócio nas organizações.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 145,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=10861",
        "name": "Mestrado em Engenharia de Software ",
        "description": "O Mestrado em Engenharia de Software (MESW) da FEUP oferece uma formação científica e profissional avançada em Engenharia de Software e é projetado para profissionais que buscam atualizar as suas competências, bem como, para aqueles que pretendem adquirir novas competências e conhecimentos atuais em Engenharia de Software. O objetivo do curso é promover a excelência da qualificação em aspetos avançados e nucleares da Engenharia de Software, desde os seus fundamentos teóricos até à integração de tecnologias informáticas nas organizações.",
        "outings": "Os diplomados em Engenharia de Software são profissionais indispensáveis à indústria de software, capazes de gerir projetos de grande dimensão, complexidade e restrições impostas pelo mercado. Na U.Porto, formamos pessoas capazes de estar no topo da hierarquia técnica da indústria de software mundial.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 146,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22804",
        "name": "Mestrado em Engenharia do Ambiente ",
        "description": "Engenharia do Ambiente - M.EAOs Engenheiros do Ambiente dedicam-se à prevenção e identificação de efeitos ambientais perversos, à aplicação de tecnologias para os solucionar bem como à integração no desenvolvimento industrial e social, de soluções sustentáveis.A Engenharia do Ambiente esta&#769, reportada no top 5 das profisso&#771,es de Engenharia do Futuro (TOPUNIVERSITIES. Rankings), apresenta uma dimensa&#771,o transversal e preve&#770,-se cada vez mais presente nos projetos e intervenc&#807,o&#771,es na sociedade enquanto parte de um ecossistema.A partir do ano letivo de 2021/2022 a Faculdade de Engenharia da Universidade do Porto oferece dois ciclos de estudos independentes de Engenharia do Ambiente, a Licenciatura e o Mestrado.O Mestrado em Engenharia do Ambiente &#8211, M.EA &#8211, corresponde ao segundo ciclo de estudos do ensino superior, composto por duas componentes: um curso de mestrado e uma dissertação científica.O curso de mestrado é constituído por 90 créditos e tem uma duração de 3 semestres.Partindo das competências adquiridas no primeiro ciclo, abordam-se, de forma integrada e harmonizada, um largo espectro de tópicos que vão desde as alterações climáticas, acústica, avaliação de impacte ambiental, do ciclo de vida e de risco, de hidráulica marítima, ao projeto das instalações de tratamento de efluentes gasosos, líquidos e de resíduos sólidos assim como de reabilitação de solos, integrados numa perspetiva regional ampla com suporte na gestão, direito e economia do ambiente.O Mestrado permite o aprofundamento de conhecimentos em tópicos do interesse de cada estudante com UC optativas (inclusive uma UC que pode ser selecionada da oferta formativa da UP) assim como apresenta um leque de unidades curriculares de consolidação orientadas para estudantes sem formação prévia consolidada em áreas estruturantes.A dissertação corresponde a 30 créditos e tem uma duração prevista de 1 semestre. A defesa pública da dissertação permite obter o grau de Mestre em Engenharia do Ambiente.",
        "outings": "Os graduados com o Mestrado em Engenharia do Ambiente estão preparados para assumir imediatamente o exercício pleno da profissão de Engenheiro do Ambiente em indústrias, em empresas das mais diversas áreas assim como na área específica ambiental, em gabinetes de projeto, em serviços municipais e em agências governamentais.Enquanto Engenheiros do Ambiente, os graduados estão aptos a desempenhar funções em diversas áreas, tais como: Avaliação ambiental Gestão ambiental Ecologia industrial Gestão de recursos hídricos Projeto e gestão de estações de abastecimento e tratamento de águas/águas residuais Projeto e gestão de sistemas de tratamento de resíduos sólidos Reabilitação de solos e aquíferos Gestão de ecossistemas Alterações climáticas e qualidade do ar Acústica e vibrações Planeamento e ordenamento do território Utilização e implicações ambientais das diferentes fontes de energia Saúde ambiental e segurança no trabalho.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 147,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=20521",
        "name": "Mestrado em Engenharia e Ciência de Dados ",
        "description": "O Mestrado em Engenharia e Ciência de Dados (MECD) da FEUP oferece formação científica e profissional avançada em Engenharia e Ciência de Dados. O curso está projetado para profissionais que buscam atualizar as suas competências, bem como, para aqueles que pretendem adquirir novas competências e conhecimentos atuais em Engenharia e Ciência de Dados.",
        "outings": "No final, os diplomados em Engenharia e Ciência de Dados estarão habilitaados a exercer funções como cientistas de dados em empresas, ou investigadores na área de ciência de dados em centros de investigação ou em empresas nos ramos do retalho, telecomunicações, saúde, banca e indústria.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 148,
        "url": "https://paginas.fe.up.pt/~estudar/cursos/mestrado-engenharia-gestao-industrial/",
        "name": "Mestrado em Engenharia e Gestão Industrial ",
        "description": "O objetivo do Mestrado em Engenharia e Gestão Industrial é educar profissionais que aliem uma formação de base em Engenharia a uma formação avançada nas áreas da Gestão Industrial. Os graduados adquirem conhecimentos avançados nas áreas de Gestão de Operações (Qualidade, Manutenção, Produção, Logística), Informática (Indústria 4.0), Métodos Quantitativos (Ciência de Dados) e Gestão de Empresas (Estratégia, Marketing, Finanças, Recursos Humanos, Inovação e Empreendedorismo). O desenvolvimento da criatividade, capacidade de comunicação e liderança de equipas são também aspetos centrais da formação adquirida no curso.",
        "outings": "Espera-se que os graduados sejam capazes de apoiar a tomada de decisões nas organizações, sendo agentes ativos de mudança e inovação.Pretende-se que os graduados desempenhem funções de apoio à gestão na preparação de decisões em diversas áreas funcionais das empresas, incluindo a gestão da produção, logística, gestão de ativos e manutenção, gestão da qualidade, sistemas de informação, modelação de processos, análise financeira, controlo de gestão, estratégia ou marketing. Aqueles que demostrarem capacidades de liderança podem alcançar posições de administração de empresas ou iniciar os seus próprios negócios.Quem quiser prosseguir uma carreira académica ou obter uma qualificação de doutoramento pode continuar a sua formação no Programa Doutoral em Engenharia e Gestão Industrial da FEUP, ou noutras instituições de ensino superior nacionais ou estrangeiras.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 149,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22806",
        "name": "Mestrado em Engenharia Eletrotécnica e de Computadores ",
        "description": "O  Mestrado em Engenharia Elétrica e de Computação (M.EEC) visa formar engenheiros especializados na conceção e planeamento de sistemas elétricos, eletrónicos e de computadores. Oferece aos alunos treino avançado e especializado em uma das três áreas bem estabelecidas da engenharia elétrica e da computação: Automação, Energia, Telecomunicações, Eletrónica e Computadores. Cada área de especialização representa um percurso formativo coerente, correspondendo a perfis de empregabilidade reconhecidos pelo mercado de trabalho. O M.EEC começa com um conjunto de unidades curriculares que são comuns a todos os estudantes da área de especialização, além disso, grupos de unidades curriculares optativas são oferecidos para permitir um estudo mais aprofundado de uma determinada subárea da especialização.O programa consiste em 120 créditos ECTS, dos quais:90 créditos ECTS podem ser obtidos num conjunto de unidades curriculares. Este conjunto de unidades conduz à obtenção de um diploma de Mestrado (sem atribuição de grau) em Engenharia Eletrotécnica e de Computadores numa das 3 especializações: Automação, Energia, Telecomunicações, Eletrónica e Computadores.30 créditos ECTS podem ser obtidos pela realização de uma dissertação científica original preparada especificamente para este fim.O ciclo de estudos dá grande ênfase à preparação dos alunos para tarefas conceptuais e de projeto, tanto individualmente quanto como membros de equipas multidisciplinares. O ciclo de estudos também dá grande importância à aquisição de \"soft skills\"  e outras competências transferíveis de grande relevância hoje em dia, incluindo a pró-atividade e a capacidade de aprendizagem ao longo da vida.",
        "outings": "Os novos desenvolvimentos relacionados com as tecnologias de informação e comunicação, bem como os que se registam nas áreas da produção e automação industrial e nas novas formas de produção e gestão de energia elétrica, fazem da ECE uma das áreas mais dinâmicas da engenharia.Este programa de mestrado acompanha esses desenvolvimentos e combina uma formação sólida e específica em áreas relevantes para o desenvolvimento do país e do mundo, aumentando assim as oportunidades de carreira na indústria e no setor de serviços no campo da engenharia elétrica e da computação. Existem oportunidades de carreira para as diferentes facetas de atividade (conceção, operação e manutenção) em várias áreas, incluindo:aprendizagem computacionalautomação industrialcidades inteligentescomunicações óticasconversão de energiaenergias renováveisgestão de sistemas e redes de computadoresinformática industrialinstalações elétricasmicroeletrónica (analógica e digital)mobilidade elétricarobóticasistema de energiasistemas de controlesistemas de telecomunicaçãosistemas embarcadosvisão computacional",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 150,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22862",
        "name": "Mestrado em Engenharia Informática e Computação ",
        "description": "O objetivo primeiro do M.EIC é promover a qualificação em desenvolvimentos recentes e aspetos avançados da Engenharia Informática e Computação (EIC), com aplicação à conceção, projeto, implementação e operação de sistemas informáticos e à integração das TIC nos ambientes organizacionais, habilitando assim os seus graduados para desempenhar funções de grande responsabilidade e de liderança em contextos complexos, multidisciplinares e com foco na inovação, ou para prosseguir para doutoramento.Para isso, oferece uma formação conciliando:- uma formação comum nos desenvolvimentos mais recentes nas grandes áreas científicas e técnicas de EIC,- uma formação especializada em tópicos avançados de EIC do interesse de cada estudante, via unidades curriculares (UCs) optativas e uma Dissertação,- uma formação flexível em aspetos complementares de Gestão e Competências Transversais.O ciclo de estudos compreende 40.5 ECTS de UCs obrigatórias, 49.5 de UCs optativas e 30 de Dissertação.",
        "outings": "O M.EIC pretende habilitar os seus graduados para o desempenho de funções profissionais como as indicadas nos European ICT Professional Role Profiles que requerem competências de nível e-4 (mestrado) do European e-Competence Framework, como por exemplo:- Devops Expert- Data Scientist- Cyber Security Specialist- System Architect- Solution Designer- System Analyst- Quality Assurance Manager- Product Owner- Scrum Master- Project manager",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 151,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22901",
        "name": "Mestrado em Engenharia Mecânica ",
        "description": "O/A engenheiro/a mecânico/a é um pouco de tudo, é o/a jogador/a de futebol que defende, ataca e marca golos. A engenharia mecânica abrange todas as áreas de engenharia permitindo ao engenheiro/a mecânico/a desempenhar qualquer função. É a chave do seu sucesso. Tem como pilares a matemática e a física para conceber, projetar e fabricar carros, motas, aviões, comboios, fábricas, sistemas energéticos, etc. É o motor da nossa sociedade.",
        "outings": "A FEUP tem por missão a &#8220,Educação e formação de profissionais de Engenharia de nível internacional, sustentadas em Investigação e Desenvolvimento de excelência com foco regional mas com qualidade reconhecida ao nível global e numa prática de extensão de reconhecida qualidade, contemplando as vertentes científica, técnica, ética e cultural&#8221,. O Mestrado em Engenharia Mecânica (MEM) revê-se completamente nesta missão, ao fornecer uma formação avançada em Engenharia Mecânica capacitando os seus graduados para enveredar por carreiras profissionais em termos nacionais e internacionais. Para isso, confere aos seus estudantes competências variadas, técnicas e pessoais, de importância reconhecida no mundo empresarial.As principais saídas profissionais de um/a Mestre em Engenharia Mecânica são:Construção de equipamentos mecânicos e térmicos (veículos automóveis e ferroviários, máquinas-ferramenta, estruturas metálicas, caldeiras, permutadores de calor&#8230,),Produção de energia (energia térmica, energia eólica, novas energias, climatização, qualidade do ar interior&#8230,),Planeamento e de gestão da produção (logística, transportes, manutenção industrial, gestão de recursos humanos, gestão da qualidade&#8230,),Automação industrial (automatização de linhas de produção, robótica, sistemas de controlo&#8230,),Desenvolvimento e aplicação de novos materiais (materiais cerâmicos, compósitos, poliméricos, bio-materiais&#8230,),Projeto e desenvolvimento de novos produtos (design integrado, ergonomia, sustentabilidade, &#8230,),Gestão de manutenção e reparação automóvel,Criação de novas empresas de índole tecnológica,Avaliação de projetos e consultadoria,",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 152,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=22883",
        "name": "Mestrado em Engenharia Química ",
        "description": "Destinado a candidatos com uma formação de base em Engenharia Química e áreas afins, o Mestrado em Engenharia Química da FEUP tem como objetivo geral a preparação dos estudantes para uma carreira profissional em atividades práticas ou de investigação em Engenharia Química ou em áreas afins. Acentuando uma cultura prática de engenharia em simultâneo com a atividade de projeto, o ciclo de estudos oferece aos estudantes a possibilidade de adquirirem competências mais específicas em quatro áreas de especialização: Processos e Produto, Energia, Biotecnologia, ou Ambiente.",
        "outings": "As saídas profissionais dos Mestres em Engenharia Química da FEUP incluem um largo leque de oportunidades, nomeadamente na indústria, na investigação, em instituições de ensino ou em atividades técnico-comerciais, entre muitas outras, a nível nacional e internacional.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 153,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=15661",
        "name": "Mestrado em Estruturas de Engenharia Civil ",
        "description": "O Mstrado em Estruturas de Engenharia Civil (MESTEC) oferece uma formação teórica e prática em tópicos avançados relacionados com o design de Estruturas e Geotecnia em Engenharia Civil. Orientado para uma inserção mais competitiva dos diplomados no mercados de trabalho, o curso visa assegurar o desenvolvimento de competências em diversos domínios, nomeadamente em métodos de análise e dimensionamento de obras nas quais as Estruturas e a Geotecnia têm forte interação.",
        "outings": "Atividade individual como projetista de Estruturas de Engenharia Civil, Integração em empresas de engenharia vocacionadas para o projeto estrutural, Acompanhamento da construção e fiscalização de obras complexas de Estruturas de Engenharia Civil",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 154,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=16641",
        "name": "Mestrado em Gestão da Mobilidade Urbana ",
        "description": "Rssultado da colaboração entre a FEUP e a Faculdade de Ciências e Tecnologia da Universidade de Coimbra o Mestrado em Gestão da Mobilidade Urbana procura responder a uma lacuna formativa do mercado nacional. O curso é vocacionado para a transmissão de conhecimentos nos domínios específicos do planeamento do território, dos transportes e da gestão integrada da mobilidade em meio urbano, assentes em políticas, princípios e estratégias inovadoras e de sustentabilidade.",
        "outings": "Quadro técnico em órgãos de gestão local, regional e nacional, Consultoria na área dos transportes e mobilidade, Projetista no âmbito do ambiente urbano e transportes, Quadro técnico em empresas de transportes.",
        "typeOfCourse": "Mestrado",
        "duration": "3 Semestres / 90 ECTS"
    },
    {
        "id": 155,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=719",
        "name": "Mestrado em Inovação e Empreendedorismo Tecnológico ",
        "description": "O pioneiro Mestrado Inovação e Empreendedorismo Tecnológico (MIETE)oferecido pela Faculdade de Engenharia (FEP) e pela Faculdade de Engenharia (FEUP) visa a formação integrada de gestores e empreendedores através de um ensino prático (\"mãos-na-massa\") que, estando assente em conceitos teóricos sólidos e num acompanhamento permanente e profissional, permita o desenvolvimento de competências e conhecimentos com vista à eficaz gestão do conhecimento e inovação e ao desenvolvimento de novos negócios. Estes novos negócios, de elevado potencial, poderão ser desenvolvidos no seio de empresas existentes ou através da criação de novas empresas.",
        "outings": "Agências de desenvolvimento ou associações empresariais, municípios, gabinetes de consultadoria, áreas metropolitanas, comissões de coordenação para o desenvolvimento, empresas abertas à mudança tecnológica e organizacional, assim como outras instituições públicas ou privadas que entendam ser o Empreendedorismo e a Inovação um dos objetivos estratégicos do seu desenvolvimento.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 156,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=763",
        "name": "Mestrado em Mecânica Computacional ",
        "description": "A Mecânica Computacional teve um impacto profundo na ciência e tecnologia nas últimas décadas e é hoje uma área chave de investigação, educação e aplicação em todo o mundo. Neste contexto, o Mestrado em Mecânica Computacional da FEUP está estruturado com a missão de formar profissionais de Engenharia competitivos no mercado global de trabalho com a competência de atuarem como agentes de mudança no tecido empresarial.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 157,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=12982",
        "name": "Mestrado em Mecânica dos Solos e Engenharia Geotécnica ",
        "description": "Resultado da colaboração entre a U.Porto (através da FEUP) e a Faculdade de Ciências e Tecnologia da Universidade de Coimbra, o Mestrado em Mecânica dos Solos e Engenharia Geotécnica proporciona uma sólida formação teórica e prática a licenciados, com ou sem experiência profissional, que se sintam vocacionados para o exercício da atividade profissional neste domínio da Engenharia Civil. No final do curso, os diplomados estarão aptos para a conceção, dimensionamento e acompanhamento de obras e estruturas geotécnicas.",
        "outings": "Atividades de projeto de obras geotécnicas, Acompanhamento de obras geotécnicas, Fiscalização de obras geotécnicas.",
        "typeOfCourse": "Mestrado",
        "duration": "3 Semestres / 90 ECTS"
    },
    {
        "id": 158,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=732",
        "name": "Mestrado em Multimédia ",
        "description": "Resultado da colaboração entre cinco faculdades da U.Porto (FEUP, FBAUP, FCUP, FEP e FLUP), o Mestrado em Multimédia destina-se a estudantes e profissionais de múltiplas áreas do conhecimento que procuram solucionar os desafios de um mercado global cada vez mais competitivo e aprimorar as capacidades criativas por meio de uma forte base teórica, científica e tecnológica.O curso proporciona aos estudantes uma formação técnico-científica e o conhecimento prático e teórico para a conceção, desenvolvimento e realização de projetos, produtos, processos e serviços em Tecnologia Multimédia.",
        "outings": "Gestão e soluções em projetos multimédia, Produção e desenvolvimento de produtos e Serviços, Produção de música interativa e design de som, Desenvolvimento de jogos digitais, Realidade virtual e aumentada, Media interativos e UX/UI design",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 159,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=769",
        "name": "Mestrado em Planeamento e Projecto Urbano ",
        "description": "Resultado da colaboração entre a Faculdade de Engenharia (FEUP) e a Faculdade de Arquitetura (FAUP), o Mestrado em Planeamento e Projeto Urbano visa dotar os estudantes de uma preparação teórica e prática mais profunda para o exercício da profissão, ultrapassando fronteiras internacionais e acolhendo, para isso, uma diversidade de temas nas áreas do planeamento, da gestão e das políticas urbanas nas grandes e médias aglomerações.",
        "outings": "Organismos públicos da Administração Central e Local, Empresas privadas, nacionais e internacionais, com atividade centrada na assessoria técnica, nos estudos e relatórios técnicos e nos projetos ao nível do Ordenamento do Território, do Planeamento Regional e Urbano, do Desenvolvimento Territorial e das Dinâmicas Urbanas.H91",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 160,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=21701",
        "name": "Mestrado em Projeto, Construção e Gestão Sustentáveis do Ambiente Construído ",
        "description": "O novo MBUILD - Mestrado em Design Sustentável, Construção e Gestão dos Ambientes Construídos - é um Mestrado Conjunto promovido pela U.Porto (através da FEUP), Universidade da Cantabria (Espanha) e Technische Hochschule Mittelhessen (Alemanha), e que visa a aquisição, por parte dos estudantes, de competências e aptidões para a implementação e desenvolvimento de projetos no domínio da Indústria da Construção (IC),com um elevado nível de soluções sustentáveis e ambientalmente conscientes. . Com este curso, procura-se dar resposta às dificuldades identificadas pelas empresas europeias da Indústria da Construção (IC), especialmente quando trabalham em países em desenvolvimento.",
        "outings": "Civil Engineering and Architectural practices with focus on developing work framend under the diverse concepts of sustainability as a whole and its reflection and application in the context of the Construction Industry.Professionals in optimal place to act for EU companies working abroad, in a role of technical interface between the more sustainable solutions proposed by those companies and the actual context of the countries where projects will be implemented.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 161,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=16561",
        "name": "Mestrado em Projeto Integrado na Construção de Edifícios ",
        "description": "Resultado da colaboração entre as faculdades de Arquitetura e de Engenharia da U.Porto, o Mestrado em Projeto Integrado na Construção de Edifícios (MPRINCE) oferece uma oportunidade de formação no âmbito do domínio instrumental e metodológico do exercício do Projeto Integrado. Para além dos conhecimentos teóricos e aplicados nas diversas áreas científicas e tecnológicas associadas à realização de projetos de edifícios, os estudantes encontrarão ainda as ferramentas necessárias para desenvolver os seus projetos dentro dos conceitos de IPD Integrated Project Delivery.",
        "outings": "Gestão de Equipas de Projeto, Desenvolvimento Colaborativo de Projetos de AEC",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 162,
        "url": "https://sigarra.up.pt/feup/pt/cur_geral.cur_view?pv_curso_id=21561",
        "name": "Mestrado em Visão por Computador ",
        "description": "O Mestrado em Visão por Computador (MVCOMP) permite aos estudantes adquirir conhecimentos gerais em VC, bem como garantir a capacidade de analisar as necessidades de uma empresa no âmbito destas técnicas e propor e aplicar as ferramentas tecnológicas existentes. O curso oferece um perfil profissional orientado para a visão computacional, com formação teórica e prática numa variedade de técnicas que proporcionam ao diplomado um conhecimento sólido e alargado da área, permitindo-lhe analisar as necessidades de uma empresa e fornecer soluções inovadoras.",
        "outings": "Programaçãoem projetos de visão por computador, Gestão der equipa de desenvolvimento de projetos de visão por computador, Investigação na área de visão por computador, num centro de investigação, expandindo as fronteiras do conhecimento através do desenvolvimento de novos métodos, ou aplicando-os a novos domínios, Investigação na área de visão por computador numa empresa, impulsionando a inovação para manter a empresa na vanguarda.",
        "typeOfCourse": "Mestrado",
        "duration": "3 Semestres / 90 ECTS"
    },
    {
        "id": 163,
        "url": "https://sigarra.up.pt/ffup/pt/cur_geral.cur_view?pv_curso_id=1093",
        "name": "Mestrado em Análises Clínicas ",
        "description": "O Mestrado em Análises Clínicas (MAC) proporciona um melhor entendimento sobre diagnóstico, prevenção e/ou tratamento de doenças e sobre os mecanismos celulares e moleculares subjacentes à doença. Com um cariz fortemente laboratorial/prático, multidisciplinar e de elevada especificidade, o curso tem como principais objetivos a formação atualizada e consistente nas diferentes áreas científicas das Análises Clínicas.",
        "outings": "· Análises Clínicas (incluindo Análises Toxicológicas Hidrológicas e Bromatológicas)· Desenvolvimento Tecnológico, Investigação, Controlo da Qualidade (incluindo Controlo Microbiológico), Diagnóstico Terapêutico e Monitorização de Fármacos.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 164,
        "url": "https://sigarra.up.pt/ffup/pt/cur_geral.cur_view?pv_curso_id=1090",
        "name": "Mestrado em Controlo da Qualidade ",
        "description": "Fortemente alinhado com as grandes temáticas e preocupações sociais da atualidade, o Mestrado em Controlo da Qualidade (MCQ) da FFUP forma profissionais com competência em áreas do controlo da qualidade de produtos essenciais à vida e ao bem-estar dos cidadãos. O curso prepara ainda investigadores com capacidade para atuar, com elevado grau de autonomia, em áreas de ponta de intervenção das Ciências Físicas.",
        "outings": "Controlo da Qualidade nos domínios da indústria alimentar, farmacêutica e/ou dos cosméticos, Investigação em diferentes áreas do conhecimento",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 165,
        "url": "https://sigarra.up.pt/ffup/pt/cur_geral.cur_view?pv_curso_id=2041",
        "name": "Mestrado em Química Farmacêutica       Não estão abertas candidaturas.  ",
        "description": "O Mestrado em Química Farmacêutica (MQF) da FFUP visa a formação de profissionais dotados de competências para intervir na Indústria, nomeadamente na Indústria Farmacêutica e Química e para intervir em áreas de investigação e inovação muito diversas e multidisciplinares, como Química e Biologia. Com uma forte componente laboratorial, o curso promove uma formação aprofundada, multidisciplinar e enquadrada em vários aspetos relativos aos fármacos e aos medicamentos, desde a sua descoberta e introdução no mercado, até ao controlo analítico e regulamentar.",
        "outings": "Indústria Farmacêutica, Empresas da área da química (públicas ou privadas), Empresas com Controlo de Qualidade, Empresas com Análise de fármacos, Instituições de Aspetos Regulamentares de Medicamentos, Agências de transferência de tecnologia, Centros tecnológicos de interface academia-indústria, Investigação nas áreas da Química e da Biologia, Nanotecnologia.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 166,
        "url": "https://sigarra.up.pt/ffup/pt/cur_geral.cur_view?pv_curso_id=1091",
        "name": "Mestrado em Tecnologia Farmacêutica ",
        "description": "O Mestrado em Tecnologia Farmacêutica (MTF) da FFUP oferece uma formação multidisciplinar, orientada para especialistas e investigadores que tenham como objetivo adquirir um elevado nível de conhecimento sobre os medicamentos, os dispositivos médicos e os produtos cosméticos, desde a sua conceção, passando pelo processo de produção e controlo da qualidade, incluindo as questões de regulamentação.",
        "outings": "Indústria Farmacêutica, Indústria Cosmética, Biotecnologia, Dispositivos Médicos, Regulamentação de Medicamentos.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 167,
        "url": "https://sigarra.up.pt/ffup/pt/cur_geral.cur_view?pv_curso_id=1098",
        "name": "Mestrado em Toxicologia Analítica Clínica e Forense ",
        "description": "O Mestrado em Toxicologia Analítica Clínica e Forense (MTACF) tem como principal objetivo formar profissionais na área da Toxicologia, com conhecimento aprofundado nas suas vertentes analítica, clínica e forense. O curso tem uma organização curricular que pretende desenvolver competências em: aspetos teóricos (relacionados com conhecimentos base desta área científica), aspetos laboratoriais (tais como análises toxicológicas de vários grupos de compostos com interesse clínico e forense), aspetos clínicos (como a sintomatologia das intoxicações e sua caracterização), e aspetos forenses (tais como questões jurídico-legais relacionadas com a taxa de alcoolémia e o abuso de drogas).No 1.º ano, o estudante realiza um trabalho de seminário, com uma vertente de preparação para a dissertação/projeto, a desenvolver no 2.º ano curricular.",
        "outings": "Centros de investigação, laboratórios de análises químico-biológicas, em hospitais e farmácias (em particular, as hospitalares), centros de anti-venenos, delegações do Instituto de Medicina Legal, empresas (por exemplo ao nível de segurança no trabalho ou regulamentação), peritos jurídico-legais.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 168,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=436",
        "name": "Mestrado em Arqueologia ",
        "description": "O Mestrado em Arqueologia da FLUP tem como objetivo formar arqueólogos com sólida formação teórica e método de trabalho, detentores de aptidões profissionais que lhes permitam desempenhar várias tarefas na área de Arqueologia e do Património Cultural, nomeadamente nas vertentes da pesquisa e investigação científica, da gestão e da salvaguarda.",
        "outings": "Organismos do Estado, Organismos Autárquicos (Gabinetes de Arqueologia, GTL, Divisões de Património, etc.), Museus (nacionais, municipais ou outros, públicos e privados), Gabinetes de Arquitetura, Gabinetes de Gestão do Território, Empresas de Arqueologia e Património, Atividade como Profissional Liberal.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 170,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=14581",
        "name": "Mestrado em Comunicação e Gestão de Indústrias Criativas ",
        "description": "O Mestrado em Comunicação e Gestão de Indústrias Criativas garante uma formação avançada em áreas relacionadas com Comunicação e Gestão de Indústrias Criativas, dirigida a quem pretenda seguir uma carreira profissional ou de investigador na área transversal das Indústrias Criativas. Este mestrado confere competências científicas, técnicas e relacionais que potenciem a atitude empreendedora - e intra - empreendedora - na criação de negócios e projetos criativos que contribuam para o desenvolvimento regional e nacional num contexto global.",
        "outings": "Atividades de gestão, marketing, direção, produção, criação e outras em empresas da área das indústrias criativas, incluindo setores relacionados com os media e comunicação, Cargos em atividades criativas, incluindo trabalho freelancing, empresário por conta própria e empregado em pequenas, médias e grandes empresas associadas a trabalho criativo, desempenhando cargos nomeadamente em vá rias áreas nas indústrias de media, da edição, música e audiovisual em produção, design de som, televisão e cinema, rádio e produção online, multimedia, agências digitais, consultoras, Cargos em entidades governamentais, organizações sem fins lucrativos, entidades culturais, museus, galerias, e também em outras empresas e organizações privadas e públicas que tenham a criatividade como elemento central da criação de valor, Preparação para investigação doutoral em cultura, comunicação, media, negócios, projetos em indústrias criativas e organizações dependentes de trabalho criativo.H215",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 171,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=26601",
        "name": "Mestrado em Desafios das Cidades ",
        "description": "",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "3 Semestres / 90 ECTS"
    },
    {
        "id": 172,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=9082",
        "name": "Mestrado em Ensino de Filosofia no Ensino Secundário ",
        "description": "O Mestrado em Ensino de Filosofia no Ensino Secundário visa a aquisição de competências científicas e pedagógicas necessárias ao exercício da função docente, conferindo habilitação profissional para a docência no ensino secundário (na área específica da Filosofia).",
        "outings": "Qualificação profissional para a docência (grupo de recrutamento 410)",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 173,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=9081",
        "name": "Mestrado em Ensino de Geografia no 3º Ciclo do Ensino Básico e no Ensino Secundário ",
        "description": "O Mestrado em Ensino de Geografia (MEG) da FLUP constitui o primeiro passo na formação e qualificação de alto nível de futuros professores de Geografia. Partindo do aprofundamento científico e metodológico, alicerçado em atividades de investigação, de inovação e de exercício de competências didático-pedagógicas interdisciplinares em escolas do ensino básico e secundário, o curso procura desenvolver capacidades de adaptabilidade na ação, compreensão e resolução de problemas em ambiente educativo real, juntamente com a formação autónoma ao longo da vida para uma prática profissional de excelência.",
        "outings": "Docência, Investigação científica, Comunicação social, Dinamização cultural",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 174,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=9001",
        "name": "Mestrado em Ensino de História no 3º ciclo do Ensino Básico e no Ensino Secundário ",
        "description": "O Mestrado em Ensino de História da FLUP confere habilitação profissional para a docência de História - Grupo 400.Durante o curso, os estudantes são incentivados a desenvolver métodos ativos de aprendizagem, recursos digitais e tecnologias emergentes que possam ser utilizados em aulas de História, relevando a importância de uma abordagem multicultural da História, baseada na inclusão, na igualdade social e na igualdade de género, num quadro de referência que procura promover a aquisição de competências para a construção de uma cultura democrática.",
        "outings": "Docência, Investigação científica, Atividade editorial, Formação contínua, Dinamização turística, Dinamização cultural",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 175,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=10981",
        "name": "Mestrado em Ensino de Inglês no 1º Ciclo do Ensino Básico ",
        "description": "O Mestrado em Ensino de Inglês no 1º Ciclo do Ensino Básico da FLUP propõe uma abordagem integrada, inclusiva e inovadora do ensino do inglês a jovens aprendentes. O curso prepara futuros professores para abordagens holísticas que desenvolvem as línguas e as literacias transversais, metodologias centradas no pensamento, dinâmicas culturais e interculturais, e Aprendizagem Integrada de Conteúdos e Línguas (AICL). Pretende-se, desta forma, desenvolver profissionais reflexivos que investigam e melhoram continuamente a sua prática à luz das necessidades dos seus alunos e da mudança educacional e social.",
        "outings": "Qualificação profissional para a docência (grupo de recrutamento 120)",
        "typeOfCourse": "Mestrado",
        "duration": "3 Semestres / 90 ECTS"
    },
    {
        "id": 176,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=9121",
        "name": "Mestrado em Ensino de Português e de Língua Estrangeira no 3º Ciclo do Ensino Básico e no Ensino Secundário nas áreas de especialização de Alemão ou Espanhol ou Francês ou Inglês ",
        "description": "O Mestrado em Ensino de Português e de Língua Estrangeira no 3º Ciclo do Ensino Básico e no Ensino Secundário nas áreas de especialização de Alemão ou Espanhol ou Francês ou Inglês visa a habilitação profissional dos estudantes para o ensino do português e da língua da área de especialização. Para tal, favorece a aquisição de competências científicas, pedagógicas e humanas, nas quatro áreas formativas (didática, educação, formação de professores e línguas), necessárias ao exercício da função docente, tendo em conta as transformações da sociedade, da educação e da evolução científica e tecnológica.",
        "outings": "Docência no ensino público, Docência no ensino privado, Consultoria linguística, Serviços linguísticos.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 177,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=9102",
        "name": "Mestrado em Ensino de Português no 3º Ciclo do Ensino Básico e no Ensino Secundário ",
        "description": "O Mestrado em Ensino de Português no 3º Ciclo do Ensino Básico e no Ensino Secundário da FLUP forma professores de Português Língua Materna num ambiente de permanente incentivo à investigação e de envolvimento dos estudantes em atividades das escolas, a partir do início. O curso acolhe 20 estudantes por ano, o que se traduz num ambiente familiar e de colaboração entre todos.",
        "outings": "Habilitações para a docência no grupo de recrutamento 300 do Ministério da Educação, Trabalho em editoras escolares",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 178,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=9084",
        "name": "Mestrado em Ensino do Inglês e de Língua Estrangeira no 3º Ciclo do Ensino Básico e no Ensino Secundário, nas áreas de especialização de Alemão ou Espanhol ou Francês ",
        "description": "O Mestrado em Ensino do Inglês e de Língua Estrangeira no 3º Ciclo do Ensino Básico e no Ensino Secundário da FLUP habilita os estudantes para o ensino do inglês e da língua da área da especialização. Para tal, favorece a aquisição de competências científicas, pedagógicas e humanas, nas quatro áreas formativas (didática, educação, formação de professores e línguas), necessárias ao exercício da função docente, tendo em conta as transformações da sociedade, da educação e da evolução científica e tecnológica.",
        "outings": "Docência no ensino público, Docência no ensino privado, Consultoria linguística, Serviços linguísticos.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 179,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=10961",
        "name": "Mestrado em Estudos Africanos ",
        "description": "O 2º Ciclo Estudos em Estudos Africanos integra-se no projeto científico, educativo e de extensão cultural da Universidade do Porto. Internacionalização, interdisciplinaridade, cooperação, desenvolvimento e transferência de conhecimento são palavras-chave que definem o seu plano de estudos. A possibilidade oferecida pelo MAF aos seus estudantes de poderem desenvolver, para além de uma dissertação académica, um projeto ou um estágio em organizações governamentais ou não governamentais, ligadas à sociedade, cultura ou tecido empresarial, em tudo corresponde a esta prioridade. O plano de estudos beneficia da participação da Universidade do Porto em redes de investigação e de cooperação internacionais.",
        "outings": "Comunidade dos Países de Língua Portuguesa (CPLP), Fundações, Organismos governamentais, Organizações não-governamentais (ONGs), designadamente as vocacionadas para a Cooperação e Desenvolvimento, Instituições da CE (Comissão, Conselho, Parlamento Europeu, entre outras), Organizações intergovernamentais (ONU, UNESCO, entre outras).",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 180,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=21921",
        "name": "Mestrado em Estudos Africanos - Mestrado Europeu Interdisciplinar ",
        "description": "Resultado da colaboração entre a U.Porto (através da FLUP), a Universidade de Bayreuth (Alemanha) e a Universidade Bordeaux Montaigne (França), o Mestrado em Estudos Africanos - Mestrado Europeu Interdisciplinar (EIMAS) é um programa de interface entre as humanidades, os estudos culturais e as ciências sociais, que procura colmatar lacunas existentes nas diversas disciplinas que compõem esta área de estudos. Assente na vasta experiência das três instituições parceiras e numa efetiva aprendizagem em direto contacto com a realidade africana, o curso pretende contribuir para a emergência de uma nova geração de especialistas em Estudos Africanos, respondendo a novas exigências vindas da academia, de OGs, ONGs e do setor privado.",
        "outings": "Setores público e privado, onde o conhecimento de ponta em África é urgente para gerar impacto sustentável.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 181,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=20341",
        "name": "Mestrado em Estudos Alemães ",
        "description": "O Mestrado em Estudos Alemães (MEA) da FLUP visa a formação de profissionais da área e especialistas de gestão de património cultural e literário no contexto dos Estudos Alemães, e futuros docentes de alemão como língua alemã estrangeira. O curso inclui uma via internacional de titulação conjunta, lecionada na U.Porto, no Luxemburgo, em Mainz (Alemanha) e em Palermo (Itália).",
        "outings": "Trabalho em empresas alemãs em Portugal e no estrangeiro, entre outras as dedicadas à tradução e à gestão e tutela do património cultural e literário alemão, como, por ex., associações, editoras, museus, e outras instâncias culturais, Docência no ensino não oficial de alemão língua estrangeira, em Portugal e no estrangeiro.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 182,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=193",
        "name": "Mestrado em Estudos Anglo-Americanos ",
        "description": "Integralmente lecionado em língua inglesa, o Mestrado em Estudos Anglo-Americanos (MEAA) proporciona uma formação em Humanidades, centrada nas culturas e literaturas da língua inglesa. A gama disciplinar do curso compreende os estudos literários e culturais, com contributos da teoria da literatura, dos estudos comparatistas, da tradução e da intermedialidade.",
        "outings": "Investigação, Tradução literária, Trabalho editorial, Assessoria cultural",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 183,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=433",
        "name": "Mestrado em Estudos Literários, Culturais e Interartes ",
        "description": "O Mestrado em Estudos Literários, Culturais e Interartes da FLUP propõe o estudo avançado do discurso literário, privilegiando perspetivas de carácter intercultural e interartístico. Estruturado em dois ramos de conhecimento - Estudos Literários e Culturais e Estudos Comparatistas -, o curso oferece uma grande diversidade de perspetivas especializadas, que o/a estudante pode adotar a seu gosto segundo várias modalidades e combinações curriculares.",
        "outings": "Mediação e dinamização cultural, Atividade editorial, Prossecução de estudos de 3º ciclo no campo da programação cultural, ou outros, Investigação científica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 184,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=546",
        "name": "Mestrado em Estudos Medievais ",
        "description": "O ciclo de estudos organiza-se pelo sistema de créditos europeu (European Credit Transfer and Accumulation System - ECTS).Para a obtenção do grau de Mestre o estudante deve perfazer um total de 120 créditos ECTS.O primeiro ano do ciclo de estudos, dividido em dois semestres, constitui o Curso de Mestrado (não conferente de grau) em Estudos Medievais, correspondendo a 60 créditos ECTS, cuja conclusão é indispensável para a transição para o 2º ano.O segundo ano do ciclo de estudos é composto por um seminário de orientação e por uma dissertação, projeto ou estágio, correspondentes a 60 créditos ECTS.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 185,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=430",
        "name": "Mestrado em Filosofia ",
        "description": "O Mestrado em Filosofia da FLUP proporciona um contexto para a análise e discussão de muitos problemas, acerca dos quais já pensamos ou conversamos com os nossos amigos. Esses problemas - uns muito antigos, outros completamente atuais - envolvem aspetos fundamentais da vida humana que se trata, agora, de compreender filosoficamente. O curso contempla quatro áreas de especialização: Ética e Filosofia Política, Filosofia da Educação, Filosofia Medieval e Filosofia Contemporânea.",
        "outings": "Investigação científica, Ensino (com a conclusão da formação profissionalizante num Mestrado em Ensino da Filosofia), Formação, promoção e dinamização cultural, Assessoria empresarial, comunicacional e política, Serviço diplomático, Atividade editorial.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 186,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=25521",
        "name": "Mestrado em Filosofia, Política e Economia ",
        "description": "",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "3 Semestres / 90 ECTS"
    },
    {
        "id": 187,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=438",
        "name": "Mestrado em História Contemporânea ",
        "description": "O Mestrado em História Contemporânea visa um aprofundamento de problemáticas de História de Portugal (desde o século XIX até ao presente), de História Internacional e comparativa, bem como de metodologias específicas de investigação.",
        "outings": "Organismos da administração pública e organismos internacionais, Entidades privadas (empresas, fundações, centros de documentação e investigação, etc.), Comunicação social, Indústrias culturais, Turismo, Investigação científica, Coordenação de edições de História Contemporânea, Docência/Formação.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 209,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=22221",
        "name": "Mestrado em Metabolismo - biopatologia e experimentação ",
        "description": "O ciclo de estudos tem uma duração de 4 semestres, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular com 60 ECTS e pela elaboração de uma dissertação com 60 créditos ECTS associados.",
        "outings": "Investigação científica, Empreendedorismo científico, Técnico de laboratório, Gestão científica, Organização de de eventos científicos.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 188,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=11162",
        "name": "Mestrado em História da Arte, Património e Cultura Visual ",
        "description": "O Mestrado em História da Arte, Património e Cultural Visual da FLUP garante uma formação avançada no âmbito da história da arte, património e cultura visual, orientada para a preparação de profissionais com um sólido conhecimento nestas valências de aprendizagem. Ao longo do curso, os estudantes adquirem competências para intervir na valorização, difusão e fruição das diversas manifestações artísticas, bem como para a promoção do seu conhecimento.",
        "outings": "Investigação científica, Mediação cultural e patrimonial, Produção cultural e patrimonial, Dinamização cultural e patrimonial, Criação de conteúdos culturais e patrimoniais, Consultoria artística e patrimonial, Atividade editorial no campo da história da arte, do património e da cultura visual, Integração em equipas interdisciplinares de comunicação cultural e digital, Curadoria",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 189,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=464",
        "name": "Mestrado em História e Património ",
        "description": "O Mestrado em História e Património oferece 3 áreas de especialização ligadas ao património natural, documental, iconográfico, edificado, arqueológico, rural, marítimo, industrial: Construção de Memórias (nível local e regional), Arquivos com fundos históricos, Mediação Patrimonial. Pretende dotar os estudantes das competências imprescindíveis à identificação, inventariação, divulgação, preservação do património, a uma intervenção crítica e científica em áreas da animação cultural e do turismo cultural e histórico, a uma gestão integrada e pluridisciplinar do património local, em ordem a potenciar a sua preservação e fruição pela comunidade.",
        "outings": "Investigação científica, Mediação Patrimonial, Animação Cultural, Gestão Integrada do Património, Turismo Cultural, Organização e Descrição dos fundos históricos de Arquivos, Reconhecimento para progressão na Carreira Docente nos grupos 200 (2º ciclo ensino básico) e 400 (3ºciclo ensino básico e do secundário)",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 190,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=435",
        "name": "Mestrado em História, Relações Internacionais e Cooperação ",
        "description": "O Mestrado em História, Relações Internacionais e Cooperação (MHRIC) da FLUP visa habilitar os estudantes com uma forte formação teórica e metodológica orientada para o desenvolvimento e concretização de projetos de investigação e/ou de prática profissional contextualizada nas especializações em Relações Internacionais e Cooperação e em Estudos Políticos. A oferta curricular do MHRIC é assumidamente multidisciplinar, por forma a adequar-se aos interesses formativos de cada estudante.",
        "outings": "Fundações, Organismos da administração pública, Organizações governamentais, intergovernamentais e não-governamentais, Comunidade dos Países de Língua Portuguesa, Instituições europeias, Projetos de cooperação internacional",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 191,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=9141",
        "name": "Mestrado em Linguística ",
        "description": "",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 192,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=64",
        "name": "Mestrado em Museologia ",
        "description": "O Mestrado em Museologia da FLUP oferece um programa de ensino e investigação num ambiente cientificamente inclusivo e de índole interdisciplinar.Suportando-se em competências digitais, transversais e transferíveis, aposta num equilíbrio entre a teoria, a sua aplicação prática e a experimentação inovadora, no sentido de gerar e enfrentar novos desafios e de resolver, crítica e criativamente, problemas, para o desenvolvimento integrado dos museus",
        "outings": "Investigação científica e formação, Projeto museológico, Gestão de coleções, Conservação preventiva, Gestão integrada de riscos, Planeamento e gestão de reservas, Serviços educativos, Planeamento interpretativo e produção de conteúdos, Curadoria, organização e produção de exposições, Programação e gestão cultural, Gestão de estratégia digital, Gestão de acessibilidades, Avaliação de serviços e programação.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 193,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=449",
        "name": "Mestrado em Português Língua Segunda/ Língua Estrangeira ",
        "description": "O Mestrado em Português Língua Segunda/Língua Estrangeira (MPLE) da FLUP é a formação profissionalizante ideal para quem pretende lecionar aulas de Português Língua Não Materna, ou trabalhar noutras tarefas deste âmbito. É um Mestrado fortemente internacional, quanto à origem dos estudantes, às hipóteses de estágio, à mobilidade dos docentes e discentes, e às saídas profissionais. Encara o Português como uma língua pluricêntrica. O incentivo à investigação, bem como os bons níveis de empregabilidade, são pontos fortes deste Mestrado.",
        "outings": "Docência de Português Língua Não Materna, Trabalho em leitorados e centros de língua, Trabalho em editoras escolares",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 194,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=462",
        "name": "Mestrado em Riscos, Cidades e Ordenamento do Território ",
        "description": "O Mestrado em Riscos, Cidades e Ordenamento do Território da FLUP tem como objetivo contribuir para o conhecimento sistémico e integrado das problemáticas multidisciplinares associadas aos riscos, às cidades e ao ordenamento do território. Durante o curso, são trabalhadas competências essenciais para a aplicação dos conhecimentos a contextos de investigação e de apoio à decisão, assim como competências de autoaprendizagem que propiciem a autonomia necessária para conceber, projetar, adaptar e realizar novos projetos no domínio das políticas urbanas e da prevenção de riscos.",
        "outings": "Organismos da administração central, regional e local, Empresas e associações de urbanismo, planeamento e ordenamento do território, Instituições de ensino e investigação científica",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 195,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=461",
        "name": "Mestrado em Sistemas de Informação Geográfica e Ordenamento de Território ",
        "description": "O Mestrado em Sistemas de Informação Geográfica e Ordenamento do Território da FLUP forma profissionais competentes no domínio dos SIG e na sua aplicação às problemáticas do Planeamento e Ordenamento do Território. Os diplomados ficam habilitados para o desempenho técnico-científico em ramos tão diversos como: ambiente, transportes, abastecimento de água e tratamento de resíduos, agricultura, riscos e proteção civil, entre outros.",
        "outings": "Empresas de Planeamento e Ordenamento do Território, Empresas de base tecnológica, Empresas de consultoria, Investigação científica, Câmaras municipais, Comunidades Intermunicipais, Órgãos, direções e institutos da Administração Central.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 196,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=429",
        "name": "Mestrado em Sociologia ",
        "description": "O Mestrado em Sociologia visa a atualização, o aprofundamento e a especialização de conhecimentos científicos na área disciplinar da Sociologia. O objetivo é formar a preparar sociólogos, na qualidade de técnicos, de especialistas, de quadros, de investigadores, de docentes, com uma elevada e sustentada formação científica para o exercício profissional qualificado.",
        "outings": "Empresas e organizações, Autarquias e instituições de desenvolvimento local e regional, Projetos sociais e culturais, Instituições da área da cultura, património e comunicação, Administração pública, Instituições de solidariedade social, ONG(D)s, redes sociais e de desenvolvimento, Ensino e investigação.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 197,
        "url": "https://sigarra.up.pt/flup/pt/cur_geral.cur_view?pv_curso_id=437",
        "name": "Mestrado em Tradução e Serviços Linguísticos ",
        "description": "O Mestrado em Tradução e Serviços Linguísticos visa o aprofundamento dos conhecimentos de tradução, oferecendo a possibilidade de especialização em áreas como terminologia, localização, tradução jurídica, tradução económico-financeira e interpretação para fins comunitários. Integrado na rede EMT - European Master's in Translation desde 2009, o curso garante aos estudantes vantagens na obtenção de estágios nas instituições europeias e em empresas internacionais.",
        "outings": "Tradução profissional e especializada, Localização, Revisão e pós-edição, Tradução audiovisual, Comunicação técnica, Interpretação de acompanhamento, Produção de conteúdos",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 198,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=28041",
        "name": "Mestrado em Bioética ",
        "description": "Este Mestrado recebe o contributo das diversas ciências que sustentam a produção de conhecimento e a atuação naárea científica das ciências da saúde e de outras áreas da ética, da saúde e da sociedade, tendo como objetivo a formação pós-graduada de indivíduos que desempenham ou pretendem desempenhar funções em diferentes contextos de bioética a nível clínico, na investigação ou participação em Comissões de Ética.",
        "outings": "adquirir competências em investigação e prática em bioética",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 199,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1137",
        "name": "Mestrado em Ciências Forenses       Não estão abertas candidaturas.  ",
        "description": "O ciclo de estudos tem uma duração de 2 anos, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular com créditos 60 ECTS e por uma componente de investigação com 60 créditos ECTS associados.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 200,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1139",
        "name": "Mestrado em Cirurgia Ortognática e Ortodontia ",
        "description": "O ciclo de estudos tem uma duração de 4 semestres, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular e pelo desenvolvimento de uma dissertação e um estágio profissional.",
        "outings": "Especialização em Cirurgia Ortognática,Especialização em Ortodontia.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 201,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1158",
        "name": "Mestrado em Comunicação Clínica ",
        "description": "O ciclo de estudos tem uma duração de 4 semestres, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular com 60 ECTS e pela elaboração de uma dissertação com 60 créditos ECTS associados.",
        "outings": "Prática clínica, Investigação científica",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 202,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=19361",
        "name": "Mestrado em Cuidados de Saúde Primários ",
        "description": "Criado na sequência da reforma dos Cuidados de Saúde Primários em Portugal, o Mestrado em Cuidados de Saúde Primários da FMUP procura responder à necessidade de robustecer a quantidade ea qualidade da investigação desenvolvida no âmbito desta área. Para além de desenvolverem competências direcionadas à implementação das metodologias apropriadas de investigação específicas dos Cuidados de Saúde Primários e da Medicina Geral e Familiar, os estudantes têm a oportunidade de desenvolver aptidões, experiência e conhecimento nas áreas mais inovadoras dos Cuidados de Saúde Primários.",
        "outings": "Prática Clinica, Investigação",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 203,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1171",
        "name": "Mestrado em Cuidados Paliativos ",
        "description": "O ciclo de estudos tem uma duração de 4 semestres, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular com 60 ECTS e pela elaboração de uma dissertação com 60 créditos ECTS associados.",
        "outings": "Exercício profissional na área da medicina, enfermagem e nas outras áreas da saúde, com especial enfoque na área dos cuidados paliativos.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 204,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=11721",
        "name": "Mestrado em Educação Académica e Clínica ",
        "description": "O ciclo de estudos tem uma duração de 4 semestres, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular com 60 ECTS e pela elaboração de uma dissertação com 57 créditos ECTS associados.",
        "outings": "Pedagogia, Comunicação, Metodologias de Investigação, Pensamento Crítico, Profissionalismo, Integridade Académica, Supervisão, Educação Interprofissional",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 205,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1170",
        "name": "Mestrado em Educação para a Saúde ",
        "description": "O ciclo de estudos tem uma duração de 4 semestres, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular com 60 ECTS e pela elaboração de uma dissertação com 60 créditos ECTS associados.",
        "outings": "Este programa oferece oportunidades para o desenvolvimento de competências científicas que contribuirão para atividades relevantes em educação para a saúde em diferentes contextos profissionais.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 206,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1117",
        "name": "Mestrado em Evidência e Decisão em Saúde ",
        "description": "O ciclo de estudos tem uma duração de 4 semestres, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular com 60 ECTS e pela elaboração de uma dissertação com 54 créditos ECTS associados.",
        "outings": "valiação de Tecnologias em Saúde, Investigação em Serviços de Saúde, Investigação Clínica.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 207,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1118",
        "name": "Mestrado em Informática Médica ",
        "description": "A Informática Médica (IM) estuda os aspetos teóricos das ciências da informação, específicos à compreensão dos dados, informação e conhecimento biomédicos e a aplicação prática das tecnologias de informação em sistemas de saúde, tendo com objectivo o aumento da segurança, efetividade, eficiência, equidade e disponibilidade da prestação de cuidados.Neste contexto, o Mestrado em IM visa a preparação dos estudantes para o desempenho de funções como gestores ou consultores de sistemas de informação em Saúde, gestores de projeto de Sistemas de Informação em Saúde ou investigadores na área da In­formática para a saúde, nomeadamente em sistemas de apoio à decisão, e-Health, processamento de sinal e imagem médica e em segurança informática, entre outras.",
        "outings": "Empresas de aplicação informática para a Saúde, Hospitais, clínicas, centros de saúde e outras unidades de saúde, Regiões e sub-regiões de saúde, Instituições de en­sino superior, Centros de investigação e desenvolvimento, Empresas de equipamento e instrumentação médica e outras empresas ligadas à área da Saúde.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 208,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1140",
        "name": "Mestrado em Medicina e Oncologia Moleculares ",
        "description": "O Mestrado em Medicina e Oncologia Molecular visa habilitar os estudantes a carreiras de elevada qualidade nas Ciências da Vida. Para além de uma componente letiva focada em tópicos como Biologia Molecular, Ciclo Celular, Genética Humana, Oncobiologia, Farmacogenómica, Epigenética, o curso oferece ainda aos estudantes a possibilidade de desenvolver o exercício prático-laboratorial - «hands on» - sob a coordenação de docentes e investigadores reconhecidos.",
        "outings": "Carreira científica, Técnico em laboratório clínico ou de investigação, Ensino científico",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 90 ECTS"
    },
    {
        "id": 210,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=9201",
        "name": "Mestrado em Neurobiologia ",
        "description": "O Mestrado em Neurobiologia, que iremos designar pela sigla MeN, estende-se por 4 semestres (120 créditos), e concentra a componente curricular nos dois primeiros semestres, ficando os dois últimos completamente dedicados à preparação da dissertação de mestrado. A componente curricular é constituída por três grandes grupos de unidades curriculares: No primeiro semestre os estudantes recebem formação sobre os fundamentos da neurobiologia, ao longo de 5 unidades curriculares de 6 créditos cada, que tratam da (i) estrutura molecular das células que compõe o sistema nervoso, (ii) estrutura anatómica do sistema nervoso e seu desenvolvimento embrionário, (iii) princípios que governam as propriedades de excitabilidade, condução e transmissão sináptica dos neurónios e respetivos mecanismos de regulação, (iv) processos subjacentes à plasticidade do sistema nervoso e funções cognitivas e (v) mecanismos subjacentes ao envelhecimento e à instalação de algumas patologias do sistema nervoso. No segundo semestre o estudante é inteirado sobre as principais abordagens técnicas usadas no estudo do sistema nervoso em mais 4 unidades curriculares de 6 créditos, dedicadas à (i) caracterização estrutural, fisiológica e neuroquímica de circuitos neuroniais, (ii) produção e validação de modelos animais de doença do sistema nervoso, (iii) instrumentos e métodos para visualização do sistema nervoso e metodologias de análise de imagem e (iv) ferramentas informáticas para estudo do sistema nervoso. Ainda no segundo semestre o estudante, tutorizado pelo seu orientador, deve redigir o projeto de investigação científica a desenvolver no âmbito da dissertação de mestrado e apresentá-lo publicamente perante um júri que procederá à sua avaliação. Os dois últimos semestres são inteiramente dedicados à preparação da dissertação, para o que o estudante conta com o acompanhamento estreito de um orientador especializado no tema selecionado e o acompanhamento da direção do programa.",
        "outings": "Investigação científica, Docência, Técnico de laboratório, Gestão de projeto, Organização de eventos científicos, Comunicação em Ciência",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 211,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=1136",
        "name": "Mestrado em Saúde Pública ",
        "description": "O ciclo de estudos tem uma duração de 4 semestres, correspondente a 120 créditos ECTS, sendo constituído por uma parte curricular com 60 ECTS e pela elaboração de uma dissertação com 60 créditos ECTS associados.",
        "outings": "Este programa não tem caracter profissionalizante, no entanto, oferece oportunidades para os estudantes desenvolverem as suas competências científicas, que contribuirão para a prática profissional em saúde pública.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 212,
        "url": "https://sigarra.up.pt/fmup/pt/cur_geral.cur_view?pv_curso_id=19341",
        "name": "Mestrado em Psiquiatria e Psicoterapia e Psicodinâmica ",
        "description": "O ciclo de estudos é constituído por: a) Um curso de mestrado, não conferente de grau, constituído por um conjunto organizado de unidades curriculares, modulares, a que correspondem 60 créditos ECTS. Cada módulo deste curso de mestrado, avaliado de modo independente, tem em vista a aplicação da teoria psicodinâmica à prática psiquiátrica (semiologia, avaliação, diagnóstico e intervenção) e psicoterapêutica, bem como à investigação na área da saúde mental. A conclusão, com sucesso, de todos os módulos confere um diploma de curso de mestrado, não conferente de grau, em Psiquiatria e Psicoterapia Psicodinâmica. b) Uma unidade curricular de Preparação de Dissertação que corresponde a 3 ECTS, a decorrer no 2º ano. c) Uma dissertação de natureza científica, original e especialmente realizada para esse fim, a que correspondem 57 do total dos 120 ECTS do ciclo de estudos, cuja defesa em provas públicas permitirá a obtenção do grau de Mestre em Psiquiatria e Psicoterapia Psicodinâmica.",
        "outings": "Prática clínica nas áreas da Psiquiatria e da Psiquiatria da Infância e da Adolescência, Carreira científica, Ensino Clínico",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 213,
        "url": "https://sigarra.up.pt/fmdup/pt/cur_geral.cur_view?pv_curso_id=1215",
        "name": "Mestrado em Reabilitação Oral ",
        "description": "O Mestrado em Reabilitação Oral confere 120 créditos ECTS e tem a duração normal de quatro semestres curriculares de trabalho dos estudantes. Integra as seguintes componentes de realização obrigatória:a) Um curso de especialização, constituído por um conjunto organizado de unidades curriculares, denominado curso de mestrado (não conferente de grau), a que corresponde 60 créditos ECTS do ciclo de estudos, a realizar no primeiro ano,b) Uma unidade curricular prática, a que corresponde 9 créditos ECTS do ciclo de estudos, a realizar no primeiro semestre do segundo ano,c) Uma dissertação de natureza científica, original e especialmente realizada para este fim, ou um estágio de natureza profissional objeto de relatório final, a que corresponde 51 créditos ECTS do ciclo de estudos, a realizar no segundo ano.",
        "outings": "Exercício da Medicina Dentária na área da Reabilitação Oral",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 214,
        "url": "https://sigarra.up.pt/fpceup/pt/cur_geral.cur_view?pv_curso_id=815",
        "name": "Mestrado em Ciências da Educação ",
        "description": "Apoiado na forte tradição das Ciências da Educação na FPCEUP, o Mestrado em Ciências da Educação (MCED) valoriza uma lógica integrada, de rigor e inovação, na investigação e intervenção nas realidades socioeducativas, através de aprendizagens adequadas às transformações da educação e às exigências de empregabilidade. Este ciclo de estudos dirige-se a estudantes e profissionais das Ciências da Educação e outras áreas que valorizam o conhecimento e a reflexão sobre modos de intervir no campo social, cultural e económico e onde as dimensões educativa e formativa sejam determinantes.",
        "outings": "Agências de Desenvolvimento Local, Associações Culturais, Recreativas e Desportivas, Câmaras Municipais, Casas de Juventude, Centros de Educação e Formação de Adultos, Centros Sociais, Comissões de Proteção de Crianças e Jovens, Departamentos de Educação para a Saúde, Agrupamentos de Escolas, Escolas não Agrupadas e Escolas de Segunda Oportunidade, Instituições de Proteção Social, Lares de Infância e Juventude, Serviços Educativos para a Infância, Juventude e 3.ª Idade.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 215,
        "url": "https://sigarra.up.pt/fpceup/pt/cur_geral.cur_view?pv_curso_id=821",
        "name": "Mestrado em Educação e Formação de Adultos ",
        "description": "O Mestrado em Educação e Formação de Adultos (MEFA) visa o desenvolvimento de competências e conhecimentos especializados ação/intervenção neste domínio, através da conceção, implementação, gestão e avaliação de projetos de aprendizagem ao longo da vida dirigidos a adultos, nomeadamente no contexto da comunidade e no âmbito da oferta educativa e de formação profissional, incluindo a validação das aprendizagens experienciais. Prepara ainda para a coordenação de equipas pluriprofissionais atuando nestes contextos e intervenções e para a investigação no domínio da educação de adultos e da aprendizagem e orientação ao longo da vida.",
        "outings": "Formação e Orientação Profissional, Alfabetização, Animação Sociocultural, Aprendizagem e Orientação ao Longo da Vida, Intervenção Social e Comunitária, Ensino de Educação de Adultos, Centros de Emprego e Centros de Formação Profissional, Sindicatos e Organizações Profissionais e Empresariais e Câmaras de Comércio e Indústria, Educação e Formação de Adultos (EFA), Educação de Jovens e Adultos em contexto brasileiro (EJA), Organizações da Sociedade Civil, ONG, Consultoria e Intervenção, Consultoria para Entidades Públicas no âmbito da Formulação e Apoio à Tomada de Decisão de Políticas Públicas Centrais ou Locais no Campo da EFA.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 216,
        "url": "https://sigarra.up.pt/fpceup/pt/cur_geral.cur_view?pv_curso_id=820",
        "name": "Mestrado em Ensino de Artes Visuais no 3º. Ciclo do Ensino Básico e no Ensino Secundário ",
        "description": "Organizado pela Faculdade de Psicologia e de Ciências da Educação (FPCEUP) e pela Faculdade de Belas Artes (FBAUP) da Universidade do Porto o Mestrado em Ensino de Artes Visuais no 3º ciclo do Ensino Básico e no Ensino Secundário (MEAV) constitui-se num projeto de formação académica e profissionalizante de professores em artes visuais, articulando conhecimentos e competências de natureza científica e pedagógica capazes de responder aos desafios que se colocam à educação artística. Ao longo do ciclo de estudos, a formação na área da docência, a prática de ensino supervisionada e a investigação em artes visuais pretendem contribuir para a discussão crítica dos problemas que afetam a escola e a ação dos/as professores/as, através de metodologias inovadoras de ensino e aprendizagem, em estreita relação com o campo epistemológico da educação artística.",
        "outings": "Ensino das disciplinas do grupo de recrutamento 600, no 3.º ciclo do ensino básico e no ensino secundário.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 217,
        "url": "https://sigarra.up.pt/fpceup/pt/cur_geral.cur_view?pv_curso_id=22601",
        "name": "Mestrado em Psicologia ",
        "description": "O Mestrado em Psicologia (MPSI) visa qualificar profissionais de Psicologia, capacitando-os/as com conhecimentos e aptidões especializadas e atitudes adequadas ao desempenho da atividade de psicólogo/a em contextos de trabalho e investigação complexos e imprevisíveis. A formação direciona-se para quatro áreas de especialização em que o/a estudante adquirirá conhecimentos e competências nucleares e aprofundará modelos conceptuais e técnicas de intervenção específicas, a saber: Psicologia Clínica e da Saúde, Psicologia da Educação e Desenvolvimento Humano, Psicologia das Organizações, Social e do Trabalho, Psicologia da Justiça e da Desviância.",
        "outings": "Escolas e Agrupamentos Escolares, Creches, Jardins de Infância e Centros ATL, Hospitais Públicos e Privados, Serviços Públicos das Áreas da Saúde, Justiça e Segurança Social, Centros de Saúde, de Reabilitação e de Consulta Psicológica, Centros de Emprego, de Formação e de Qualificação, Centros e Projetos Comunitários de Organizações Públicas e Privadas (Juntas de Freguesia, Câmaras Municipais, IPSS, ONG, ...), Consultoras, Empresas (Banca, Seguros, Indústria, Serviços, Transportes, Comércio, Distribuição, Telecomunicações, ...), Centros e Laboratórios de Investigação.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 218,
        "url": "https://sigarra.up.pt/fpceup/pt/cur_geral.cur_view?pv_curso_id=27501",
        "name": "Mestrado em Sexologia       Não estão abertas candidaturas.  ",
        "description": "O Mestrado em Sexologia é único no contexto do ensino superior público em Portugal e tem por objetivo promover competências teórico-práticas no domínio da sexologia, com foco nos contextos de intervenção clínica e social. Pretende-se que os/as estudantes adquiram conhecimentos baseados na evidência acerca da conceptualização da resposta sexual humana, dos fundamentos da intervenção junto de diferentes problemáticas clínicas (e.g., disfunções sexuais, saúde sexual e reprodutiva) e sociais (e.g., violência sexual) e na promoção de respostas a questões de relevância social (e.g., direitos sexuais, educação sexual). O mestrado apresenta uma perspetiva multi e interdisciplinar com o contributo de áreas científicas como a Psicologia, a Medicina e Ciências da Saúde, as Ciências da Educação e as Ciências Sociais.O mestrado funciona em regime presencial, com 30% de parte das suas UC com recursos e-learning permitindo colaboração a distância de especialistas internacionais.",
        "outings": "Projetos de Intervenção Educativa e Comunitária, Direitos Sexuais e Diversidade de Género, Prestação de Serviços na Área da Sexologia Clínica, Saúde Sexual e Reprodutiva, ou da Medicina Sexual, Integração em Quadros de ONG",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 219,
        "url": "https://sigarra.up.pt/fpceup/pt/cur_geral.cur_view?pv_curso_id=822",
        "name": "Mestrado em Temas de Psicologia ",
        "description": "O Mestrado em Temas de Psicologia (MTP) da FPCEUP visa a qualificação de profissionais com formação em múltiplas áreas, dotando-os/as de conhecimentos aprofundados em temas de Psicologia, que enriquecerão as suas práticas quotidianas e o seu desempenho profissional. Entre os temas abordados incluem-se: Neurocognição e Linguagem, Psicologia do Comportamento Desviante e da Justiça, Psicologia do Desenvolvimento e Educação da Criança: Proteção e Direitos da Criança, e Reabilitação Psicossocial e Saúde Mental. Este ciclo de estudos não possibilita o exercício da profissão como psicólogo/a e não dá acesso à Ordem dos Psicólogos Portugueses (OPP).",
        "outings": "Atividade em Serviços de Saúde Mental e Ocupacional (terapeutas da fala, terapeutas ocupacionais, fisioterapeutas, enfermeiros e outros profissionais da área da saúde), Atividade em Projetos de Natureza Social e Comunitária (educadores de infância, docentes, assistentes sociais, técnicos de Intervenção Social e Comunitária), Atividade em Organizações Privadas, Públicas e Não-Governamentais ligadas aos Direitos das Criança e da Pessoa com Incapacidade (educadores sociais, assistentes sociais, profissionais da área da saúde e da justiça).",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 220,
        "url": "https://sigarra.up.pt/icbas/pt/cur_geral.cur_view?pv_curso_id=13921",
        "name": "Mestrado em Aconselhamento Genético ",
        "description": "O Mestrado em Aconselhamento Genético (MAG) constitui o meio de acesso à nova profissão de aconselhador genético. O objetivo principal do curso é formar profissionais especializados em aconselhamento genético, que venham a integrar as equipas clínicas multidisciplinares dos Serviços de Genética Médica hospitalares. No final, os diplomados deverão ser capazes de proceder, de modo independente, ao aconselhamento genético das situações mais frequentes, fornecendo aos consultandos a informação necessária para facilitar o seu processo de tomada de decisões e fazer livremente as suas próprias escolhas.",
        "outings": "",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 221,
        "url": "https://sigarra.up.pt/icbas/pt/cur_geral.cur_view?pv_curso_id=1301",
        "name": "Mestrado em Ciências do Mar - Recursos Marinhos ",
        "description": "O Mestrado Ciências do Mar - Recursos Marinhos visa a formação avançada de profissionais capazes de intervir na investigação e gestão do mar e das zonas costeiras, no desenvolvimento sustentado da aquacultura e pescas, e na criação de valor acrescentado de recursos e serviços de ecossistemas marinhos. Com um pendor eminentemente prático, o curso orienta-se para o estudo da biota que habita os oceanos e as zonas costeiras, encarando-os como parte de um ambiente dinâmico, a preservar, e como recursos naturais limitados, cuja exploração é intensa, complexa, requerendo indivíduos qualificados.",
        "outings": "Docência e Investigação, Educação Ambiental, Economia Azul e Economia do Mar, Aquacultura, Gestão de Recursos Marinhos, Indústria Alimentar, Mercado de Espécies Ornamentais,Serviços de Controlo de Qualidade",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 222,
        "url": "https://sigarra.up.pt/icbas/pt/cur_geral.cur_view?pv_curso_id=1302",
        "name": "Mestrado em Medicina Legal ",
        "description": "O Mestrado em Medicina Legal tem como principal objetivo a formação e promoção da investigação científica na área da Medicina Legal como uma das ciências básicas das ciências forenses. Para além da obtenção de competências específicas em diferentes campos do saber (patologia, toxicologia, psiquiatria, antropologia e biologia forenses, direito médico, clínica médico-legal penal, cível e do trabalho, etc), o curso proporciona ainda o acesso a metodologias de investigação e respetiva adequação à medicina legal, juntamente com o contacto com os aspetos da investigação criminal na área da medicina.",
        "outings": "Qualificação e enriquecimento profissional para profissionais das áreas da Saúde, Direito, Justiça, Investigação Criminal e Psicologia.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 223,
        "url": "https://sigarra.up.pt/icbas/pt/cur_geral.cur_view?pv_curso_id=1303",
        "name": "Mestrado em Oncologia ",
        "description": "O Mestrado em Oncologia destina-se sobretudo a jovens licenciados nas áreas das ciências biológicas e da saúde interessados em obter formação sólida nos fundamentos da Oncologia, com forte incidência nas áreas da biologia, (epi)genética e patologia, abordando as dimensões epidemiológica, clínica e terapêutica do Cancro, à luz dos conhecimentos mais atuais. O curso pretende, ainda, dotar os estudantes dos conhecimentos, competências e aptidões necessárias ao desenvolvimento de atividade de investigação em Oncologia (nomeadamente métodos de bioestatística), potenciada pelo contacto privilegiado com os contextos laboratorial e clínico.",
        "outings": "Investigação básica, de translação e clínica em Oncologia.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    },
    {
        "id": 224,
        "url": "https://sigarra.up.pt/icbas/pt/cur_geral.cur_view?pv_curso_id=21901",
        "name": "Mestrado em Toxicologia e Contaminação Ambientais ",
        "description": "Oferecido pelao ICBAS e pela FCUP, em parceria com dois centros de investigação de excelência sediados na U.Porto - o CIIMAR e o i3S , o Mestrado em Contaminação e Toxicologia Ambientais da U.Porto oferece formação científica e tecnológica para responder aos grandes desafios ambientais a nível global, principalmente os resultantes das mudanças climáticas globais e do aumento da população humana (ex:poluição, aquecimento global, qualidade ambiental, saúde do oceano, doenças emergentes, avaliação de risco, segurança alimentar, sustentabilidade, serviços dos ecossistemas, novos fármacos/materiais/tecnologia,…).",
        "outings": "Investigação científica e tecnológica, Política e gestão (e.g. oceano, ambiente), Avaliação e gestão de risco (medicamentos, produtos químicos, outros riscos ambientais e de saúde), Avaliação de Impacte Ambiental, Tratamento de águas, Saúde, Biotecnologia, Economia azul, Economia circular, Segurança alimentar, Pesca e aquacultura, Agricultura, Energia, Produção de bens e serviços, Turismo, Gestão, transformação e aproveitamento de resíduos.",
        "typeOfCourse": "Mestrado",
        "duration": "4 Semestres / 120 ECTS"
    }
]